// Enum Athena.EFlameOfFateType
enum class EFlameOfFateType : uint8_t {
	Default,
	Cursed,
	DiedByShark,
	DiedByVolcano,
	DiedBySkeleton,
	DiedByLightning,
	DiedByVenom,
	DiedByPlayer,
	MAX,
	EFlameOfFateType_MAX,
};

// Enum Athena.EHealthChangedReason
enum class EHealthChangedReason : uint8_t {
	NoChange,
	Test,
	Reset,
	CannonProjectile,
	CannonBallSplashDamage,
	FallDamage,
	HealedFromFood,
	Drowning,
	DamagedBySwimmingCreature,
	StruckByLightning,
	Blunderbuss_Default,
	Pistol_Default,
	EyeOfReach_Default,
	Cutlass,
	GunpowderBarrelExplosion,
	IngestedByKrakenTentacle,
	PowerSlammedByKrakenTentacle,
	StarvedToDeath,
	SkeletonFormsHeal,
	Venom,
	Fire,
	Emote,
	TinySharkBite,
	SunkenCurseSelfHeal,
	SunkenCurseDamage,
	TinySharkRespawn,
	Lava,
	Boiling,
	StateTransfer,
	Fragile,
	Rainfall,
	Submerged,
	LiquidProjectile,
	Dry,
	StrainDamage,
	VolcanoInstantKill,
	VolcanicRock,
	DevilsShroud,
	Regeneration,
	HarpoonProjectile,
	Mechanism,
	KnockbackAIAbility,
	SpikePit,
	ChestOfRage,
	Scalded,
	Geyser,
	Flamethrower,
	AshenLordFireBreath,
	AshenWindsSkull,
	AshenWindsSkullCharge,
	Revive,
	HealedByAbility,
	Shocked,
	Siren,
	KrakenBite,
	Firework,
	Sleeping,
	DestroyAllShipAI,
	LighthouseBeam,
	TunnelOfTheDamned,
	MAX,
	EHealthChangedReason_MAX,
};

// Enum Athena.EShipPartCustomizationErrorCode
enum class EShipPartCustomizationErrorCode : uint8_t {
	AlreadyInProgress,
	FailedToCustomize,
	InvalidParameters,
	EShipPartCustomizationErrorCode_MAX,
};

// Enum Athena.ERequestState
enum class ERequestState : uint8_t {
	Invalid,
	Waiting,
	Complete,
	Timeout,
	Cancelled,
	ERequestState_MAX,
};

// Enum Athena.EPointSelectionMethod
enum class EPointSelectionMethod : uint8_t {
	GetRandom,
	GetFirst,
	GetClosest,
	EPointSelectionMethod_MAX,
};

// Enum Athena.ESpaceType
enum class ESpaceType : uint8_t {
	WorldSpace,
	LocalSpace,
	ESpaceType_MAX,
};

// Enum Athena.EWaterState
enum class EWaterState : uint8_t {
	Empty,
	Transitioning,
	Full,
	EWaterState_MAX,
};

// Enum Athena.EProjectileCollisionResponse
enum class EProjectileCollisionResponse : uint8_t {
	Ignore,
	Block,
	EProjectileCollisionResponse_MAX,
};

// Enum Athena.ESprintLockReason
enum class ESprintLockReason : uint8_t {
	WieldedItem,
	WieldedItemAction,
	Environment,
	ESprintLockReason_MAX,
};

// Enum Athena.ESwimAttackableType
enum class ESwimAttackableType : uint8_t {
	TakesDamage,
	SmallItem,
	LargeItem,
	ESwimAttackableType_MAX,
};

// Enum Athena.EAllianceStatus
enum class EAllianceStatus : uint8_t {
	IsInAlliance,
	IsNotInAlliance,
	EAllianceStatus_MAX,
};

// Enum Athena.ENPCCustomAnimationState
enum class ENPCCustomAnimationState : uint8_t {
	None,
	InOneShot,
	InContinuousIn,
	InContinuousLoopA,
	InContinuousLoopB,
	InContinuousOut,
	ENPCCustomAnimationState_MAX,
};

// Enum Athena.EAthenaNPCObjectSlot
enum class EAthenaNPCObjectSlot : uint8_t {
	Slot_2,
	Slot_3,
	Slot_4,
	Slot_5,
	Slot_6,
	Slot_7,
	Slot_8,
	Slot_9,
	Slot_10,
	Slot_11,
	Slot_MAX,
};

// Enum Athena.EAthenaNPCSpawnHand
enum class EAthenaNPCSpawnHand : uint8_t {
	Left,
	Right,
	EAthenaNPCSpawnHand_MAX,
};

// Enum Athena.EAnimNotifyUnderwaterMode
enum class EAnimNotifyUnderwaterMode : uint8_t {
	AutoDetect,
	AlwaysUnder,
	AlwaysAbove,
	EAnimNotifyUnderwaterMode_MAX,
};

// Enum Athena.EMeleeSpecialState
enum class EMeleeSpecialState : uint8_t {
	None,
	Lunge,
	Knockback,
	Stunned,
	Dodge,
	MAX,
	EMeleeSpecialState_MAX,
};

// Enum Athena.ESkeletonShipCaptainDockedAnimationState
enum class ESkeletonShipCaptainDockedAnimationState : uint8_t {
	None,
	Taunt,
	Ram,
	RamImpact,
	ESkeletonShipCaptainDockedAnimationState_MAX,
};

// Enum Athena.ESkeletonActiveAnimSystem
enum class ESkeletonActiveAnimSystem : uint8_t {
	Sensing,
	EmoteAction,
	ESkeletonActiveAnimSystem_MAX,
};

// Enum Athena.ESkeletonEmoteActionState
enum class ESkeletonEmoteActionState : uint8_t {
	None,
	Taunt,
	Cheer,
	ESkeletonEmoteActionState_MAX,
};

// Enum Athena.ESkeletonSensingState
enum class ESkeletonSensingState : uint8_t {
	None,
	InitialReaction,
	Searching,
	AlertingOthers,
	Pursuit,
	ESkeletonSensingState_MAX,
};

// Enum Athena.EKnockbackAnimDirection
enum class EKnockbackAnimDirection : uint8_t {
	Forwards,
	Backwards,
	EKnockbackAnimDirection_MAX,
};

// Enum Athena.EStunAnimationType
enum class EStunAnimationType : uint8_t {
	None,
	Normal,
	ShadowSkeletonLightExposure,
	SkeletonDrunk,
	SkeletonDance,
	SkeletonSleep,
	EStunAnimationType_MAX,
};

// Enum Athena.EArmOverlayState
enum class EArmOverlayState : uint8_t {
	Idle,
	Locomotion,
	Swimming,
	Turning,
	JumpingStart,
	JumpingCycle,
	JumpingPreImpact,
	JumpingLandLight,
	Equipping,
	UnEquipping,
	OneShotAction,
	ContinuousActionIn,
	ContinuousActionCycle,
	ContinuousActionOut,
	ContinuousActionLocomotion,
	ContinuousActionJumpStart,
	ContinuousActionJumpCycle,
	ContinuousActionJumpPreImpact,
	ContinuousActionJumpLandLight,
	ContinuousActionSwimming,
	ComplexOneShotWarmUp,
	ComplexOneShotAction,
	ComplexOneShotRecover,
	BlockingInto,
	BlockingLocomotion,
	BlockingFeedbackA,
	BlockingFeedbackB,
	BlockingOutOf,
	Force_FullBody,
	Force_UpperBody,
	Force_2H,
	EArmOverlayState_MAX,
};

// Enum Athena.EOceanCrawlerAIType
enum class EOceanCrawlerAIType : uint8_t {
	OceanCrawler,
	Crab,
	Eel,
	Hermit,
	EOceanCrawlerAIType_MAX,
};

// Enum Athena.ECharacterSwimmingMode
enum class ECharacterSwimmingMode : uint8_t {
	Surface,
	Submerged,
	Total,
	ECharacterSwimmingMode_MAX,
};

// Enum Athena.EAICharacterMaxSpeedModificationReason
enum class EAICharacterMaxSpeedModificationReason : uint8_t {
	SkeletonFormsConstant,
	SkeletonFormsEffects,
	SkeletonLimpCurse,
	EAICharacterMaxSpeedModificationReason_MAX,
};

// Enum Athena.EVoyageDisplayState
enum class EVoyageDisplayState : uint8_t {
	Default,
	Proposed,
	Locked,
	EVoyageDisplayState_MAX,
};

// Enum Athena.EOverlapType
enum class EOverlapType : uint8_t {
	PhysX,
	SimpleOverlaps,
	Ticking,
	EOverlapType_MAX,
};

// Enum Athena.ECharacterFootImpactType
enum class ECharacterFootImpactType : uint8_t {
	None,
	Walk,
	Jump,
	Pace,
	ECharacterFootImpactType_MAX,
};

// Enum Athena.EFlameColourType
enum class EFlameColourType : uint8_t {
	Light,
	FX,
	Glow,
	Flame,
	EFlameColourType_MAX,
};

// Enum Athena.EQuestBookPageRenderingMode
enum class EQuestBookPageRenderingMode : uint8_t {
	NoPagesRendered,
	DrawLeftPageAsCurrentOnly,
	DrawLeftPageAsPreviousAndRightPageAsCurrent,
	DrawLeftPageAsCurrentAndRightPageAsNext,
	EQuestBookPageRenderingMode_MAX,
};

// Enum Athena.EBT_ShipOwnership
enum class EBT_ShipOwnership : uint8_t {
	Any,
	Crew,
	Alliance,
	AI,
	EBT_MAX,
};

// Enum Athena.ECannonInteractionState
enum class ECannonInteractionState : uint8_t {
	AllInteractions,
	AimingEnabledLoadingDisabled,
	LoadingEnabledAimingDisabled,
	NoInteractions,
	ECannonInteractionState_MAX,
};

// Enum Athena.EShipCurseTag
enum class EShipCurseTag : uint8_t {
	None,
	Ballast,
	Barrel,
	Capstan,
	Helm,
	Rigging,
	Peace,
	EShipCurseTag_MAX,
};

// Enum Athena.ECurseTag
enum class ECurseTag : uint8_t {
	None,
	ToggleInteractionsForCapstan,
	ToggleInteractionsForShipStorageContainers,
	ToggleInteractionsForRigging,
	ToggleInteractionsForShipCannons,
	ToggleLockOnWheel,
	ECurseTag_MAX,
};

// Enum Athena.EShipSurfacingState
enum class EShipSurfacingState : uint8_t {
	SurfaceSailing,
	Surfacing,
	Diving,
	UnderwaterSailing,
	EShipSurfacingState_MAX,
};

// Enum Athena.EContainerType
enum class EContainerType : uint8_t {
	None,
	Bucket,
	Stomach,
	Kraken,
	Total,
	EContainerType_MAX,
};

// Enum Athena.EThrowableLiquidType
enum class EThrowableLiquidType : uint8_t {
	Empty,
	Water,
	Vomit,
	BoilingWater,
	Total,
	EThrowableLiquidType_MAX,
};

// Enum Athena.EBucketProjectileDestination
enum class EBucketProjectileDestination : uint8_t {
	Ahead,
	AtWielder,
	Max,
	EBucketProjectileDestination_MAX,
};

// Enum Athena.EBucketState
enum class EBucketState : uint8_t {
	Idle,
	Scooping,
	Throwing,
	DrenchingWielder,
	Max,
	Pad,
	EBucketState_MAX,
};

// Enum Athena.ELocationGeneratorSampleType
enum class ELocationGeneratorSampleType : uint8_t {
	None,
	Usable,
	Unusable_NoContact,
	Unusable_SurfaceType,
	Unusable_Proximity,
	Unusable_Slope,
	Unusable_BelowWater,
	ELocationGeneratorSampleType_MAX,
};

// Enum Athena.EBurrowEruptState
enum class EBurrowEruptState : uint8_t {
	Dormant,
	Erupt,
	EBurrowEruptState_MAX,
};

// Enum Athena.EHasBeenWieldedState
enum class EHasBeenWieldedState : uint8_t {
	InitialState,
	HasNotBeenWielded,
	HasBeenWielded,
	EHasBeenWieldedState_MAX,
};

// Enum Athena.ECarouselPirateBodyshapeDirection
enum class ECarouselPirateBodyshapeDirection : uint8_t {
	None,
	N,
	NW,
	W,
	SW,
	S,
	SE,
	E,
	NE,
	ECarouselPirateBodyshapeDirection_MAX,
};

// Enum Athena.EFogBankType
enum class EFogBankType : uint8_t {
	Default,
	Haunted,
	EFogBankType_MAX,
};

// Enum Athena.EPlayerMusicState
enum class EPlayerMusicState : uint8_t {
	InCave,
	InPuzzleVault,
	InsideShip,
	Fishing,
	KrakenEncounter,
	MusicZone_PriorityHigh,
	MusicZone_PriorityMed,
	MusicZone_PriorityLow,
	NoMusicState,
	OnBountyQuestPreAction,
	OnBountyQuestAction,
	OnBountyFortAnticipation,
	OnBountyFortPreAction,
	OnBountyFortAction,
	OnSeaFortAnticipation,
	OnSeaFortPreAction,
	OnSeaFortAction,
	OnIsland,
	OnIslandNearCompany,
	OutAtSea,
	ServerMigration,
	Shipwreck,
	SkellyShipEncounter,
	SkellyShipEmergentEncounter,
	TinySharkEncounter,
	TinySharkEncounterSpecial,
	UnderWater,
	InDeepSeaRegion,
	InvasionDive,
	InvasionEmerge,
	EnemyAIOnShipEncounter,
	EPlayerMusicState_MAX,
};

// Enum Athena.ECharacterSocketCollisionResultType
enum class ECharacterSocketCollisionResultType : uint8_t {
	CollisionsOnly,
	NonCollisionsOnly,
	CollisionsAndNonCollisions,
	ECharacterSocketCollisionResultType_MAX,
};

// Enum Athena.ECharacterSocketCollisionTraceType
enum class ECharacterSocketCollisionTraceType : uint8_t {
	WorldUp,
	WorldDown,
	WorldLeft,
	WorldRight,
	TravelForwards,
	TravelBackwards,
	ECharacterSocketCollisionTraceType_MAX,
};

// Enum Athena.ERageState
enum class ERageState : uint8_t {
	Disabled,
	Dormant,
	RageBuilding,
	Steaming,
	OnFire,
	ERageState_MAX,
};

// Enum Athena.EUIInputFocusType
enum class EUIInputFocusType : uint8_t {
	None,
	MouseCaptureOnly,
	FullCapture,
	EUIInputFocusType_MAX,
};

// Enum Athena.EVirtualKeyboardTextUsage
enum class EVirtualKeyboardTextUsage : uint8_t {
	TextChat,
	PetName,
	GenericText,
	EVirtualKeyboardTextUsage_MAX,
};

// Enum Athena.EScoreReason
enum class EScoreReason : uint8_t {
	None,
	SoldChest,
	SoldStolenChest,
	CrewShipSunk,
	DownedOpponent,
	KilledOpponent,
	ChestDugUp,
	MastHit,
	CapstanHit,
	WheelHit,
	HullHit,
	EScoreReason_MAX,
};

// Enum Athena.ESpecialEvents
enum class ESpecialEvents : uint8_t {
	None,
	StartBlinds,
	Leaderboard,
	TavernCeremony,
	ESpecialEvents_MAX,
};

// Enum Athena.EContestStagePivot
enum class EContestStagePivot : uint8_t {
	Beginning,
	Quater,
	HalfTime,
	ThirdQuater,
	End,
	EContestStagePivot_MAX,
};

// Enum Athena.EContestEventStages
enum class EContestEventStages : uint8_t {
	Staging,
	Contest,
	PostContest,
	Reward,
	EContestEventStages_MAX,
};

// Enum Athena.EMuteState
enum class EMuteState : uint8_t {
	NotMuted,
	VoiceMuted,
	ChatMuted,
	VoiceAndChatMuted,
	NonVerbalMuted,
	VoiceAndNonVerbalMuted,
	ChatAndNonVerbalMuted,
	AllMuted,
	EMuteState_MAX,
};

// Enum Athena.ECrewSpawnState
enum class ECrewSpawnState : uint8_t {
	Invalid,
	Onboarding,
	AtDock,
	OnShip,
	AtSinkLocation,
	AtMermaid,
	InBrig,
	InHideout,
	InContestTavern,
	AtProgressionLocation,
	ECrewSpawnState_MAX,
};

// Enum Athena.ESirenTridentProjectileState
enum class ESirenTridentProjectileState : uint8_t {
	None,
	Small,
	Medium,
	Large,
	MAX,
	ESirenTridentProjectileState_MAX,
};

// Enum Athena.EProjectileLauncherMechanismTargetMode
enum class EProjectileLauncherMechanismTargetMode : uint8_t {
	TargetLocations,
	ShipsAndWatercraft,
	EProjectileLauncherMechanismTargetMode_MAX,
};

// Enum Athena.EDamageTargetType
enum class EDamageTargetType : uint8_t {
	Player,
	Ship,
	EDamageTargetType_MAX,
};

// Enum Athena.EDiggingState
enum class EDiggingState : uint8_t {
	Initial,
	BeingDug,
	WaitingForPickup,
	EDiggingState_MAX,
};

// Enum Athena.EDrunkennessType
enum class EDrunkennessType : uint8_t {
	FromDrinkingAlcohol,
	FromDrunkenChest,
	NumTypes,
	EDrunkennessType_MAX,
};

// Enum Athena.EConeWeightingMethod
enum class EConeWeightingMethod : uint8_t {
	Weighted,
	Absolute,
	EConeWeightingMethod_MAX,
};

// Enum Athena.EShipHullDamageType
enum class EShipHullDamageType : uint8_t {
	Landscape,
	RammingSpur,
	EShipHullDamageType_MAX,
};

// Enum Athena.EFogState
enum class EFogState : uint8_t {
	NotSetUpYet,
	SetUp,
	FadingIn,
	Active,
	FadingOut,
	SeekingNewValue,
	EFogState_MAX,
};

// Enum Athena.EGlintCondition
enum class EGlintCondition : uint8_t {
	OnShip,
	Floating,
	SpawnedAsSunkenSalvage,
	SpawnedAsTallTaleQuestItem,
	SpawnedAsTreasureVaultReward,
	EGlintCondition_MAX,
};

// Enum Athena.EHarpoonLauncherReelingState
enum class EHarpoonLauncherReelingState : uint8_t {
	NotReeling,
	ReelingIn,
	ReelingLocked,
	EHarpoonLauncherReelingState_MAX,
};

// Enum Athena.EHarpoonLauncherRetractReason
enum class EHarpoonLauncherRetractReason : uint8_t {
	Default,
	PlayerInstigated,
	TetherLengthExeeded,
	EHarpoonLauncherRetractReason_MAX,
};

// Enum Athena.EHarpoonProjectileState
enum class EHarpoonProjectileState : uint8_t {
	Docked,
	InFlight,
	Attached,
	EHarpoonProjectileState_MAX,
};

// Enum Athena.EHoleState
enum class EHoleState : uint8_t {
	Alive,
	Dead,
	EHoleState_MAX,
};

// Enum Athena.ELeakEffectState
enum class ELeakEffectState : uint8_t {
	Off,
	LeakingWater,
	LeakingWaterPlugged,
	LeakingBubbles,
	LeakingBubblesPlugged,
	ELeakEffectState_MAX,
};

// Enum Athena.ELeakState
enum class ELeakState : uint8_t {
	Open,
	Plugged,
	ELeakState_MAX,
};

// Enum Athena.EShipLeakerUpdateType
enum class EShipLeakerUpdateType : uint8_t {
	Iterative,
	ForceAll,
	EShipLeakerUpdateType_MAX,
};

// Enum Athena.EVaultAudioSettings
enum class EVaultAudioSettings : uint8_t {
	Default,
	NoWater,
	NoMusic,
	TreasureVault,
	NoMusicOrCompletionSounds,
	EVaultAudioSettings_MAX,
};

// Enum Athena.EInventoryManipulatorAutoEquipPolicy
enum class EInventoryManipulatorAutoEquipPolicy : uint8_t {
	LastIn,
	MatchingItemDescIfPossible,
	RawMeatLast,
	EInventoryManipulatorAutoEquipPolicy_MAX,
};

// Enum Athena.EActionQueueEntryStatus
enum class EActionQueueEntryStatus : uint8_t {
	Unset,
	Set,
	Playing,
	Completed,
	EActionQueueEntryStatus_MAX,
};

// Enum Athena.EProjectileSpawnedState
enum class EProjectileSpawnedState : uint8_t {
	NotSpawned,
	Spawned,
	EProjectileSpawnedState_MAX,
};

// Enum Athena.ELightningHitTarget
enum class ELightningHitTarget : uint8_t {
	RandomLocation,
	Player,
	NearPlayer,
	Ship,
	ShipNearMiss,
	HighPriorityPlayer,
	EnemyGhostShip,
	EnemyGhostShipNearMiss,
	Total,
	ELightningHitTarget_MAX,
};

// Enum Athena.ELoadoutPersistence
enum class ELoadoutPersistence : uint8_t {
	Temporary,
	Persistent,
	ELoadoutPersistence_MAX,
};

// Enum Athena.ELPVAdaptationType
enum class ELPVAdaptationType : uint8_t {
	Full,
	CutTranslation,
	None,
	ELPVAdaptationType_MAX,
};

// Enum Athena.EForceBillowingState
enum class EForceBillowingState : uint8_t {
	NoOverride,
	ForceFullyBillowed,
	ForceNoBillow,
	EForceBillowingState_MAX,
};

// Enum Athena.EContestType
enum class EContestType : uint8_t {
	Race,
	PVP,
	PVQ,
	MAX,
	EContestType_MAX,
};

// Enum Athena.EMatchmakingServerType
enum class EMatchmakingServerType : uint8_t {
	Adventure,
	Contest,
	EMatchmakingServerType_MAX,
};

// Enum Athena.EPlayerAbandonedReason
enum class EPlayerAbandonedReason : uint8_t {
	None,
	NoCrewShip,
	FarFromShipAndOnLand,
	FarFromShipInWater,
	OnShip,
	CloseEnoughToCrewShip,
	OnWatercraft,
	CloseEnoughToWatercraft,
	InTheDeepSea,
	EPlayerAbandonedReason_MAX,
};

// Enum Athena.EPlayerAbandoned
enum class EPlayerAbandoned : uint8_t {
	Yes,
	No,
	DontKnow,
	EPlayerAbandoned_MAX,
};

// Enum Athena.EWalletBalanceStatus
enum class EWalletBalanceStatus : uint8_t {
	Unknown,
	Valid,
	EWalletBalanceStatus_MAX,
};

// Enum Athena.EOverlapShapeType
enum class EOverlapShapeType : uint8_t {
	Mesh,
	Box,
	EOverlapShapeType_MAX,
};

// Enum Athena.EMusicalTriggerState
enum class EMusicalTriggerState : uint8_t {
	NotActive,
	PreparingToActivateMechanism,
	MechanismActivated,
	EMusicalTriggerState_MAX,
};

// Enum Athena.ENonVerbalRadialCategory
enum class ENonVerbalRadialCategory : uint8_t {
	QuickAccess,
	Strategy,
	WieldedItem,
	ControlledObject,
	Invalid,
	ENonVerbalRadialCategory_MAX,
};

// Enum Athena.ENPCIdleVariantType
enum class ENPCIdleVariantType : uint8_t {
	Standard,
	Inactive,
	Interact,
	ENPCIdleVariantType_MAX,
};

// Enum Athena.ETutorialDialogOption
enum class ETutorialDialogOption : uint8_t {
	None,
	ReturnToStrangerCompanyVoyageDialogOption,
	ReturnToStrangerTallTaleDialogOption,
	ReturnToStrangerGoItAloneDialogOption,
	ETutorialDialogOption_MAX,
};

// Enum Athena.ETutorialDialogStep
enum class ETutorialDialogStep : uint8_t {
	None,
	StartedTalkedToMysteriousStranger,
	FinishedTalkingToMysteriousStranger,
	ETutorialDialogStep_MAX,
};

// Enum Athena.EPiratePreviewSkeletonCurseMode
enum class EPiratePreviewSkeletonCurseMode : uint8_t {
	KeepPirateAsIs,
	ForceRemoveSkeletonCurse,
	ForceApplySkeletonCurse,
	EPiratePreviewSkeletonCurseMode_MAX,
};

// Enum Athena.EStartGameNarrativeMediaSize
enum class EStartGameNarrativeMediaSize : uint8_t {
	Undefined,
	Default,
	LargeWide,
	EStartGameNarrativeMediaSize_MAX,
};

// Enum Athena.EStartGameNarrativePositionY
enum class EStartGameNarrativePositionY : uint8_t {
	Undefined,
	Top,
	Middle,
	Bottom,
	EStartGameNarrativePositionY_MAX,
};

// Enum Athena.EStartGameNarrativePositionX
enum class EStartGameNarrativePositionX : uint8_t {
	Undefined,
	Left,
	Middle,
	Right,
	EStartGameNarrativePositionX_MAX,
};

// Enum Athena.EMockShipConnectionPartType
enum class EMockShipConnectionPartType : uint8_t {
	HoistToMast,
	AngleToMast,
	Total,
	EMockShipConnectionPartType_MAX,
};

// Enum Athena.EPLSectionType
enum class EPLSectionType : uint8_t {
	Module,
	Link,
	Count,
	EPLSectionType_MAX,
};

// Enum Athena.EPiratePreviewRTTState
enum class EPiratePreviewRTTState : uint8_t {
	Uninitialized,
	Busy,
	ReadyToCapture,
	CompletedCapture,
	EPiratePreviewRTTState_MAX,
};

// Enum Athena.EPlayerCurseTag
enum class EPlayerCurseTag : uint8_t {
	None,
	Limping,
	Poisoned,
	Drunk,
	Silenced,
	Dancing,
	Sleeping,
	Vomit,
	EPlayerCurseTag_MAX,
};

// Enum Athena.ERefreshEntitlementBehaviour
enum class ERefreshEntitlementBehaviour : uint8_t {
	TryUsingCachedServicesEntitlements,
	FullRefresh,
	ERefreshEntitlementBehaviour_MAX,
};

// Enum Athena.EPlayerHeroStatsSuccess
enum class EPlayerHeroStatsSuccess : uint8_t {
	Success,
	Success_Zero,
	NotAutonomousProxy,
	NoLocalUser,
	PlayerIdInvalid,
	NoClientData,
	StartOfSessionValueNotSet,
	NoServerData,
	NoHeroStatData,
	OnlineStatsPtrNull,
	OnlineStats_UnknownError,
	OnlineStats_InvalidStatId,
	OnlineStats_InvalidArgument,
	OnlineStats_InvalidUser,
	EPlayerHeroStatsSuccess_MAX,
};

// Enum Athena.EPremiumCatalogOfferType
enum class EPremiumCatalogOfferType : uint8_t {
	Undefined,
	Tab,
	BundleSet,
	ItemSet,
	Cards,
	Item,
	Offer,
	EPremiumCatalogOfferType_MAX,
};

// Enum Athena.ECatalogOfferAvailability
enum class ECatalogOfferAvailability : uint8_t {
	Available,
	AlreadyOwned,
	Locked,
	Info,
	Hide,
	Unaffordable,
	ECatalogOfferAvailability_MAX,
};

// Enum Athena.EPremiumStoreLandingPageItemType
enum class EPremiumStoreLandingPageItemType : uint8_t {
	Bundle,
	Set,
	Cards,
	Item,
	EPremiumStoreLandingPageItemType_MAX,
};

// Enum Athena.EProjectileLauncherMechanismMode
enum class EProjectileLauncherMechanismMode : uint8_t {
	OneShot,
	Continuous,
	EProjectileLauncherMechanismMode_MAX,
};

// Enum Athena.EProjectileWeaponFireType
enum class EProjectileWeaponFireType : uint8_t {
	Aiming,
	HipFire,
	MAX,
	EProjectileWeaponFireType_MAX,
};

// Enum Athena.EProjectileWeaponType
enum class EProjectileWeaponType : uint8_t {
	Pistol,
	Blunderbuss,
	EyeOfReach,
	MAX,
	EProjectileWeaponType_MAX,
};

// Enum Athena.EProjectileWeaponState
enum class EProjectileWeaponState : uint8_t {
	Equipping,
	Idle,
	Aiming,
	Recoil,
	Reloading,
	InterruptedReload,
	EProjectileWeaponState_MAX,
};

// Enum Athena.EPuzzleStatueActivatedMechanismType
enum class EPuzzleStatueActivatedMechanismType : uint8_t {
	Generic,
	WaterLevelUp,
	WaterLevelDown,
	EPuzzleStatueActivatedMechanismType_MAX,
};

// Enum Athena.EReactionSequenceState
enum class EReactionSequenceState : uint8_t {
	None,
	BeginSuccessfulSequence,
	BeginUnsuccessfulSequence,
	EndSuccessfulSequence,
	EndUnsuccessfulSequence,
	Reset,
	Cancelled,
	MAX,
	EReactionSequenceState_MAX,
};

// Enum Athena.EAllocationStrategy
enum class EAllocationStrategy : uint8_t {
	Normal,
	LowPriority,
	NonAllocated,
	EAllocationStrategy_MAX,
};

// Enum Athena.EShadowAIFormState
enum class EShadowAIFormState : uint8_t {
	Invalid,
	Light,
	Dark,
	EShadowAIFormState_MAX,
};

// Enum Athena.EShipBuilderState
enum class EShipBuilderState : uint8_t {
	Idle,
	LoadingTemplate,
	CustomizingParts,
	EShipBuilderState_MAX,
};

// Enum Athena.EShipBuilderErrorCode
enum class EShipBuilderErrorCode : uint8_t {
	AlreadyInProgress,
	AssetLoadingFailure,
	FailedToSpawnActor,
	FailedToBuildParts,
	InvalidParameter,
	InvalidShipDesc,
	Cancelled,
	SpawnedActorWasNotAShip,
	EShipBuilderErrorCode_MAX,
};

// Enum Athena.EShipParticleParam
enum class EShipParticleParam : uint8_t {
	None,
	DeckWater,
	FloodLevel,
	Total,
	EShipParticleParam_MAX,
};

// Enum Athena.EPurchaseRequestFailureReason
enum class EPurchaseRequestFailureReason : uint8_t {
	ServiceUnavailable,
	OfferUnavailable,
	InsufficientFunds,
	RequestTimeout,
	PurchaseAlreadyPending,
	EPurchaseRequestFailureReason_MAX,
};

// Enum Athena.EShovelState
enum class EShovelState : uint8_t {
	Idle,
	Exhuming,
	Burying,
	EShovelState_MAX,
};

// Enum Athena.EAthenaSafeZoneEnum
enum class EAthenaSafeZoneEnum : uint8_t {
	NONE,
	MAINWORLD_SAFEZONE,
	TRIBUTEPEAK_SAFEZONE,
	EAthenaSafeZoneEnum_MAX,
};

// Enum Athena.EShroudBreakerActivationStateEnum
enum class EShroudBreakerActivationStateEnum : uint8_t {
	DEACTIVE,
	STAGE_2,
	STAGE_3,
	STAGE_4,
	STAGE_5,
	EShroudBreakerActivationStateEnum_MAX,
};

// Enum Athena.EDoorState
enum class EDoorState : uint8_t {
	Closed,
	Triggered,
	Opening,
	Open,
	EDoorState_MAX,
};

// Enum Athena.ESkellyFortType
enum class ESkellyFortType : uint8_t {
	Default,
	Damned,
	Max,
	ESkellyFortType_MAX,
};

// Enum Athena.EDamnedFortAudioState
enum class EDamnedFortAudioState : uint8_t {
	Inactive,
	BattleMusic,
	BattleMusicWithCaptain,
	Finished,
	MAX,
	EDamnedFortAudioState_MAX,
};

// Enum Athena.EStaggerReason
enum class EStaggerReason : uint8_t {
	Drunk,
	Earthquake,
	NumReasons,
	EStaggerReason_MAX,
};

// Enum Athena.EStunnedActionStateItemWielding
enum class EStunnedActionStateItemWielding : uint8_t {
	Allowed,
	Disallowed,
	EStunnedActionStateItemWielding_MAX,
};

// Enum Athena.EStunnedActionStateDurationType
enum class EStunnedActionStateDurationType : uint8_t {
	Definite,
	Indefinite,
	EStunnedActionStateDurationType_MAX,
};

// Enum Athena.ERitualState
enum class ERitualState : uint8_t {
	Disabled,
	PrePrimed,
	Primed,
	Stopped,
	Started,
	Complete,
	ERitualState_MAX,
};

// Enum Athena.ESwimmingCreatureType
enum class ESwimmingCreatureType : uint8_t {
	SwimmingCreature,
	Shark,
	TinyShark,
	Siren,
	ESwimmingCreatureType_MAX,
};

// Enum Athena.ESelectionPolicy
enum class ESelectionPolicy : uint8_t {
	Random,
	Closest,
	ESelectionPolicy_MAX,
};

// Enum Athena.EAISpawnerShutdownPolicy
enum class EAISpawnerShutdownPolicy : uint8_t {
	SpawnerShutsDownWhenPlayersNoLongerTracked,
	SpawnerShutsDownWhenStepEnd,
	EAISpawnerShutdownPolicy_MAX,
};

// Enum Athena.EAILifeTimePolicy
enum class EAILifeTimePolicy : uint8_t {
	SpawnWhenVoyageParticipantsEnterDespawnWhenAllLeave,
	SpawnWhenVoyageParticipantsEnterDespawnWhenAllVoyageParticipantsLeave,
	SpawnWhenAnyEnterDespawnWhenAllLeave,
	EAILifeTimePolicy_MAX,
};

// Enum Athena.ETankardLiquidType
enum class ETankardLiquidType : uint8_t {
	Grog,
	ExtraStrongGrog,
	ETankardLiquidType_MAX,
};

// Enum Athena.EStepsTriggerState
enum class EStepsTriggerState : uint8_t {
	Closed,
	Opening,
	Open,
	EStepsTriggerState_MAX,
};

// Enum Athena.ETinVoyageDifficulty
enum class ETinVoyageDifficulty : uint8_t {
	Easy,
	Medium,
	Hard,
	ETinVoyageDifficulty_MAX,
};

// Enum Athena.ETreasureRoomState
enum class ETreasureRoomState : uint8_t {
	Inactive,
	Waiting,
	Combat,
	CombatOver,
	Aftermath,
	ETreasureRoomState_MAX,
};

// Enum Athena.EItemSpawnType
enum class EItemSpawnType : uint8_t {
	None,
	Scaffolding,
	Reward,
	PressurePlate,
	EItemSpawnType_MAX,
};

// Enum Athena.EEvaluationType
enum class EEvaluationType : uint8_t {
	PerPlayer,
	WholeCrew,
	EEvaluationType_MAX,
};

// Enum Athena.EMurkWaterModifierZoneState
enum class EMurkWaterModifierZoneState : uint8_t {
	Active,
	Inactive,
	Activating,
	Deactivating,
	EMurkWaterModifierZoneState_MAX,
};

// Enum Athena.EWeepingState
enum class EWeepingState : uint8_t {
	Weeping,
	Calm,
	EWeepingState_MAX,
};

// Enum Athena.EWheelFractureLabel
enum class EWheelFractureLabel : uint8_t {
	West,
	East,
	South,
	EWheelFractureLabel_MAX,
};

// Enum Athena.EAudioGameState
enum class EAudioGameState : uint8_t {
	None,
	InGame,
	InFrontendWrapper,
	InFrontendMatineeSequence,
	EAudioGameState_MAX,
};

// Enum Athena.ELocalGameChatStatus
enum class ELocalGameChatStatus : uint8_t {
	Undefined,
	NoMicrophone,
	MicrophoneMuted,
	InPartyChat,
	Ready,
	ELocalGameChatStatus_MAX,
};

// Enum Athena.EVoiceChatAudioDevice
enum class EVoiceChatAudioDevice : uint8_t {
	None,
	Headset,
	Kinect,
	EVoiceChatAudioDevice_MAX,
};

// Enum Athena.EBootflowError
enum class EBootflowError : uint8_t {
	None,
	Unknown,
	AthenaGameInstanceFailedToConnectToServer,
	AthenaGameInstanceActiveConnectionToServerLost,
	AthenaGameInstanceActiveConnectionToServerTimedOut,
	AthenaGameInstanceInitialConnectionToServerTimedOut,
	AthenaGameInstancePendingConnectionToServerTimedOut,
	AthenaGameInstancePendingConnectionToServerLost,
	AthenaGameInstanceGameVersionMismatch,
	AthenaGameInstanceGenericDisconnectMessage,
	AthenaGameInstanceNetDriverFailure,
	AthenaGameInstanceInvalidFeatureConfig,
	AthenaGameInstanceRPCSpamDetected,
	AthenaGameInstancePlayerDeemedInactive,
	AthenaGameInstanceInvalidServerURL,
	AthenaGameInstanceGameAssetMismatch,
	AthenaGameInstanceGenericTravelError,
	AthenaGameInstanceCrewMigrationRequested,
	AthenaGameInstanceCrewSessionLost,
	AthenaGameInstanceServerShuttingDown,
	ClientBootflowPrimaryPlayerSignedOut,
	ClientBootflowPlayerSuspendedGame,
	ClientBootflowLostConnectionToXboxLive,
	ClientBootflowEthernetConnectionUnplugged,
	ClientEvicted,
	ClientInGameStateWasIdleForTooLong,
	ClientInGameStateUnableToFindLocalUserId,
	ClientInGameStateUnableToObtainLocalPlayerInterface,
	ClientInGameStateStopMatchmakingFailed,
	ClientJoinServerStateFailed,
	CrewMatchmakingStateLocalUserHasInvalidId,
	CrewMatchmakingStateUnableToObtainLocalUserId,
	CrewMatchmakingStateUnableToObtainLocalPlayerInterface,
	CrewMatchmakingStateMatchmakingFailed,
	CrewSessionStateUnableToObtainLocalUserId,
	CrewSessionStateUnableToObtainLocalPlayerInterface,
	CrewSessionStateFailedToCreateCrewSession,
	CrewSessionStateInvalidCrewSessionTypeReceived,
	CrewSessionStateInvalidServicesResponse,
	CrewSessionOnSessionLost,
	DiscoveryServiceStateRequestFailedNotAuthorized,
	DiscoveryServiceStateRequestFailed,
	EmblemDefinitionRetrievalFailed,
	EngageStateInviteHadInvalidControllerId,
	EngageStateNoLocalPlayerFound,
	EntryLevelStateFailedToLoadDefaultMap,
	EntryLevelStateFailed,
	LoadLevelStateTimeout,
	LoadLevelStateFailed,
	LoadUserSettingsStateFailed,
	LoginTokenExchangePlayerFailedFlightingCheck,
	LoginTokenExchangePlayerFailedOtherTitleCheck,
	LoginTokenExchangeFailed,
	LoginTokenExchangeFailedPlayerBannedPerm,
	LoginTokenExchangeFailedPlayerBannedTemp,
	LoginTokenExchangeFailedSteamError,
	LoginTokenExchangeFailedSteamIncorrectAppToken,
	LoginTokenExchangeFailedSteamTokenInvalid,
	LoginTokenExchangeFailedSteamUnlicensed,
	LoginTokenExchangeFailedSteamMissingXuid,
	LoginTokenExchangeFailedSteamBadApiResponse,
	LoginTokenExchangeFailedSteamUnreachableEndpoint,
	LoginTokenExchangeFailedTitleVersionInvalid,
	SelectUserStateFailedToShowSignInUI,
	SelectUserStateFailedToObtainValidControllerId,
	SelectUserStateFailedToObtainValidLocalPlayer,
	SelectUserStateNotConnectedToLive,
	SelectUserStateNotSignedInWhileUnattended,
	SelectUserStateUserDoesNotHaveUniqueNetId,
	SelectUserStateUserDidNotSignIn,
	SelectUserStateUserIsGuest,
	SelectUserStateInsufficientPrivilegesToPlay,
	SelectUserStateInvalidIdentityInterface,
	ServerMatchmakingStateSandboxDisabled,
	ServerMatchmakingStateUnableToObtainCrewId,
	ServerMatchmakingStateUnableToObtainLocalPlayerInterface,
	ServerMatchmakingStateInvalidPirateIdentity,
	ServerMatchmakingStateNoServersAvailable,
	ServerMatchmakingStateInvalidMatchmakingResponse,
	ServerMatchmakingStateInvalidResponse,
	ServerMatchmakingStateMatchmakingTimedOut,
	ServerMatchmakingStateUnexpectedResult,
	ServerMatchmakingStateJoinRefused,
	ServerMatchmakingStateUnsupportedVersion,
	ServerAtMatchmakingCapacity,
	ServerShuttingDownWhilstMigrationIsOngoing,
	SetupConfigurationServiceStateConfigServiceRequestFailed,
	SetupCrewSessionStateFailedToJoinCrewSession,
	SetupCrewSessionStateFailedToCreateCrewSession,
	SetupServiceBridgeStateFailed,
	SetupTelemetryDispatcherStateFailed,
	CrewSessionHandlerJoinFailedAsCrewIsFull,
	CrewSessionHandlerJoinFailedAsCrewDoesntExist,
	CrewSessionHandlerJoinFailedAsCouldNotRetrieveAddress,
	CrewSessionHandlerJoinFailedAsUnknownErrorOccurred,
	PirateSelectionStateUnableToObtainLocalPlayerInterface,
	PirateSelectionStateUnableToRetrievePirates,
	PirateSelectionStateUnableToCreatePirate,
	PirateSelectionStateUnableToReRollPirate,
	SessionSelectInvalidSessionTypeSpecified,
	InvitePrivilegesCheckFailed,
	InviteUnableToRetrieveSession,
	InviteSessionXboxPadOnly,
	InviteSessionNoBannedData,
	InviteSessionFull,
	InviteSessionUnknownFailure,
	InviteSessionNoTransferHandle,
	InviteSessionUnableToFindTargetSession,
	InviteSessionIsNotJoinable,
	FailedToEnumerateEntitlements,
	WhatsNewArticleRetrievalStateInvalidIdentityInterface,
	FailedToFetchExistingSessions,
	FailedToDisconnectFromServiceBridge,
	LobbySesssionHandlerFailedToCreateLobbySession,
	LobbySesssionHandlerFailedToJoinLobbySession,
	LobbySessionHandlerJoinFailedAsUnknownErrorOccurred,
	LobbySessionHandlerJoinFailedAsCouldNotRetrieveAddress,
	LobbySessionHandlerJoinFailedAsSessionIsFull,
	LobbySessionHandlerJoinFailedAsSessionDoesntExist,
	LobbySessionInviteIsNotJoinable,
	CreatorModeSessionStateFailedToCreateLobbySession,
	CreatorModeSessionStateFailedToJoinLobbySession,
	CreatorModeSessionStateFailedToAdoptCrewSession,
	CreatorModeSessionStateFailedToLeaveLobbySession,
	CreatorModeSessionStateFailedToRegisterCrewsOnService,
	CreatorModeSessionStateFailedToReplicateCrewsFromService,
	LobbySessionCrewlessPlayer,
	StampSwapDiscoveryRequestFailed,
	StampSwapDiscoveryRequestFailedNotAuthorized,
	StampSwapLoginTokenExchangeFailed,
	StampSwapLoginTokenExchangeFailedPlayerBannedPerm,
	StampSwapLoginTokenExchangeFailedPlayerBannedTemp,
	StampSwapLoginTokenExchangeFailedSteamError,
	StampSwapLoginTokenExchangeFailedSteamIncorrectAppToken,
	StampSwapLoginTokenExchangeFailedSteamTokenInvalid,
	StampSwapLoginTokenExchangeFailedSteamUnlicensed,
	StampSwapLoginTokenExchangeFailedTitleVersionInvalid,
	StampSwapLoginTokenExchangePlayerFailedFlightingCheck,
	StampSwapLoginTokenExchangePlayerFailedOtherTitleCheck,
	StampSwapSetupServiceBridgeFailed,
	StampSwapFailedToDisconnectFromServiceBridge,
	LoginTokenExchangeFailedUWPLicenseMissing,
	LoginTokenExchangeFailedUWPInvalidLicense,
	LoginTokenExchangeFailedUWPReplayLicense,
	LoginTokenExchangeFailedUWPInvalidLicenseCertificate,
	LoginTokenExchangeFailedUWPNoSuitableProductLicense,
	LoginTokenExchangeFailedUWPMissingSandboxClaim,
	LoginTokenExchangeFailedClockSkew,
	LoginTokenExchangeFailedInvalidDeviceType,
	TestFailed,
	TestNetworkError,
	Max,
	EBootflowError_MAX,
};

// Enum Athena.EBootflowErrorPriority
enum class EBootflowErrorPriority : uint8_t {
	High,
	AboveNormal,
	Normal,
	BelowNormal,
	Low,
	EBootflowErrorPriority_MAX,
};

// Enum Athena.EUISessionLobbyType
enum class EUISessionLobbyType : uint8_t {
	Invalid,
	Open,
	Closed,
	Guild,
	EUISessionLobbyType_MAX,
};

// Enum Athena.ECreativeLobbyState
enum class ECreativeLobbyState : uint8_t {
	Open,
	ReadyToSetSail,
	Count,
	ECreativeLobbyState_MAX,
};

// Enum Athena.ECreationMode
enum class ECreationMode : uint8_t {
	Invalid,
	Create,
	Join,
	ECreationMode_MAX,
};

// Enum Athena.EStoreAsyncResult
enum class EStoreAsyncResult : uint8_t {
	Unknown,
	GetAccessTokenInvalidHttpRequest,
	GetAccessTokenTimeout,
	GetAccessTokenCancelled,
	GetAccessTokenFailure,
	GetPurchaseRedemptionTokenInterfaceInvalid,
	GetPurchaseRedemptionTokenOnlineStoreFailure,
	GetPurchaseRedemptionTokenFailure,
	PostPurchaseRedemptionTokenInvalidHttpRequest,
	PostPurchaseRedemptionTokenCancelled,
	PostPurchaseRedemptionTokenTimeout,
	PostPurchaseRedemptionTokenFailure,
	Success,
	EStoreAsyncResult_MAX,
};

// Enum Athena.EWaitForLoadingScreenSubState
enum class EWaitForLoadingScreenSubState : uint8_t {
	Invalid,
	CacheLoadingScreenDataAssetParams,
	CacheLoadingScreenLoadingScreenParams,
	CacheLoadingScreenContent,
	Complete,
	EWaitForLoadingScreenSubState_MAX,
};

// Enum Athena.EStreamingPlatform
enum class EStreamingPlatform : uint8_t {
	Twitch,
	Mixer,
	YouTube,
	EStreamingPlatform_MAX,
};

// Enum Athena.EWaterPuzzleAlterationEndingState
enum class EWaterPuzzleAlterationEndingState : uint8_t {
	Invalid,
	Normal,
	MaxToMax,
	EWaterPuzzleAlterationEndingState_MAX,
};

// Enum Athena.EMeleeAttackMoveCorrectionReason
enum class EMeleeAttackMoveCorrectionReason : uint8_t {
	NotSpecified,
	SpedUpTooSoon,
	EMeleeAttackMoveCorrectionReason_MAX,
};

// Enum Athena.EInteractableOverlayActionType
enum class EInteractableOverlayActionType : uint8_t {
	None,
	Activate,
	EInteractableOverlayActionType_MAX,
};

// Enum Athena.EServerTeleportAckReason
enum class EServerTeleportAckReason : uint8_t {
	Invalid,
	Complete,
	Timeout,
	EServerTeleportAckReason_MAX,
};

// Enum Athena.EVirtualKeyboardInputScope
enum class EVirtualKeyboardInputScope : uint8_t {
	Alphanumeric,
	Default,
	Email,
	Number,
	Password,
	Search,
	TelephoneNumber,
	Url,
	EVirtualKeyboardInputScope_MAX,
};

// Enum Athena.EReputationNavigationAction
enum class EReputationNavigationAction : uint8_t {
	Company,
	Commendations,
	Ledger,
	EReputationNavigationAction_MAX,
};

// Enum Athena.EServerCameraFadeAckReason
enum class EServerCameraFadeAckReason : uint8_t {
	Invalid,
	Complete,
	Timeout,
	EServerCameraFadeAckReason_MAX,
};

// Enum Athena.EConsumeEntitlementFailureReason
enum class EConsumeEntitlementFailureReason : uint8_t {
	ServiceUnavailable,
	ItemNotFound,
	RequestTimeout,
	PreconditionFailed,
	Unknown,
	EConsumeEntitlementFailureReason_MAX,
};

// Enum Athena.EQuestGenAssetSuffix
enum class EQuestGenAssetSuffix : uint8_t {
	Default,
	Underground,
	AISpawn,
	EQuestGenAssetSuffix_MAX,
};

// Enum Athena.EPurchaseOfferFailureReason
enum class EPurchaseOfferFailureReason : uint8_t {
	ServiceUnavailable,
	OfferUnavailable,
	InsufficientFunds,
	EPurchaseOfferFailureReason_MAX,
};

// Enum Athena.EHttpRequestTelemetryResult
enum class EHttpRequestTelemetryResult : uint8_t {
	None,
	Completed,
	Failed,
	Cancelled,
	Aborted,
	EHttpRequestTelemetryResult_MAX,
};

// Enum Athena.EServerMatchmakingFailureReason
enum class EServerMatchmakingFailureReason : uint8_t {
	NoServersAvailable,
	CrewServerRequestBeingProcessed,
	CrewBeingMigrated,
	SandboxDisabled,
	EServerMatchmakingFailureReason_MAX,
};

// Enum Athena.EStoreRemoteServiceFutureStatus
enum class EStoreRemoteServiceFutureStatus : uint8_t {
	Unknown,
	NotStarted,
	Failed,
	Succeeded,
	Cancelled,
	TimedOut,
	EStoreRemoteServiceFutureStatus_MAX,
};

// Enum Athena.EServerEnvironmentShutdownStatus
enum class EServerEnvironmentShutdownStatus : uint8_t {
	NotSet,
	Starting,
	StandingBy,
	Active,
	EServerEnvironmentShutdownStatus_MAX,
};

// Enum Athena.EPreLoginDeniedReason
enum class EPreLoginDeniedReason : uint8_t {
	None,
	PirateRetreival,
	EntitlementsRetrieval,
	MPSDValidation,
	CrewNoLongerOnServer,
	CrewAssignmentFailed,
	AuthTokenValidation,
	UWPJoinAttemptRefusal,
	EPreLoginDeniedReason_MAX,
};

// Enum Athena.EIntroVideoStateSkipReason
enum class EIntroVideoStateSkipReason : uint8_t {
	Unknown,
	FeatureDisabled,
	AutoProceed,
	PendingInvite,
	Debug,
	EIntroVideoStateSkipReason_MAX,
};

// Enum Athena.EFriendStatus
enum class EFriendStatus : uint8_t {
	None,
	Online,
	Offline,
	Away,
	EFriendStatus_MAX,
};

// Enum Athena.ESlidingDoorDirection
enum class ESlidingDoorDirection : uint8_t {
	Up,
	Down,
	Forward,
	Back,
	ESlidingDoorDirection_MAX,
};

// Enum Athena.ESlidingDoorState
enum class ESlidingDoorState : uint8_t {
	Closing,
	Closed,
	Opening,
	Open,
	ESlidingDoorState_MAX,
};

// Enum Athena.ESwingDoorState
enum class ESwingDoorState : uint8_t {
	Closing,
	Closed,
	Opening,
	Open,
	ESwingDoorState_MAX,
};

// Enum Athena.ENPCOnSurfaceDespawnReason
enum class ENPCOnSurfaceDespawnReason : uint8_t {
	PlayersLeftShip,
	ShipSinking,
	ChangingLocation,
	CurrentLocationUnderWater,
	ChangingState,
	Hiding,
	ManningCannon,
	CurrentLocationOnFire,
	BeingPermanentlyDestroyed,
	ENPCOnSurfaceDespawnReason_MAX,
};

// Enum Athena.ENPCOnSurfaceFloodedLevel
enum class ENPCOnSurfaceFloodedLevel : uint8_t {
	Empty,
	LowerDeckFlooded,
	MidDeckFlooded,
	Sunk,
	ENPCOnSurfaceFloodedLevel_MAX,
};

// Enum Athena.EOpenableItemState
enum class EOpenableItemState : uint8_t {
	Open,
	Closed,
	EOpenableItemState_MAX,
};

// Enum Athena.ETradeRouteMapTextIdentifier
enum class ETradeRouteMapTextIdentifier : uint8_t {
	Misc,
	Vessel,
	Origin,
	Destination,
	ETradeRouteMapTextIdentifier_MAX,
};

// Enum Athena.ELoadPersistance
enum class ELoadPersistance : uint8_t {
	Permanent,
	FrontEndOnly,
	CallbackOnly,
	ELoadPersistance_MAX,
};

// Enum Athena.EDelayLoadPhase
enum class EDelayLoadPhase : uint8_t {
	Boot,
	FeatureConfigAvailable,
	FrontEnd,
	EngageState,
	PreloadGame,
	InGame,
	Count,
	EDelayLoadPhase_MAX,
};

// Enum Athena.EServerAsyncLoadingAckReason
enum class EServerAsyncLoadingAckReason : uint8_t {
	Invalid,
	Complete,
	Timeout,
	EServerAsyncLoadingAckReason_MAX,
};

// Enum Athena.ETelemetryPlatformId
enum class ETelemetryPlatformId : uint8_t {
	Undefined,
	Aoelus,
	Xbox,
	Windows,
	SteamDeck,
	DevPC,
	ETelemetryPlatformId_MAX,
};

// Enum Athena.ECompanyStatus
enum class ECompanyStatus : uint8_t {
	Invalid,
	Pending,
	Valid,
	ECompanyStatus_MAX,
};

// Enum Athena.ERequestEntitlementBehaviour
enum class ERequestEntitlementBehaviour : uint8_t {
	Default,
	ForceRefresh,
	ERequestEntitlementBehaviour_MAX,
};

// Enum Athena.EEntitlementConsumptionState
enum class EEntitlementConsumptionState : uint8_t {
	Failed,
	Succeeded,
	TimedOut,
	EEntitlementConsumptionState_MAX,
};

// Enum Athena.EEntitlementStatus
enum class EEntitlementStatus : uint8_t {
	Unknown,
	Invalid,
	UsableButUnverified,
	UsableAndVerfied,
	EEntitlementStatus_MAX,
};

// Enum Athena.EProgressStyle
enum class EProgressStyle : uint8_t {
	Circle,
	Square,
	Hexagon,
	Diamond,
	SeaDogs,
	HuntersCall,
	ReapersBones,
	FactionB,
	FactionG,
	Guild,
	EProgressStyle_MAX,
};

// Enum Athena.EWieldAnimationGraph
enum class EWieldAnimationGraph : uint8_t {
	ThirdPerson,
	FirstPerson,
	EWieldAnimationGraph_MAX,
};

// Enum Athena.EWieldAnimationLocation
enum class EWieldAnimationLocation : uint8_t {
	Left,
	Right,
	Floating,
	LF_CAMERA_IK_HAND__Skeleton,
	RT_CAMERA_IK_HAND__Skeleton,
	LF_IK_HAND__Skeleton,
	RT_IK_HAND__Skeleton,
	Total,
	EWieldAnimationLocation_MAX,
};

// Enum Athena.ECharacterHitReactionAnimType
enum class ECharacterHitReactionAnimType : uint8_t {
	Full,
	Flinch,
	None,
	Override,
	ECharacterHitReactionAnimType_MAX,
};

// Enum Athena.EFacialPriority
enum class EFacialPriority : uint8_t {
	Low,
	Medium,
	High,
	MustPlay,
	EFacialPriority_MAX,
};

// Enum Athena.ELocomotionType
enum class ELocomotionType : uint8_t {
	Standard,
	Limp,
	Drunk,
	PegLeg,
	Combat,
	HotCoals,
	MAX,
	ELocomotionType_MAX,
};

// Enum Athena.EStairAnimations
enum class EStairAnimations : uint8_t {
	UpLeft,
	UpRight,
	DownLeft,
	DownRight,
	EStairAnimations_MAX,
};

// Enum Athena.EArmOverlayFlags
enum class EArmOverlayFlags : uint8_t {
	RightArmOnly,
	FullBody,
	UpperBody,
	UpperBodyLeft,
	UpperBodyRight,
	TwoHanded,
	EArmOverlayFlags_MAX,
};

// Enum Athena.EInputControllerType
enum class EInputControllerType : uint8_t {
	GamePad,
	Keyboard,
	EInputControllerType_MAX,
};

// Enum Athena.EConditionalStatType
enum class EConditionalStatType : uint8_t {
	PlayerOnly,
	WholeCrew,
	WholeCrewButLegendsOnly,
	CrewAndAlliance,
	AllianceOnly,
	WholeCrewButOnlyThoseWearingTheSkeletonCurse,
	WholeCrewButOnlyThoseWearingTheGhostCurse,
	WholeCrewButOnlyThoseUnlockedTheSkeletonCurse,
	WholeCrewButOnlyThoseUnlockedTheGhostCurse,
	AllPlayersWearingTheSkeletonCurseInRange,
	AllPlayersWearingTheGhostCurseInRange,
	GuildMembersinCrewOnly,
	EConditionalStatType_MAX,
};

// Enum Athena.EStatConditionTarget
enum class EStatConditionTarget : uint8_t {
	PlayerPawn,
	ObjectOfInterest,
	ObjectOfInterest2,
	EStatConditionTarget_MAX,
};

// Enum Athena.EAllPlayersStatShouldSendToOwner
enum class EAllPlayersStatShouldSendToOwner : uint8_t {
	SendToOwner,
	DoNotSendToOwner,
	EAllPlayersStatShouldSendToOwner_MAX,
};

// Enum Athena.EAllPlayersStatEventTypes
enum class EAllPlayersStatEventTypes : uint8_t {
	SendToAllPlayersWearingGhostCurseWithinRange,
	SendToAllPlayersWearingSkeletonCurseWithinRange,
	EAllPlayersStatEventTypes_MAX,
};

// Enum Athena.ECrewStatEventTypes
enum class ECrewStatEventTypes : uint8_t {
	SendToWholeCrew,
	OnlySendToPirateLegends,
	OnlySendToPlayersWearingGhostCurse,
	OnlySendToPlayersWearingSkeletonCurse,
	GuildMembersOnly,
	ECrewStatEventTypes_MAX,
};

// Enum Athena.EStatEventsWasFiredFromConditionalStatsServiceState
enum class EStatEventsWasFiredFromConditionalStatsServiceState : uint8_t {
	WasNotFired,
	WasFired,
	EStatEventsWasFiredFromConditionalStatsServiceState_MAX,
};

// Enum Athena.EPlayerStatsOperator
enum class EPlayerStatsOperator : uint8_t {
	Sum,
	Replace,
	Minimum,
	Maximum,
	EPlayerStatsOperator_MAX,
};

// Enum Athena.EPlayerStatsType
enum class EPlayerStatsType : uint8_t {
	Int,
	Double,
	EPlayerStatsType_MAX,
};

// Enum Athena.EShipLocation
enum class EShipLocation : uint8_t {
	TOP_DECK,
	MID_DECK,
	BOTTOM_DECK,
	HATCH_BACK_LEFT,
	HATCH_BACK_RIGHT,
	HATCH_FRONT_LEFT,
	HATCH_FRONT_RIGHT,
	CABIN_FRONT_DOOR,
	CABIN_SIDE_DOOR,
	TOP_DECK_BOW_PLANE,
	TOP_DECK_HATCH_PLANE,
	TOP_DECK_WHEEL_PLANE,
	MAP_DECK_FRONT_PLANE,
	MAP_DECK_TABLE_PLANE,
	MAP_DECK_REARSTAIRS_PLANE,
	BRIG_DECK_BRIG_PLANE,
	BRIG_DECK_STAIRS_PLANE,
	AITARGET_OFFSET_TO_EXTENTS,
	AITARGET_EXTENTS,
	AITARGET_ABOVE_DECK_OFFSET,
	AITARGET_ABOVE_DECK_EXTENTS,
	AITARGET_MID_DECK_OFFSET,
	AITARGET_MID_DECK_EXTENTS,
	AITARGET_LOWER_DECK_OFFSET,
	AITARGET_LOWER_DECK_EXTENTS,
	AI_KRAKEN_TENTACLE,
	CAPTAINS_TABLE_SPAWN_LOCATION,
	EShipLocation_MAX,
};

// Enum Athena.EPreventDamageTypeLockReasons
enum class EPreventDamageTypeLockReasons : uint8_t {
	IsFiredOutOfACannon,
	AIStrategy,
	Form,
	IsHiddenInObject,
	ExternalController,
	EPreventDamageTypeLockReasons_MAX,
};

// Enum Athena.ERegenerationState
enum class ERegenerationState : uint8_t {
	Regenerating,
	Stopped,
	Paused,
	ERegenerationState_MAX,
};

// Enum Athena.EInputControllerTypeRemote
enum class EInputControllerTypeRemote : uint8_t {
	GamePad,
	Keyboard,
	EInputControllerTypeRemote_MAX,
};

// Enum Athena.EAimSensitivitySettingCategory
enum class EAimSensitivitySettingCategory : uint8_t {
	Invalid,
	Blunderbuss,
	Flintlock,
	EyeOfReach,
	Spyglass,
	TridentOfDarkTides,
	EAimSensitivitySettingCategory_MAX,
};

// Enum Athena.FNarrateInteractableButtonsType
enum class FNarrateInteractableButtonsType : uint8_t {
	Off,
	Before,
	After,
	FNarrateInteractableButtonsType_MAX,
};

// Enum Athena.FPerformanceCounterOptions
enum class FPerformanceCounterOptions : uint8_t {
	None,
	FPS,
	Ping,
	FPSAndPing,
	FPerformanceCounterOptions_MAX,
};

// Enum Athena.FVsyncOptions
enum class FVsyncOptions : uint8_t {
	Off,
	On,
	COUNT,
	FVsyncOptions_MAX,
};

// Enum Athena.FPersistentUserGameSettingsDetail
enum class FPersistentUserGameSettingsDetail : uint8_t {
	Min,
	Low,
	Medium,
	High,
	Ultra,
	Recommended,
	COUNT,
	FPersistentUserGameSettingsDetail_MAX,
};

// Enum Athena.ESettingsChangeInstigator
enum class ESettingsChangeInstigator : uint8_t {
	Player,
	Programmatic,
	ESettingsChangeInstigator_MAX,
};

// Enum Athena.EBindingSet
enum class EBindingSet : uint8_t {
	ActionBindings,
	AxisBindings,
	EBindingSet_MAX,
};

// Enum Athena.EGameSettingType
enum class EGameSettingType : uint8_t {
	Bool,
	Float,
	Int,
	INVALID,
	EGameSettingType_MAX,
};

// Enum Athena.ETeleportActionStateAudioMode
enum class ETeleportActionStateAudioMode : uint8_t {
	DoNothing,
	FadeAudio,
	PlaySfx,
	FadeAndSfx,
	ETeleportActionStateAudioMode_MAX,
};

// Enum Athena.ETeleportActionStateStage
enum class ETeleportActionStateStage : uint8_t {
	Uninitialised,
	Started,
	CharacterFadeCompleteCondition,
	PreTeleport,
	CrewShipSpawnedIfPlayerIsInBrigCondition,
	TeleportCompleteCondition,
	AsyncLoadCompleteCondition,
	ActorsRelevantSpawnCondition,
	PlayerCreatedOnClientSpawnCondition,
	PlayerLoadoutReceivedSpawnCondition,
	PlayerEntitlementReceivedSpawnCondition,
	PlayerPromptCountersReceivedSpawnCondition,
	ClientConditionsCompleteCondition,
	CharacterReadyForContestRespawnCondition,
	PostTeleport,
	Ended,
	ETeleportActionStateStage_MAX,
};

// Enum Athena.ETeleportActionStateReason
enum class ETeleportActionStateReason : uint8_t {
	Uninitialised,
	Test,
	Cheat,
	LeaveConcealingObject,
	TeleportPlayerToSafety,
	SinkingShip,
	Mermaid,
	RespawnStatue,
	ReturnToShip,
	PanicTeleport_FoundAssociatedLocation,
	PanicTeleport_NotFoundAssociatedLocation,
	PanicTeleport_NoAssociatedLocationsProvided,
	TeleportTriggerObject,
	SentToBrig,
	HideOutEntered,
	HideOutLeftToSpecificExitPoint,
	HideOutLeftWithNoExitPoint,
	ContestTeleportPlayerToShipOnRestart,
	DebugTeleportCrewStep,
	EnterTunnelOfTheDamned,
	ExitTunnelOfTheDamned,
	SpawnPlayer,
	InitialPlayerSpawn,
	SpawnGhost,
	TeleportPlayerFromSafeZone,
	TaleProgressStatue,
	LeaveGhostShip,
	ETeleportActionStateReason_MAX,
};

// Enum Athena.ETeleportTransformSpace
enum class ETeleportTransformSpace : uint8_t {
	World,
	RelativeToBase,
	ETeleportTransformSpace_MAX,
};

// Enum Athena.ETeleportActionStateConditions
enum class ETeleportActionStateConditions : uint8_t {
	AllConditions,
	NoConditions,
	ETeleportActionStateConditions_MAX,
};

// Enum Athena.ETeleportActionStateFadeType
enum class ETeleportActionStateFadeType : uint8_t {
	Fade,
	FadeEndOnly,
	NoFade,
	FadeOut,
	ETeleportActionStateFadeType_MAX,
};

// Enum Athena.EAttitudeTowardActor
enum class EAttitudeTowardActor : uint8_t {
	Friendly,
	Neutral,
	Hostile,
	Alliance,
	EAttitudeTowardActor_MAX,
};

// Enum Athena.ECharacterInertReason
enum class ECharacterInertReason : uint8_t {
	Teleporting,
	Cutscene,
	EnteringTunnelOfTheDamned,
	ECharacterInertReason_MAX,
};

// Enum Athena.ECharacterType
enum class ECharacterType : uint8_t {
	Ghost,
	Character,
	ECharacterType_MAX,
};

// Enum Athena.ETeleportNotificationSource
enum class ETeleportNotificationSource : uint8_t {
	TeleportState,
	WaitingToSpawnState,
	ETeleportNotificationSource_MAX,
};

// Enum Athena.ECharacterBodyType
enum class ECharacterBodyType : uint8_t {
	Default,
	Large,
	Thin,
	Unfit,
	Athletic,
	Unknown,
	ECharacterBodyType_MAX,
};

// Enum Athena.ECharacterGender
enum class ECharacterGender : uint8_t {
	Unspecified,
	Male,
	Female,
	ECharacterGender_MAX,
};

// Enum Athena.EToggleOrHoldMode
enum class EToggleOrHoldMode : uint8_t {
	Off,
	Hold,
	Toggle,
	EToggleOrHoldMode_MAX,
};

// Enum Athena.EUseSingleStick
enum class EUseSingleStick : uint8_t {
	Off,
	LeftStick,
	RightStick,
	SwapSticks,
	EUseSingleStick_MAX,
};

// Enum Athena.ECameraLookatAnimationType
enum class ECameraLookatAnimationType : uint8_t {
	Default,
	Wheel,
	Capstan,
	Sail,
	Tentacle,
	Ladder,
	Sitting,
	ECameraLookatAnimationType_MAX,
};

// Enum Athena.ELookAtRotationType
enum class ELookAtRotationType : uint8_t {
	Rate,
	Raw,
	ELookAtRotationType_MAX,
};

// Enum Athena.EEmoteSequenceType
enum class EEmoteSequenceType : uint8_t {
	Continuous,
	OneShot,
	EEmoteSequenceType_MAX,
};

// Enum Athena.EWalletCurrencyId
enum class EWalletCurrencyId : uint8_t {
	Undefined,
	Gold,
	WaywardTokens,
	Premium,
	EWalletCurrencyId_MAX,
};

// Enum Athena.EWalletBalanceRequestFailureReason
enum class EWalletBalanceRequestFailureReason : uint8_t {
	ServiceUnavailable,
	RequestTimeout,
	PendingRequest,
	RequestCancelled,
	EWalletBalanceRequestFailureReason_MAX,
};

// Enum Athena.EWalletTransactionRequestFailureReason
enum class EWalletTransactionRequestFailureReason : uint8_t {
	ServiceUnavailable,
	PendingRequest,
	RequestCancelled,
	InvalidPirateIdentity,
	InvalidTransactionRequest,
	EWalletTransactionRequestFailureReason_MAX,
};

// Enum Athena.EStyleModifiers
enum class EStyleModifiers : uint8_t {
	Hide,
	Emblem,
	Brig,
	Accessible,
	EStyleModifiers_MAX,
};

// Enum Athena.EPossessionsChestType
enum class EPossessionsChestType : uint8_t {
	Unknown,
	EquipmentChest,
	ClothingChest,
	VanityChest,
	ArmoryChest,
	ShipCustomizationChest,
	ShipFlagCustomizationChest,
	PetChest,
	CaptainsShipCustomizationChest,
	TrinketChest,
	EPossessionsChestType_MAX,
};

// Enum Athena.EChestEntitlementActionType
enum class EChestEntitlementActionType : uint8_t {
	Equip,
	Unequip,
	Clear,
	Randomise,
	RadialEquip,
	EChestEntitlementActionType_MAX,
};

// Enum Athena.EMenuNavigationAction
enum class EMenuNavigationAction : uint8_t {
	EscapeMenu,
	QuickMenu,
	VoteToScuttleShip,
	Unsupported,
	EMenuNavigationAction_MAX,
};

// Enum Athena.EShopOfferAvailability
enum class EShopOfferAvailability : uint8_t {
	Available,
	AlreadyOwned,
	Locked,
	Info,
	Hide,
	EShopOfferAvailability_MAX,
};

// Enum Athena.EShopType
enum class EShopType : uint8_t {
	Invalid,
	ShipWright_Liveries,
	ShipWright_Decorations,
	ShipWright_Trinkets,
	MAX,
	EShopType_MAX,
};

// Enum Athena.EMultiShopType
enum class EMultiShopType : uint8_t {
	Invalid,
	ShipWright,
	MAX,
	EMultiShopType_MAX,
};

// Enum Athena.EDitherFadeSetting
enum class EDitherFadeSetting : uint8_t {
	FadeIn,
	FadeOut,
	EDitherFadeSetting_MAX,
};

// Enum Athena.EFadeInOnStart
enum class EFadeInOnStart : uint8_t {
	FadeIn,
	FadeOut,
	None,
	EFadeInOnStart_MAX,
};

// Enum Athena.ELightTemplateType
enum class ELightTemplateType : uint8_t {
	PointLight,
	SpotLight,
	ELightTemplateType_MAX,
};

// Enum Athena.EShipAlignmentType
enum class EShipAlignmentType : uint8_t {
	None,
	AlignedToShip,
	AlignedToShipXYOnly,
	EShipAlignmentType_MAX,
};

// Enum Athena.EShipState
enum class EShipState : uint8_t {
	PlainSailing,
	GrindingToHalt,
	Lowering,
	ReduceWaterOcclusionZone,
	KeelingOver,
	KeeledOver,
	FinalSinking,
	Dead,
	EShipState_MAX,
};

// Enum Athena.EBowSplashTickReturnType
enum class EBowSplashTickReturnType : uint8_t {
	NoEffectsPlayed,
	SFXOnly,
	SFXAndVFX,
	EBowSplashTickReturnType_MAX,
};

// Enum Athena.EShipAnnouncementAlignment
enum class EShipAnnouncementAlignment : uint8_t {
	None,
	Emissary,
	TheFeared,
	GoldSeeker,
	Hunter,
	TheIllFated,
	Rogue,
	Voyager,
	Protector,
	Servant,
	Event_FestivalOfGiving,
	ShipCrest_Reaver,
	ShipCrest_RoyalCoronet,
	ShipCrest_ForgottenTemple,
	EShipAnnouncementAlignment_MAX,
};

// Enum Athena.EShipPartCustomizationState
enum class EShipPartCustomizationState : uint8_t {
	Idle,
	SearchingForPart,
	CustomizingPart,
	RegisteringPart,
	EShipPartCustomizationState_MAX,
};

// Enum Athena.EShipDynamicsAnchoredState
enum class EShipDynamicsAnchoredState : uint8_t {
	Unknown,
	Raised,
	Lowered,
	EShipDynamicsAnchoredState_MAX,
};

// Enum Athena.EAllianceNotificationType
enum class EAllianceNotificationType : uint8_t {
	Joined,
	Formed,
	Left,
	Disbanded,
	OtherCrewJoined,
	OtherCrewLeft,
	EAllianceNotificationType_MAX,
};

// Enum Athena.EAllianceJoinStatus
enum class EAllianceJoinStatus : uint8_t {
	CannotJoinAlliance,
	CanJoinAlliance,
	IsInAlliance,
	EAllianceJoinStatus_MAX,
};

// Enum Athena.EMatchmakingVisibilityState
enum class EMatchmakingVisibilityState : uint8_t {
	Public,
	Private,
	EMatchmakingVisibilityState_MAX,
};

// Enum Athena.EScuttleState
enum class EScuttleState : uint8_t {
	Scuttled,
	NotScuttled,
	Disabled_TunnelOfTheDamned,
	Disabled_Cooldown,
	NotScuttled_ChangeSeasUnavailable,
	EScuttleState_MAX,
};

// Enum Athena.EBrigState
enum class EBrigState : uint8_t {
	Unbriggable,
	Free,
	InBrig_Releasable,
	InBrig_Unreleasable,
	EBrigState_MAX,
};

// Enum Athena.ECrewOwnershipState
enum class ECrewOwnershipState : uint8_t {
	Neutral,
	Assigned,
	ECrewOwnershipState_MAX,
};

// Enum Athena.ECrewDestroyedReason
enum class ECrewDestroyedReason : uint8_t {
	AllCrewMembersRemoved,
	ServerMigrated,
	ECrewDestroyedReason_MAX,
};

// Enum Athena.EBrigReleaseReason
enum class EBrigReleaseReason : uint8_t {
	VoteToRelease,
	AutoRelease,
	QuitGameRelease,
	EBrigReleaseReason_MAX,
};

// Enum Athena.EShipRegion
enum class EShipRegion : uint8_t {
	None,
	TopDeck_Bow,
	TopDeck_MainStairs,
	TopDeck_Hatch,
	TopDeck_CaptainsCabin,
	TopDeck_WheelDeck,
	MapDeck_Front,
	MapDeck_MainStairs,
	MapDeck_Table,
	MapDeck_RearStairs,
	BrigDeck_Stairs,
	BrigDeck_OutsideBrig,
	BrigDeck_InsideBrig,
	EShipRegion_MAX,
};

// Enum Athena.EShipDeck
enum class EShipDeck : uint8_t {
	BottomDeck,
	MidDeck,
	TopDeck,
	EShipDeck_MAX,
};

// Enum Athena.EVfxCustomLocalSpaceMode
enum class EVfxCustomLocalSpaceMode : uint8_t {
	Default,
	ShipSpaceAutoLocal,
	ShipSpaceAutoPlayer,
	ShipSpaceAutoWorld,
	EVfxCustomLocalSpaceMode_MAX,
};

// Enum Athena.EVfxRegion
enum class EVfxRegion : uint8_t {
	None,
	ShipExterior,
	ShipInterior,
	EVfxRegion_MAX,
};

// Enum Athena.EVfxUnderwaterUsage
enum class EVfxUnderwaterUsage : uint8_t {
	AboveWater,
	UnderWater,
	Both,
	EVfxUnderwaterUsage_MAX,
};

// Enum Athena.ETrackedActorType
enum class ETrackedActorType : uint8_t {
	Unknown,
	AI_Fauna,
	AI_GhostShip_Captain,
	AI_GhostShip_MiniBoss,
	AI_GhostShip_Grunt,
	AI_Kraken,
	AI_Megalodon,
	AI_OceanCrawler_Crab,
	AI_OceanCrawler_Eel,
	AI_OceanCrawler_Hermit,
	AI_Pets,
	AI_Pets_Wielded,
	AI_Phantom,
	AI_Siren,
	AI_Shark,
	AI_Ship_Aggressive_Large,
	AI_Ship_Aggressive_Small,
	AI_Ship_Battle_Large,
	AI_Ship_Battle_Small,
	AI_Ship_Passive_Large,
	AI_Ship_Passive_Small,
	AI_Skeleton,
	AI_SwimmingCreature,
	AshenLordCloud,
	BarrelsOfPlenty,
	Booty,
	Booty_AshenWindsSkull,
	Booty_CaptainsLog,
	Booty_ReapersChest,
	Booty_RuinedCaptainsLog,
	BuoyantActor,
	BurnedFragment,
	Consumable,
	Earthquake,
	FireworkExplosion,
	FireworkProjectile,
	FishingFish,
	FogBank,
	Geyser,
	Ghostship_Flameheart_Cloud,
	GoalDrivenCharacter,
	GoldCoin,
	Haunted_Fort,
	Jettisoned_Supplies,
	Mermaid,
	MessageInABottle,
	NPC,
	Player,
	Pouch_Ammo,
	Pouch_Doubloons,
	Pouch_Gold,
	Rowboat,
	Rowboat_Cannon,
	Rowboat_Harpoon,
	Ship_Large,
	Ship_Medium,
	Ship_Small,
	ShipCloud,
	Shipwreck,
	Shipwreck_Graveyard,
	ShortRangeMarker,
	SkeletonThrone,
	SkullCloud,
	Spire,
	StatueThreat,
	StorageContainer,
	StorageContainerBuoyant,
	Storm,
	SuperHeatedWater,
	Volcano,
	WreckDebris_Land,
	WreckDebris_Sea,
	MAX,
	ETrackedActorType_MAX,
};

// Enum Athena.ETrackedOwnerType
enum class ETrackedOwnerType : uint8_t {
	Unknown,
	Consumable,
	Booty,
	Booty_ReapersChest,
	Booty_AshenWindsSkull,
	BarrelsOfPlenty,
	WreckDebris_Land,
	WreckDebris_Sea,
	BurnedFragment,
	GoldCoin,
	ETrackedOwnerType_MAX,
};

// Enum Athena.EBuoyantObjectState
enum class EBuoyantObjectState : uint8_t {
	Rising,
	Floating,
	Sinking,
	Disappearing,
	EBuoyantObjectState_MAX,
};

// Enum Athena.ELoadableState
enum class ELoadableState : uint8_t {
	Unloaded,
	Unloading,
	Loading,
	Loaded,
	ELoadableState_MAX,
};

// Enum Athena.ECharacterDeathType
enum class ECharacterDeathType : uint8_t {
	Invalid,
	Killed,
	Despawn,
	OwnershipRemoved,
	NoGameStatePresentDuringPostInitializeComponents,
	SentToFerrySinBin,
	ECharacterDeathType_MAX,
};

// Enum Athena.EHitRegToggleName
enum class EHitRegToggleName : uint8_t {
	ShadowHitScan,
	UseSameTimeService,
	DisableRewindTimeStampModifier,
	PlayerControllerTicksAfterTimeService,
	FixInaccuracySeedMismatch,
	OverrideCharacterInterpolationDistanceWhenAiming,
	CharacterMovementOrientProjectileHitVolumeWhenInterpolating,
	ProjectileHitRegistrationTelemetry,
	EvaluateAngleWhenDeterminingWhetherToInterpolate,
	ProjectileFixedTimestep,
	TickProjectileServiceAfterCharacterMovementOnClient,
	EHitRegToggleName_MAX,
};

// Enum Athena.EPlayerActivityType
enum class EPlayerActivityType : uint8_t {
	None,
	Bailing,
	Cannon,
	Cannon_END,
	Capstan,
	Capstan_END,
	CarryingBooty,
	CarryingBooty_END,
	Dead,
	Dead_END,
	Digging,
	Dousing,
	EmptyingBucket,
	Harpoon,
	Harpoon_END,
	LoseHealth,
	Repairing,
	Sails,
	Sails_END,
	UndoingRepair,
	Wheel,
	Wheel_END,
	MAX,
	EPlayerActivityType_MAX,
};

// Enum Athena.ERadialMenuInputModality
enum class ERadialMenuInputModality : uint8_t {
	None,
	Keyboard,
	Gamepad,
	ERadialMenuInputModality_MAX,
};

// Enum Athena.ERadialInventoryType
enum class ERadialInventoryType : uint8_t {
	None,
	Item,
	Map,
	Phrases,
	Emotes,
	ERadialInventoryType_MAX,
};

// Enum Athena.EDockableSocketOverlapUpdates
enum class EDockableSocketOverlapUpdates : uint8_t {
	AllowUpdate,
	BlockUpdate,
	EDockableSocketOverlapUpdates_MAX,
};

// Enum Athena.EActionSequenceInteractableState
enum class EActionSequenceInteractableState : uint8_t {
	NoInteraction,
	InteractionStarted,
	InteractionCancelled,
	InteractionCompleted,
	InteractionFailed,
	EActionSequenceInteractableState_MAX,
};

// Enum Athena.EActionDisplayPriority
enum class EActionDisplayPriority : uint8_t {
	Primary,
	Secondary,
	Tertiary,
	Total,
	EActionDisplayPriority_MAX,
};

// Enum Athena.EInteractableState
enum class EInteractableState : uint8_t {
	Interactable,
	DisableDescribe,
	DisabledDontDescribe,
	EInteractableState_MAX,
};

// Enum Athena.ETooltipHighlightType
enum class ETooltipHighlightType : uint8_t {
	Active,
	GreyedOut,
	None,
	ETooltipHighlightType_MAX,
};

// Enum Athena.ETooltipSpinnerType
enum class ETooltipSpinnerType : uint8_t {
	None,
	Progress,
	ETooltipSpinnerType_MAX,
};

// Enum Athena.EItemUseSpeed
enum class EItemUseSpeed : uint8_t {
	Default,
	Custom_2,
	Custom_3,
	EItemUseSpeed_MAX,
};

// Enum Athena.EMaxMoveSpeedScalarReason
enum class EMaxMoveSpeedScalarReason : uint8_t {
	Digging,
	Limping,
	UsingItem,
	Stunned,
	MeleeBlocking,
	Testing,
	Environment,
	NumReasons,
	EMaxMoveSpeedScalarReason_MAX,
};

// Enum Athena.EWieldableItemAnimVariant
enum class EWieldableItemAnimVariant : uint8_t {
	Default,
	Variant1,
	Variant2,
	Variant3,
	Variant4,
	MAX,
	EWieldableItemAnimVariant_MAX,
};

// Enum Athena.EWieldableItemBlockingAnimState
enum class EWieldableItemBlockingAnimState : uint8_t {
	Main,
	Feedback,
	EWieldableItemBlockingAnimState_MAX,
};

// Enum Athena.EWieldableItemComplexOneShotLookUpType
enum class EWieldableItemComplexOneShotLookUpType : uint8_t {
	Combo,
	Heavy,
	Special,
	EWieldableItemComplexOneShotLookUpType_MAX,
};

// Enum Athena.EWieldableItemComplexOneShotAnimType
enum class EWieldableItemComplexOneShotAnimType : uint8_t {
	MeleeComboAttack,
	MeleeHeavyAttack,
	EWieldableItemComplexOneShotAnimType_MAX,
};

// Enum Athena.EWieldableItemSize
enum class EWieldableItemSize : uint8_t {
	Small,
	Large,
	EWieldableItemSize_MAX,
};

// Enum Athena.EWieldableItemVisibilityReason
enum class EWieldableItemVisibilityReason : uint8_t {
	Animation,
	Interpolation,
	BlocksView,
	EWieldableItemVisibilityReason_MAX,
};

// Enum Athena.EItemType
enum class EItemType : uint8_t {
	Weapon,
	Item,
	Quest,
	Invalid,
	EItemType_MAX,
};

// Enum Athena.EWieldItemReturnCode
enum class EWieldItemReturnCode : uint8_t {
	Success,
	NoAuthority,
	UnableToDisplace,
	InvalidItem,
	WaitingForUnstash,
	EWieldItemReturnCode_MAX,
};

// Enum Athena.EDropItemReturnCode
enum class EDropItemReturnCode : uint8_t {
	NothingToDrop,
	Success,
	DroppingProhibited,
	EDropItemReturnCode_MAX,
};

// Enum Athena.EStowMethod
enum class EStowMethod : uint8_t {
	Unequip,
	Stash,
	EStowMethod_MAX,
};

// Enum Athena.EStashReason
enum class EStashReason : uint8_t {
	Locomotion,
	Jumping,
	Docking,
	Sprinting,
	Using,
	Dead,
	SpawnOrDespawn,
	AIPartsChange,
	Emote,
	EStashReason_MAX,
};

// Enum Athena.ECanAddItemQueryResult
enum class ECanAddItemQueryResult : uint8_t {
	Success,
	SlotFull,
	Invalid,
	ECanAddItemQueryResult_MAX,
};

// Enum Athena.EItemActionState
enum class EItemActionState : uint8_t {
	Idle,
	Starting,
	Performing,
	Stopping,
	Cooldown,
	Resetting,
	EItemActionState_MAX,
};

// Enum Athena.EItemActionType
enum class EItemActionType : uint8_t {
	OneShot,
	WindUp,
	Continuous,
	EItemActionType_MAX,
};

// Enum Athena.EItemUseStoppedReason
enum class EItemUseStoppedReason : uint8_t {
	Stopped,
	Interrupted,
	EItemUseStoppedReason_MAX,
};

// Enum Athena.EPerspectiveTypes
enum class EPerspectiveTypes : uint8_t {
	FirstPerson,
	ThirdPerson,
	EPerspectiveTypes_MAX,
};

// Enum Athena.EItemLifetimeManagement
enum class EItemLifetimeManagement : uint8_t {
	Automatic,
	Manual,
	EItemLifetimeManagement_MAX,
};

// Enum Athena.EItemRepresentation
enum class EItemRepresentation : uint8_t {
	None,
	Wielded,
	WorldProxy,
	EItemRepresentation_MAX,
};

// Enum Athena.EHitLocationToleranceResult
enum class EHitLocationToleranceResult : uint8_t {
	Invalid,
	Within,
	Outside,
	EHitLocationToleranceResult_MAX,
};

// Enum Athena.EDoubleActionItemPriority
enum class EDoubleActionItemPriority : uint8_t {
	None,
	Primary,
	Secondary,
	EDoubleActionItemPriority_MAX,
};

// Enum Athena.EContinuousUseID
enum class EContinuousUseID : uint8_t {
	In,
	Out,
	EContinuousUseID_MAX,
};

// Enum Athena.EContinuousUseOverride
enum class EContinuousUseOverride : uint8_t {
	None,
	ForcePrimary,
	ForceSecondary,
	EContinuousUseOverride_MAX,
};

// Enum Athena.EItemPassiveState
enum class EItemPassiveState : uint8_t {
	Idle,
	Locomotion,
	Jumping,
	Turning,
	Swimming,
	EItemPassiveState_MAX,
};

// Enum Athena.EInventoryType
enum class EInventoryType : uint8_t {
	Player,
	Storage,
	EInventoryType_MAX,
};

// Enum Athena.InventoryAction
enum class InventoryAction : uint8_t {
	Take,
	Stow,
	InventoryAction_MAX,
};

// Enum Athena.InventoryItemState
enum class InventoryItemState : uint8_t {
	Default,
	Locked,
	InventoryItemState_MAX,
};

// Enum Athena.EActionRelevancy
enum class EActionRelevancy : uint8_t {
	Primary,
	PrimaryAlt,
	Secondary,
	SecondaryAlt,
	EActionRelevancy_MAX,
};

// Enum Athena.EShelterUpdateOption
enum class EShelterUpdateOption : uint8_t {
	Never,
	OnStartUp,
	WithinRainZones,
	Always,
	EShelterUpdateOption_MAX,
};

// Enum Athena.ESubmergedState
enum class ESubmergedState : uint8_t {
	Surfaced,
	PartiallySubmerged,
	FullySubmerged,
	ESubmergedState_MAX,
};

// Enum Athena.EControllableObjectType
enum class EControllableObjectType : uint8_t {
	None,
	Wheel,
	CapstanArm,
	Pulley,
	SailHoist,
	SailAngle,
	Cannon,
	MapTable,
	KeyedInstrument,
	Tentacle,
	Ladder,
	SkeletonShipWheel,
	Oars,
	RowboatSeat,
	Seat,
	Bed,
	HarpoonLauncher,
	WaterPump,
	Ride,
	Book,
	CombinationLock,
	EControllableObjectType_MAX,
};

// Enum Athena.ELadderType
enum class ELadderType : uint8_t {
	Generic,
	BoatSide,
	BoatCrowsnest,
	ClamberSpot,
	ELadderType_MAX,
};

// Enum Athena.ELadderTransitionMode
enum class ELadderTransitionMode : uint8_t {
	OnTop,
	OffTop,
	OnBottom,
	OffBottom,
	Max,
	ELadderTransitionMode_MAX,
};

// Enum Athena.EMeleeWeaponMovementSpeed
enum class EMeleeWeaponMovementSpeed : uint8_t {
	Default,
	SlightlySlowed,
	Slowed,
	EMeleeWeaponMovementSpeed_MAX,
};

// Enum Athena.EMeleeAttackInterruptReason
enum class EMeleeAttackInterruptReason : uint8_t {
	Stopping,
	Comboing,
	EMeleeAttackInterruptReason_MAX,
};

// Enum Athena.EMeleeWeaponAttackType
enum class EMeleeWeaponAttackType : uint8_t {
	Combo,
	Heavy,
	Special,
	EMeleeWeaponAttackType_MAX,
};

// Enum Athena.EBlendedFadeState
enum class EBlendedFadeState : uint8_t {
	FadingIn,
	FadingOut,
	Active,
	Idle,
	EBlendedFadeState_MAX,
};

// Enum Athena.EEncounterListenerType
enum class EEncounterListenerType : uint8_t {
	None,
	Ship,
	Player,
	Count,
	EEncounterListenerType_MAX,
};

// Enum Athena.EEncounterMobility
enum class EEncounterMobility : uint8_t {
	Static,
	Mobile,
	EEncounterMobility_MAX,
};

// Enum Athena.EEncounterDimensions
enum class EEncounterDimensions : uint8_t {
	ThreeDimensions,
	TwoDimensions,
	EEncounterDimensions_MAX,
};

// Enum Athena.EEncounterType
enum class EEncounterType : uint8_t {
	None,
	Storm,
	BarrelsOfPlenty,
	ShipSighting,
	ShipEncounter,
	ShipwreckEventSighting,
	ShipwreckEventEncounter,
	ShipwreckAmbientSighting,
	ShipwreckAmbientEncounter,
	SkellyFortSighting,
	SkellyFortEncounter,
	SkellyFortLegendaryFortSighting,
	SkellyFortLegendaryFortEncounter,
	KrakenSighting,
	KrakenEncounter,
	TinySharkSighting,
	TinySharkEncounter,
	AIShipSighting,
	AIShipEncounter,
	FogBank,
	BoxOfSecrets,
	ReapersChest,
	EmergentCaptain,
	AncientSkelly,
	AshenLordSighting,
	AshenLordEncounter,
	AggressiveGhostShipsAmbientSighting,
	AggressiveGhostShipsAmbientEncounter,
	AggressiveGhostShipsEventSighting,
	AggressiveGhostShipsEventEncounter,
	SunkenKingdomTreasurySighting,
	SunkenKingdomTreasuryEncounter,
	SeaFortSighting,
	SeaFortEncounter,
	FortOfTheDamnedFortSighting,
	FortOfTheDamnedFortEncounter,
	Count,
	EEncounterType_MAX,
};

// Enum Athena.ESpawnedItemSource
enum class ESpawnedItemSource : uint8_t {
	None,
	Quest,
	Shipwreck,
	FloatingAtSea,
	Island,
	SkellyFort,
	AIShip,
	Megalodon,
	KrakenTentacle,
	SunkenCurseArtefact,
	EmergentCaptain,
	PlayerShip,
	AggressiveGhostShip,
	Siren,
	SunkenKingdom,
	BuriedByPlayer,
	OceanCrawlers,
	ESpawnedItemSource_MAX,
};

// Enum Athena.ECompassDirections
enum class ECompassDirections : uint8_t {
	North,
	NorthByNorthEast,
	NorthEast,
	EastByNorthEast,
	East,
	EastBySouthEast,
	SouthEast,
	SouthBySouthEast,
	South,
	SouthBySouthWest,
	SouthWest,
	WestBySouthWest,
	West,
	WestByNorthWest,
	NorthWest,
	NorthByNorthWest,
	NumDirections,
	ECompassDirections_MAX,
};

// Enum Athena.ECannotInviteToGuildReason
enum class ECannotInviteToGuildReason : uint8_t {
	Pending,
	NotInAGuildedSession,
	GuildIsFull,
	PirateIsNotAMemberOfTheGuild,
	PirateDoesNotHavePermissionToInvite,
	ECannotInviteToGuildReason_MAX,
};

// Enum Athena.ECaptainedSessionType
enum class ECaptainedSessionType : uint8_t {
	CaptaincyOnly,
	Guild,
	ECaptainedSessionType_MAX,
};

// Enum Athena.EDefenderLootLevel
enum class EDefenderLootLevel : uint8_t {
	NotDefended,
	NoLoot,
	VeryLow,
	Low,
	Medium,
	High,
	VeryHigh,
	EDefenderLootLevel_MAX,
};

// Enum Athena.ERewardType
enum class ERewardType : uint8_t {
	XP,
	Gold,
	Entitlement,
	WaywardTokens,
	Level,
	Emblem,
	Achievement,
	PremiumCurrency,
	SeasonXP,
	Null,
	ERewardType_MAX,
};

// Enum Athena.ERewardRequestFailureReason
enum class ERewardRequestFailureReason : uint8_t {
	FailedToProcess,
	TimedOut,
	Unknown,
	ERewardRequestFailureReason_MAX,
};

// Enum Athena.ERewardRequestPropogation
enum class ERewardRequestPropogation : uint8_t {
	PropagateToOtherCrewMembers,
	DoNotPropagateToOtherCrewMembers,
	ERewardRequestPropogation_MAX,
};

// Enum Athena.ERewardRequestAccountLevel
enum class ERewardRequestAccountLevel : uint8_t {
	RewardAccount,
	RewardPirate,
	ERewardRequestAccountLevel_MAX,
};

// Enum Athena.ERewardRequestSourceReliability
enum class ERewardRequestSourceReliability : uint8_t {
	IsFromSecureSource,
	IsFromInsecureSource,
	ERewardRequestSourceReliability_MAX,
};

// Enum Athena.ERewardRequestSovereignHandIn
enum class ERewardRequestSovereignHandIn : uint8_t {
	IsSovereignHandIn,
	IsNotSovereignHandIn,
	ERewardRequestSovereignHandIn_MAX,
};

// Enum Athena.ERewardRequestFactionAllegiance
enum class ERewardRequestFactionAllegiance : uint8_t {
	RewardFactionAllegiance,
	DoNotRewardFactionAllegiance,
	ERewardRequestFactionAllegiance_MAX,
};

// Enum Athena.ERewardRequestSeasonRenown
enum class ERewardRequestSeasonRenown : uint8_t {
	RewardSeasonRenown,
	DoNotRewardSeasonRenown,
	ERewardRequestSeasonRenown_MAX,
};

// Enum Athena.ERewardRequestXP
enum class ERewardRequestXP : uint8_t {
	RewardXP,
	DoNotRewardXP,
	ERewardRequestXP_MAX,
};

// Enum Athena.ERewardRequestGold
enum class ERewardRequestGold : uint8_t {
	RewardGold,
	DoNotRewardGold,
	ERewardRequestGold_MAX,
};

// Enum Athena.ERewardRequestNotifyPlayer
enum class ERewardRequestNotifyPlayer : uint8_t {
	NotifyPlayer,
	DoNotNotifyPlayer,
	ERewardRequestNotifyPlayer_MAX,
};

// Enum Athena.ERewardDestinationType
enum class ERewardDestinationType : uint8_t {
	Player,
	Crew,
	Alliance,
	ERewardDestinationType_MAX,
};

// Enum Athena.ERewardRequestSkipXpToAllegianceMultiplier
enum class ERewardRequestSkipXpToAllegianceMultiplier : uint8_t {
	SkipXpToAllegianceMultiplier,
	DoNotSkipXpToAllegianceMultiplier,
	ERewardRequestSkipXpToAllegianceMultiplier_MAX,
};

// Enum Athena.EQuestMapIcon
enum class EQuestMapIcon : uint8_t {
	Unknown,
	XMarksTheSpot,
	Riddle,
	Bounty,
	Merchant,
	MessageInABottle,
	CargoRun,
	SkeletonOrder,
	Emissary,
	Wayfinder,
	MerchantClue,
	Fishing,
	TreasureBuriedByYou,
	TreasureBuriedByOther,
	Checklist,
	EQuestMapIcon_MAX,
};

// Enum Athena.EQuestType
enum class EQuestType : uint8_t {
	Unknown,
	XMarksTheSpot,
	Riddle,
	Bounty,
	Merchant,
	CargoRun,
	Tale,
	Matchmake,
	EmergantVoyage,
	Reward,
	Staging,
	EQuestType_MAX,
};

// Enum Athena.EShowVoyageBannersState
enum class EShowVoyageBannersState : uint8_t {
	Show,
	ShowCustom,
	DontShow,
	EShowVoyageBannersState_MAX,
};

// Enum Athena.EEmergentVoyageSource
enum class EEmergentVoyageSource : uint8_t {
	Unknown,
	MessageInABottle,
	SkeletonOrder,
	Emissary,
	CoralMessageInABottle,
	EEmergentVoyageSource_MAX,
};

// Enum Athena.EVoyagesPrioritisedPromptTutorialHintTypes
enum class EVoyagesPrioritisedPromptTutorialHintTypes : uint8_t {
	GH_XMarks,
	GH_Riddle,
	GH_TreasureVault,
	OOS_Bounty,
	OOS_GhostShip,
	MA_AnimalContract,
	MA_CargoRun,
	MA_LostShipment,
	PL_LoTV,
	PL_LaunchVoyage,
	MERC_Stash,
	MERC_Order,
	ADV_Latest,
	HintType_None,
	EVoyagesPrioritisedPromptTutorialHintTypes_MAX,
};

// Enum Athena.EQuestStatus
enum class EQuestStatus : uint8_t {
	Pending,
	Starting,
	InProgress,
	Complete,
	EQuestStatus_MAX,
};

// Enum Athena.EVoyageLocationFilter
enum class EVoyageLocationFilter : uint8_t {
	Default,
	Dive,
	EVoyageLocationFilter_MAX,
};

// Enum Athena.EVoyageChangeReason
enum class EVoyageChangeReason : uint8_t {
	Unknown,
	PreviousWasCompleted,
	PreviousWasCancelled,
	EVoyageChangeReason_MAX,
};

// Enum Athena.EQuestResultFromDig
enum class EQuestResultFromDig : uint8_t {
	None,
	Chest,
	QuestItem,
	EQuestResultFromDig_MAX,
};

// Enum Athena.EVoyageJoinStatus
enum class EVoyageJoinStatus : uint8_t {
	Other,
	Start,
	JoinInProgress,
	EVoyageJoinStatus_MAX,
};

// Enum Athena.EVoyageLeaveStatus
enum class EVoyageLeaveStatus : uint8_t {
	Other,
	Completed,
	Cancelled,
	QuitInProgress,
	Migrated,
	EVoyageLeaveStatus_MAX,
};

// Enum Athena.EVoyageChapterProgressionType
enum class EVoyageChapterProgressionType : uint8_t {
	DrivenByAnyQuestCompletion,
	DrivenBySpecificQuestCompletion,
	EVoyageChapterProgressionType_MAX,
};

// Enum Athena.EQuestDistributionMethod
enum class EQuestDistributionMethod : uint8_t {
	AllAtOnce,
	PerChapter,
	FixedChapters,
	EQuestDistributionMethod_MAX,
};

// Enum Athena.EQuestLocationSelectionMethod
enum class EQuestLocationSelectionMethod : uint8_t {
	NoRepetitionWithinVoyage,
	NoRepetitionWithinAdjacentChapters,
	AllIslandsAvailable,
	EQuestLocationSelectionMethod_MAX,
};

// Enum Athena.EQuestPoolSelectionMethod
enum class EQuestPoolSelectionMethod : uint8_t {
	Sequential,
	Random,
	EQuestPoolSelectionMethod_MAX,
};

// Enum Athena.ERiddleActions
enum class ERiddleActions : uint8_t {
	RaiseLanternAnyone,
	PlayAnyInstrumentAnyone,
	Dig,
	LookAtMap,
	NumActions,
	ERiddleActions_MAX,
};

// Enum Athena.ELandmarkUniqueness
enum class ELandmarkUniqueness : uint8_t {
	Unique,
	NonUnique,
	ELandmarkUniqueness_MAX,
};

// Enum Athena.ELandmarkVagueness
enum class ELandmarkVagueness : uint8_t {
	Vague,
	NonVague,
	ELandmarkVagueness_MAX,
};

// Enum Athena.EEventRunLocation
enum class EEventRunLocation : uint8_t {
	Client,
	Server,
	ClientAndServer,
	EEventRunLocation_MAX,
};

// Enum Athena.EItemLoadoutDestroyBehaviour
enum class EItemLoadoutDestroyBehaviour : uint8_t {
	DoNotDestroy,
	Destroy,
	EItemLoadoutDestroyBehaviour_MAX,
};

// Enum Athena.EIslandType
enum class EIslandType : uint8_t {
	Resource,
	Outpost,
	Small,
	Medium,
	Large,
	Fort,
	FortOfTheDamned,
	Reef,
	SeaPost,
	Tutorial,
	ReapersHideout,
	Sunken,
	SunkenKingdomNonStarlight,
	SeaFortPrime1,
	SeaFortPrime2,
	SeaFortOvergrown1,
	SeaFortOvergrown2,
	SeaFortPrison1,
	SeaFortPrison2,
	None,
	Max,
	EIslandType_MAX,
};

// Enum Athena.EIslandActiveEventType
enum class EIslandActiveEventType : uint8_t {
	None,
	Shrouded,
	EIslandActiveEventType_MAX,
};

// Enum Athena.EIslandReservationState
enum class EIslandReservationState : uint8_t {
	NotReserved,
	PartiallyReserved,
	FullyReserved,
	EIslandReservationState_MAX,
};

// Enum Athena.EGameplayEventSignalType
enum class EGameplayEventSignalType : uint8_t {
	SkellyFort,
	SkellyShip,
	AshenLord,
	FlameheartGhostShips,
	MAX,
	EGameplayEventSignalType_MAX,
};

// Enum Athena.EEventHandleState
enum class EEventHandleState : uint8_t {
	Inactive,
	Pending,
	Retrying,
	Activating,
	Active,
	Total,
	EEventHandleState_MAX,
};

// Enum Athena.EEventLockReason
enum class EEventLockReason : uint8_t {
	Invasion_Matchmaking,
	Invasion_Invading,
	Cooldown,
	AdventureOnDemand,
	AdventureOnDemand_Arrival,
	AdventureOnDemand_Cooldown,
	EEventLockReason_MAX,
};

// Enum Athena.EGameEventStatus
enum class EGameEventStatus : uint8_t {
	Failed,
	Triggered,
	Complete,
	Pending,
	Register,
	Unregister,
	Deactivate,
	Activating,
	Retrying,
	EGameEventStatus_MAX,
};

// Enum Athena.EEncounterActorRemovedReason
enum class EEncounterActorRemovedReason : uint8_t {
	Defeated,
	Despawned,
	Deleted,
	EEncounterActorRemovedReason_MAX,
};

// Enum Athena.EGameEventSchedulerEventType
enum class EGameEventSchedulerEventType : uint8_t {
	Unknown,
	AI_Kraken,
	AI_Megalodon,
	AI_Ship_Aggressive,
	AI_Ship_Passive,
	ShipCloud,
	SkullCloud,
	Ghostship_Flameheart_Cloud,
	AshenLordCloud,
	LegendarySkullCloud,
	AI_OceanCrawlersOnShip,
	EGameEventSchedulerEventType_MAX,
};

// Enum Athena.EDigDirection
enum class EDigDirection : uint8_t {
	None,
	Exhuming,
	Burying,
	EDigDirection_MAX,
};

// Enum Athena.EFeedableType
enum class EFeedableType : uint8_t {
	None,
	Meat,
	Fruit,
	Bait,
	EFeedableType_MAX,
};

// Enum Athena.EAmmoEffectState
enum class EAmmoEffectState : uint8_t {
	Idle,
	Processing,
	Stopped,
	EAmmoEffectState_MAX,
};

// Enum Athena.ETreasureMapVerticalAlignment
enum class ETreasureMapVerticalAlignment : uint8_t {
	Top,
	Centre,
	ETreasureMapVerticalAlignment_MAX,
};

// Enum Athena.ETreasureMapHorizontalAlignment
enum class ETreasureMapHorizontalAlignment : uint8_t {
	Left,
	Centre,
	Right,
	ETreasureMapHorizontalAlignment_MAX,
};

// Enum Athena.EAnimatedMechanismTickCost
enum class EAnimatedMechanismTickCost : uint8_t {
	Low,
	High,
	EAnimatedMechanismTickCost_MAX,
};

// Enum Athena.EMechanismActionActivationMode
enum class EMechanismActionActivationMode : uint8_t {
	Any,
	All,
	EMechanismActionActivationMode_MAX,
};

// Enum Athena.EMechanismActionState
enum class EMechanismActionState : uint8_t {
	Active,
	Inactive,
	EMechanismActionState_MAX,
};

// Enum Athena.EMechanismActionType
enum class EMechanismActionType : uint8_t {
	OneShot,
	Continuous,
	EMechanismActionType_MAX,
};

// Enum Athena.EMechanismTriggerState
enum class EMechanismTriggerState : uint8_t {
	Active,
	Inactive,
	Disabled,
	EMechanismTriggerState_MAX,
};

// Enum Athena.EMechanismTriggerType
enum class EMechanismTriggerType : uint8_t {
	OneShot,
	Continuous,
	EMechanismTriggerType_MAX,
};

// Enum Athena.ELockAnimationState
enum class ELockAnimationState : uint8_t {
	None,
	InterpolatingIn,
	Unlocking,
	ELockAnimationState_MAX,
};

// Enum Athena.EBootyTypes
enum class EBootyTypes : uint8_t {
	Invalid,
	TreasureChest,
	BountySkull,
	MerchantCrate,
	GunpowderBarrel,
	TreasureArtifact,
	AncientChest,
	PirateLordBooty,
	BoxOfSecrets,
	CargoRunCrate,
	MermaidGem,
	CollectorsChest,
	DroppedPouch,
	FishedItem,
	Food,
	TaleArtifact,
	CampaignBooty,
	ReapersBooty,
	ReapersBounty,
	RitualSkull,
	SkullOfDestiny,
	AshenBooty,
	AshenGift,
	EmissaryFlotsam,
	GoldMound,
	MerchantManifest,
	BreathOfTheSea,
	CaptainsLog,
	SirenTrident,
	BaitCrate,
	NonSellable,
	EBootyTypes_MAX,
};

// Enum Athena.EItemOwnershipType
enum class EItemOwnershipType : uint8_t {
	NotOwned,
	Owned,
	FirstOwner,
	FirstOwnerFromCrew,
	OriginalOwner,
	Stolen,
	FirstStolenByCrew,
	EItemOwnershipType_MAX,
};

// Enum Athena.EShovelDigType
enum class EShovelDigType : uint8_t {
	Success,
	PatDownSuccess,
	DeflectOffHardGround,
	Invalid,
	None,
	EShovelDigType_MAX,
};

// Enum Athena.EIngestionState
enum class EIngestionState : uint8_t {
	Idle,
	InToIngestion,
	OutOfIngestion,
	EIngestionState_MAX,
};

// Enum Athena.EAthenaAITeam
enum class EAthenaAITeam : uint8_t {
	Players,
	Skeletons,
	Fauna_Chickens,
	Fauna_Pigs,
	Fauna_Snakes,
	NeutralSwimmingCreature,
	Sharks,
	TinyShark,
	Kraken,
	KrakenTentacle,
	NeutralCreatureCharacters,
	Pets,
	Fire,
	AggressiveGhostShip,
	Sirens,
	LordPinch,
	OceanCrawlers,
	Phantoms,
	PlayerAllied,
	Max,
	EAthenaAITeam_MAX,
};

// Enum Athena.ENPCDisplayNameType
enum class ENPCDisplayNameType : uint8_t {
	NPCAndIsland,
	NPCOnly,
	IslandOnly,
	ENPCDisplayNameType_MAX,
};

// Enum Athena.EOfferingNPCSpawnHand
enum class EOfferingNPCSpawnHand : uint8_t {
	Left,
	Right,
	EOfferingNPCSpawnHand_MAX,
};

// Enum Athena.ECollectorsChestMaterial
enum class ECollectorsChestMaterial : uint8_t {
	Wood,
	Stone,
	ECollectorsChestMaterial_MAX,
};

// Enum Athena.EMermaidState
enum class EMermaidState : uint8_t {
	Rising,
	Idle,
	Disappearing,
	EMermaidState_MAX,
};

// Enum Athena.EMovingWorldMarkerAttachType
enum class EMovingWorldMarkerAttachType : uint8_t {
	PlayerOnShip,
	Player,
	Static,
	ParentActor,
	MAX,
	EMovingWorldMarkerAttachType_MAX,
};

// Enum Athena.EBootyStorageMaterialState
enum class EBootyStorageMaterialState : uint8_t {
	Empty,
	Partial,
	Full,
	EBootyStorageMaterialState_MAX,
};

// Enum Athena.ENPCChatType
enum class ENPCChatType : uint8_t {
	Chat,
	Subtitles,
	ENPCChatType_MAX,
};

// Enum Athena.ENPCDialogReactionSuppression
enum class ENPCDialogReactionSuppression : uint8_t {
	None,
	SuppressResponseOnly,
	SuppressAudioOnly,
	SuppressBoth,
	ENPCDialogReactionSuppression_MAX,
};

// Enum Athena.ETransientCampfireStateChange
enum class ETransientCampfireStateChange : uint8_t {
	Extinguished,
	WoodAdded,
	Ignited,
	Stoked,
	BurnedDown,
	ETransientCampfireStateChange_MAX,
};

// Enum Athena.EReapersMarkTrackedBootyItemType
enum class EReapersMarkTrackedBootyItemType : uint8_t {
	None,
	GenericBooty,
	FOTDKey,
	ReapersBounty,
	DoubloonReapersChest,
	LegendaryFortKey,
	EReapersMarkTrackedBootyItemType_MAX,
};

// Enum Athena.EReapersMarkTrackedVoyageType
enum class EReapersMarkTrackedVoyageType : uint8_t {
	None,
	NonAllianceVoyage,
	AllianceVoyage,
	EReapersMarkTrackedVoyageType_MAX,
};

// Enum Athena.EIslandTextureSourceType
enum class EIslandTextureSourceType : uint8_t {
	TreasureMap,
	WorldMap,
	EIslandTextureSourceType_MAX,
};

// Enum Athena.EWorldMapShipType
enum class EWorldMapShipType : uint8_t {
	None,
	IsInAlliance,
	IsOwnedShip,
	IsContestShip,
	IsReapersTrackedShip,
	IsInTunnel,
	IsInFaction,
	IsFactionMaxRank,
	IsInvadingShip,
	EWorldMapShipType_MAX,
};

// Enum Athena.EStickinessType
enum class EStickinessType : uint8_t {
	DontStick,
	StickTemporarily,
	StickForever,
	EStickinessType_MAX,
};

// Enum Athena.ENotificationType
enum class ENotificationType : uint8_t {
	Chat,
	Server,
	FormattedChat,
	STTChat,
	EmoteDescription,
	ENotificationType_MAX,
};

// Enum Athena.ECutsceneActivatonState
enum class ECutsceneActivatonState : uint8_t {
	Enabled,
	Disabled,
	Active,
	FinishedPlaying,
	Decommissioned,
	ECutsceneActivatonState_MAX,
};

// Enum Athena.ECutscenePlayResult
enum class ECutscenePlayResult : uint8_t {
	Success,
	Failure,
	Queued,
	ECutscenePlayResult_MAX,
};

// Enum Athena.ERiddleActionLocationOffsets
enum class ERiddleActionLocationOffsets : uint8_t {
	PerformActionAtLocation,
	PerformActionAtCompassDirectionOffsetFromLocation,
	ERiddleActionLocationOffsets_MAX,
};

// Enum Athena.ERiddleLocations
enum class ERiddleLocations : uint8_t {
	NotOnIsland,
	UniqueNonVagueLandmark,
	UniqueVagueLandmark,
	NonUniqueNonVagueLandmark,
	Island,
	ERiddleLocations_MAX,
};

// Enum Athena.EFaunaAnimationSnakeAttackDirection
enum class EFaunaAnimationSnakeAttackDirection : uint8_t {
	Forwards,
	Backwards,
	EFaunaAnimationSnakeAttackDirection_MAX,
};

// Enum Athena.EFaunaAnimationStartledLevel
enum class EFaunaAnimationStartledLevel : uint8_t {
	None,
	Low,
	High,
	EFaunaAnimationStartledLevel_MAX,
};

// Enum Athena.EFaunaAnimationLocation
enum class EFaunaAnimationLocation : uint8_t {
	Land,
	Sea,
	Underwater,
	EFaunaAnimationLocation_MAX,
};

// Enum Athena.EFaunaAnimationState
enum class EFaunaAnimationState : uint8_t {
	Idle,
	Locomotion,
	Impact,
	DyingLoop,
	Death,
	Special,
	EFaunaAnimationState_MAX,
};

// Enum Athena.ENamedPointCollectionSearchTag
enum class ENamedPointCollectionSearchTag : uint8_t {
	None,
	PirateLegendsVoyage,
	PirateLegends_HauntedFort,
	PirateLegends_HauntedIsland,
	PirateLegends_LyingMap,
	PirateLegends_PictureMap,
	PirateLegends_ShipwreckGraveyard,
	PirateLegends_ZoomMap,
	ENamedPointCollectionSearchTag_MAX,
};

// Enum Athena.ENamedPointGroupSearchTag
enum class ENamedPointGroupSearchTag : uint8_t {
	None,
	ItemSpawnLocation,
	ItemBuryLocation,
	Exclude,
	ENamedPointGroupSearchTag_MAX,
};

// Enum Athena.EOverlapFailCondition
enum class EOverlapFailCondition : uint8_t {
	OnBegin,
	OnEnd,
	EOverlapFailCondition_MAX,
};

// Enum Athena.EObstacleFailCondition
enum class EObstacleFailCondition : uint8_t {
	OutOfBounds,
	OutOfTime,
	OutOfOrder,
	Death,
	LeftCrew,
	CourseUniqueFailure,
	EObstacleFailCondition_MAX,
};

// Enum Athena.EObstacleCourseState
enum class EObstacleCourseState : uint8_t {
	WaitForStart,
	Playing,
	End,
	Fail,
	EObstacleCourseState_MAX,
};

// Enum Athena.ERevealState
enum class ERevealState : uint8_t {
	Hidden,
	FarRevealed,
	CloseRevealed,
	ERevealState_MAX,
};

// Enum Athena.EStarFieldPuzzleState
enum class EStarFieldPuzzleState : uint8_t {
	NotStarted,
	Starting,
	Running,
	Completed,
	Dimmed,
	Cleanup,
	MAX,
	EStarFieldPuzzleState_MAX,
};

// Enum Athena.EStarFieldSkySpinState
enum class EStarFieldSkySpinState : uint8_t {
	NoSpinToQueue,
	SpinToQueue,
	EStarFieldSkySpinState_MAX,
};

// Enum Athena.EWheelAnimationType
enum class EWheelAnimationType : uint8_t {
	SmallTurn,
	LeftTurnMid,
	LeftTurnFast,
	RightTurnMid,
	RightTurnFast,
	EWheelAnimationType_MAX,
};

// Enum Athena.EWheelDirection
enum class EWheelDirection : uint8_t {
	Any,
	Anticlockwise,
	Clockwise,
	EWheelDirection_MAX,
};

// Enum Athena.EVoyageDifficultyScope
enum class EVoyageDifficultyScope : uint8_t {
	Tale,
	Standard,
	Emergent,
	EVoyageDifficultyScope_MAX,
};

// Enum Athena.EMastDamageState
enum class EMastDamageState : uint8_t {
	Intact,
	Secured,
	Upright,
	FreeToMove,
	EMastDamageState_MAX,
};

// Enum Athena.EMastType
enum class EMastType : uint8_t {
	Front,
	Main,
	Rear,
	EMastType_MAX,
};

// Enum Athena.ERowBraking
enum class ERowBraking : uint8_t {
	None,
	BrakeLeft,
	BrakeRight,
	BrakeBoth,
	ERowBraking_MAX,
};

// Enum Athena.EObstacleType
enum class EObstacleType : uint8_t {
	None,
	SeaRock,
	UnderseaRock,
	Island,
	AIShip,
	PlayerShip,
	Shipwreck,
	GameEventExclusionZone,
	HauntedSeaFort,
	EObstacleType_MAX,
};

// Enum Athena.EWreckSpawnBlockType
enum class EWreckSpawnBlockType : uint8_t {
	AlwaysBlock,
	NeverBlock,
	PotentialBlockage,
	EWreckSpawnBlockType_MAX,
};

// Enum Athena.EWreckSpawnCheckFlag
enum class EWreckSpawnCheckFlag : uint8_t {
	None,
	Players,
	Ships,
	AmbientWrecks,
	CustomWrecks,
	Islands,
	AmbientWrecksWithNearPlayers,
	AmbientWrecksWithoutNearPlayers,
	SeaRocks,
	EWreckSpawnCheckFlag_MAX,
};

// Enum Athena.DrowningState
enum class DrowningState : uint8_t {
	NotDrowning,
	Drowning,
	Gulping,
	ResetDrowning,
	DrowningState_MAX,
};

// Enum Athena.ETunnelOfTheDamnedShipSailState
enum class ETunnelOfTheDamnedShipSailState : uint8_t {
	Preserved,
	Lowered,
	Raised,
	ETunnelOfTheDamnedShipSailState_MAX,
};

// Enum Athena.ETunnelPresenterStartMode
enum class ETunnelPresenterStartMode : uint8_t {
	OnInitialize,
	OnMatchmakingStart,
	ETunnelPresenterStartMode_MAX,
};

// Enum Athena.ESwimmingMode
enum class ESwimmingMode : uint8_t {
	SwimmingMode_None,
	SwimmingMode_Swimming,
	SwimmingMode_Sinking,
	SwimmingMode_MAX,
};

// Enum Athena.ESwimmingCreatureDeathCustomEventEnum
enum class ESwimmingCreatureDeathCustomEventEnum : uint8_t {
	None,
	StartSinking,
	StartSinkingAnim,
	ESwimmingCreatureDeathCustomEventEnum_MAX,
};

// Enum Athena.EVoyageLocationType
enum class EVoyageLocationType : uint8_t {
	Fixed,
	Random,
	Closest,
	EVoyageLocationType_MAX,
};

// Enum Athena.EStormEffectLockReasons
enum class EStormEffectLockReasons : uint8_t {
	InsideExclusionVolume,
	AccessibilityToggledOff,
	EStormEffectLockReasons_MAX,
};

// Enum Athena.EAggressiveGhostShipCannonFacingDirection
enum class EAggressiveGhostShipCannonFacingDirection : uint8_t {
	Left,
	Right,
	EAggressiveGhostShipCannonFacingDirection_MAX,
};

// Enum Athena.EAggressiveGhostShipSpawnDirectionType
enum class EAggressiveGhostShipSpawnDirectionType : uint8_t {
	Random,
	AlwaysClockwise,
	AlwaysAntiClockwise,
	MatchNearbyEncounter,
	OppositeToNearbyEncounter,
	EAggressiveGhostShipSpawnDirectionType_MAX,
};

// Enum Athena.EAggressiveGhostShipType
enum class EAggressiveGhostShipType : uint8_t {
	Grunt,
	FormationGrunt,
	FormationLeader,
	CaptainFormationGrunt,
	Captain,
	EAggressiveGhostShipType_MAX,
};

// Enum Athena.EAggressiveGhostShipAllegiance
enum class EAggressiveGhostShipAllegiance : uint8_t {
	HostileToPlayers,
	FriendlyToPlayers,
	EAggressiveGhostShipAllegiance_MAX,
};

// Enum Athena.FAggressiveGhostShipEncounterWaveProgressAnnounceMusicType
enum class FAggressiveGhostShipEncounterWaveProgressAnnounceMusicType : uint8_t {
	None,
	Formation,
	FinalWaveCaptain,
	FinalWaveFlameheart,
	EncounterComplete,
	FAggressiveGhostShipEncounterWaveProgressAnnounceMusicType_MAX,
};

// Enum Athena.EAggressiveGhostShipTarget
enum class EAggressiveGhostShipTarget : uint8_t {
	None,
	Player,
	NearPlayer,
	Ship,
	NearShip,
	MermaidStatue,
	NearMermaidStatue,
	EnemyGhostShip,
	NearEnemyGhostShip,
	CannonRowboat,
	NearCannonRowboat,
	GenericExtraTarget,
	NearGenericExtraTarget,
	Anywhere,
	EAggressiveGhostShipTarget_MAX,
};

// Enum Athena.EHitRegShotType
enum class EHitRegShotType : uint8_t {
	Invalid,
	HitScanShot,
	TimeOfFlightShot,
	EHitRegShotType_MAX,
};

// Enum Athena.EHitRegSnapshotDisagreementType
enum class EHitRegSnapshotDisagreementType : uint8_t {
	NoDisagreement,
	DifferentComponentsOnSameActor,
	DifferentActors,
	DesynchronizedData,
	EHitRegSnapshotDisagreementType_MAX,
};

// Enum Athena.ERespawnPointOrientation
enum class ERespawnPointOrientation : uint8_t {
	None,
	North,
	South,
	West,
	East,
	Outward,
	Inward,
	Random,
	ERespawnPointOrientation_MAX,
};

// Enum Athena.EContestState
enum class EContestState : uint8_t {
	Idle,
	Staging,
	Contest,
	PostContest,
	Reward,
	EContestState_MAX,
};

// Enum Athena.EContestScoreId
enum class EContestScoreId : uint8_t {
	Undefined,
	Silver,
	EContestScoreId_MAX,
};

// Enum Athena.EMechanismAnimationEventType
enum class EMechanismAnimationEventType : uint8_t {
	OneShot,
	Continuous,
	EMechanismAnimationEventType_MAX,
};

// Enum Athena.ETimedDoorCheckpointState
enum class ETimedDoorCheckpointState : uint8_t {
	Lowering,
	Jammed,
	ETimedDoorCheckpointState_MAX,
};

// Enum Athena.ETimedDoorState
enum class ETimedDoorState : uint8_t {
	Lowering,
	Closed,
	Opening,
	Jammed,
	ETimedDoorState_MAX,
};

// Enum Athena.ESimpleAnimatedMechanismActionMode
enum class ESimpleAnimatedMechanismActionMode : uint8_t {
	OneShot,
	OneShotRetriggerable,
	Continuous,
	ESimpleAnimatedMechanismActionMode_MAX,
};

// Enum Athena.ECollisionShapeType
enum class ECollisionShapeType : uint8_t {
	Sphere,
	Box,
	ECollisionShapeType_MAX,
};

// Enum Athena.ECombinationDirection
enum class ECombinationDirection : uint8_t {
	None,
	Left,
	Right,
	ECombinationDirection_MAX,
};

// Enum Athena.ESwitchMechanismTriggerRotationMode
enum class ESwitchMechanismTriggerRotationMode : uint8_t {
	Forward,
	Backwards,
	Both,
	ESwitchMechanismTriggerRotationMode_MAX,
};

// Enum Athena.ESwitchMechanismTriggerRandomSelectionMode
enum class ESwitchMechanismTriggerRandomSelectionMode : uint8_t {
	Any,
	InactiveOnly,
	ESwitchMechanismTriggerRandomSelectionMode_MAX,
};

// Enum Athena.EVFXMechanismAnimationEventMode
enum class EVFXMechanismAnimationEventMode : uint8_t {
	FixedRelativeOffset,
	FixedMechanismVFXComponentLocation,
	AttachedToSceneComponent,
	EVFXMechanismAnimationEventMode_MAX,
};

// Enum Athena.ESwitchMechanismTriggerPlankState
enum class ESwitchMechanismTriggerPlankState : uint8_t {
	Idle,
	RotateToStart,
	RotateToEnd,
	ESwitchMechanismTriggerPlankState_MAX,
};

// Enum Athena.EOverrideState
enum class EOverrideState : uint8_t {
	Free,
	StartingOverride,
	EndingOverride,
	Overridden,
	EOverrideState_MAX,
};

// Enum Athena.EEventRoomState
enum class EEventRoomState : uint8_t {
	Inactive,
	Waiting,
	Active,
	Completed,
	Aftermath,
	EEventRoomState_MAX,
};

// Enum Athena.EBaitType
enum class EBaitType : uint8_t {
	NoBait,
	EarthWorms,
	Grubs,
	Leeches,
	EBaitType_MAX,
};

// Enum Athena.EFishSize
enum class EFishSize : uint8_t {
	Medium,
	Large,
	EFishSize_MAX,
};

// Enum Athena.EFishSpawnTimeOfDay
enum class EFishSpawnTimeOfDay : uint8_t {
	AnyTime,
	OnlyDay,
	OnlyNight,
	EFishSpawnTimeOfDay_MAX,
};

// Enum Athena.EFishAnimationState
enum class EFishAnimationState : uint8_t {
	SwimmingLoop,
	Fighting,
	Tired,
	Escaped,
	Caught,
	EFishAnimationState_MAX,
};

// Enum Athena.EFishingFishState
enum class EFishingFishState : uint8_t {
	NotSet,
	RisingFromTheDepths,
	AttachedToFloat_MovingToFloat,
	AttachedToFloat_Battling,
	AttachedToFloat_Tired,
	AttachedToFloat_Caught,
	AttachedToFloat_Caught_Instant,
	Escaping,
	EFishingFishState_MAX,
};

// Enum Athena.EFishingFloatState
enum class EFishingFloatState : uint8_t {
	NotSet,
	AttachedToRod,
	Casting,
	CastingFailed,
	FloatingOnWater,
	BringingInCatch,
	Retracting,
	ViolentlyRetracting,
	EFishingFloatState_MAX,
};

// Enum Athena.EFishingMiniGamePlayerInputBattlingDirection
enum class EFishingMiniGamePlayerInputBattlingDirection : uint8_t {
	BattlingAgainstLeft,
	BattlingAgainstRight,
	BattlingAgainstAway,
	EFishingMiniGamePlayerInputBattlingDirection_MAX,
};

// Enum Athena.EFishingMiniGamePlayerInputDirection
enum class EFishingMiniGamePlayerInputDirection : uint8_t {
	None,
	Left,
	Away,
	Right,
	Towards,
	EFishingMiniGamePlayerInputDirection_MAX,
};

// Enum Athena.EFishingMiniGameEscapeDirection
enum class EFishingMiniGameEscapeDirection : uint8_t {
	None,
	Left,
	Away,
	Right,
	EFishingMiniGameEscapeDirection_MAX,
};

// Enum Athena.EFishingMiniGameState
enum class EFishingMiniGameState : uint8_t {
	Battling,
	Recovering,
	EFishingMiniGameState_MAX,
};

// Enum Athena.EFishingRodServerState
enum class EFishingRodServerState : uint8_t {
	NotBeingUsed,
	PreparingToCast,
	VerifyingCastLocation,
	Casting,
	DelayBeforeSpawningFish,
	RequestFishSpawnWhenPossible,
	WaitingForAsyncLoadToFinish,
	WaitingForFishToBite,
	FishMovingInToBite,
	FishOnRodAndWaitingForPlayerInput,
	FishMovingToMinimumDistanceFromPlayer,
	FishingMiniGameUnderway,
	FishCaught,
	ReelingInAComedyItem,
	ComedyItemCaught,
	EFishingRodServerState_MAX,
};

// Enum Athena.EFishingRodRetractLineVisuals
enum class EFishingRodRetractLineVisuals : uint8_t {
	None,
	Normal,
	Violent,
	EFishingRodRetractLineVisuals_MAX,
};

// Enum Athena.EFishingRodBattlingState
enum class EFishingRodBattlingState : uint8_t {
	NotBattling,
	Battling_Tiring,
	Battling_NotTiring,
	Battling_Tired,
	EFishingRodBattlingState_MAX,
};

// Enum Athena.EFishingState
enum class EFishingState : uint8_t {
	None,
	Casting,
	CastForwards,
	CastSuccess,
	CastFailed,
	Fishing,
	IntoFighting,
	Fighting,
	Success,
	Failure,
	EFishingState_MAX,
};

// Enum Athena.EMusicalInstrumentType
enum class EMusicalInstrumentType : uint8_t {
	Banjo,
	Bass,
	Concertina,
	Drums,
	HurdyGurdy,
	OneManBand,
	Sousaphone,
	Ukulele,
	VoiceBox,
	Any,
	Total,
	EMusicalInstrumentType_MAX,
};

// Enum Athena.EShantyEnsembleOption
enum class EShantyEnsembleOption : uint8_t {
	TryToJoinExistingNearbyEnsemble,
	ForceNewEnsemble,
	EShantyEnsembleOption_MAX,
};

// Enum Athena.EPetMontageAnimationType
enum class EPetMontageAnimationType : uint8_t {
	None,
	OneShot,
	LoopingOneShot,
	LoopingStaged,
	EPetMontageAnimationType_MAX,
};

// Enum Athena.EPetMontageAnimationState
enum class EPetMontageAnimationState : uint8_t {
	None,
	OneShot,
	ContinuousIn,
	ContinuousLoop,
	ContinuousOut,
	ExitContinuousLoop,
	EPetMontageAnimationState_MAX,
};

// Enum Athena.EAthenaAnimationPetRoamingState
enum class EAthenaAnimationPetRoamingState : uint8_t {
	Idle,
	Locomotion,
	LocomtionScared,
	Unique,
	React,
	Call,
	Concealed,
	FlyCannon,
	Cheer,
	Interested,
	Talking,
	Happy,
	Caged,
	Grumpy,
	Angry,
	Dance,
	Cleaning,
	Exit,
	Arrive,
	Startled,
	Inactive,
	TakingOff,
	Landing,
	Flying,
	Yawn,
	Scared,
	Protective,
	Vomit,
	Chew,
	Sneeze,
	Sleep,
	Hangout_A,
	Hangout_B,
	Hangout_C,
	LookAround,
	Meme,
	EAthenaAnimationPetRoamingState_MAX,
};

// Enum Athena.EAthenaAnimationPetHeldReactionState
enum class EAthenaAnimationPetHeldReactionState : uint8_t {
	None,
	Chew,
	PositiveReact,
	NegativeReact,
	RefuseReact,
	EAthenaAnimationPetHeldReactionState_MAX,
};

// Enum Athena.EAthenaAnimationPetHeldState
enum class EAthenaAnimationPetHeldState : uint8_t {
	Idle,
	Underwater,
	UnEquip,
	Equip,
	Inactive,
	Drop,
	Stroke,
	Give,
	EAthenaAnimationPetHeldState_MAX,
};

// Enum Athena.EAthenaAnimationPetSpawnState
enum class EAthenaAnimationPetSpawnState : uint8_t {
	Null,
	BeingHeld,
	Roaming,
	EAthenaAnimationPetSpawnState_MAX,
};

// Enum Athena.EWorldRegion
enum class EWorldRegion : uint8_t {
	BlueSeaOfPlenty,
	TheWilds,
	WideSeaOfPlunder,
	DevilsRoar,
	ShoresOfGold,
	EWorldRegion_MAX,
};

// Enum Athena.MapInventoryItemState
enum class MapInventoryItemState : uint8_t {
	Default,
	Locked,
	MapInventoryItemState_MAX,
};

// Enum Athena.EEventFortDestructionReason
enum class EEventFortDestructionReason : uint8_t {
	Defeated,
	Despawn,
	EEventFortDestructionReason_MAX,
};

// Enum Athena.ESeaFortState
enum class ESeaFortState : uint8_t {
	Inactive,
	Dormant,
	Battle,
	ESeaFortState_MAX,
};

// Enum Athena.ESeaFortAlignmentState
enum class ESeaFortAlignmentState : uint8_t {
	Idle,
	Belle,
	Reaper,
	ESeaFortAlignmentState_MAX,
};

// Enum Athena.EPrisonerPosition
enum class EPrisonerPosition : uint8_t {
	None,
	Hitting,
	Kneeling,
	Stood,
	EPrisonerPosition_MAX,
};

// Enum Athena.EAlignmentTableFlameSize
enum class EAlignmentTableFlameSize : uint8_t {
	None,
	Small,
	Medium,
	Large,
	EAlignmentTableFlameSize_MAX,
};

// Enum Athena.EShipType
enum class EShipType : uint8_t {
	Sloop,
	Brigantine,
	Galleon,
	Invalid,
	EShipType_MAX,
};

// Enum Athena.EShipLoadoutPersistence
enum class EShipLoadoutPersistence : uint8_t {
	Temporary,
	Persistent,
	EShipLoadoutPersistence_MAX,
};

// Enum Athena.ECanvasBlendMode
enum class ECanvasBlendMode : uint8_t {
	Opaque,
	Masked,
	Translucent,
	Additive,
	Modulate,
	MaskedDistanceField,
	MaskedDistanceFieldShadowed,
	TranslucentDistanceField,
	TranslucentDistanceFieldShadowed,
	AlphaComposite,
	AlphaBlend,
	TranslucentAlphaOnly,
	PremultipliedAlpha,
	ECanvasBlendMode_MAX,
};

// Enum Athena.EWidgetVisibilityGroup
enum class EWidgetVisibilityGroup : uint8_t {
	Persistent,
	AlwaysHidden,
	Group1,
	Group2,
	EWidgetVisibilityGroup_MAX,
};

// Enum Athena.EWieldableBookPageType
enum class EWieldableBookPageType : uint8_t {
	Single,
	Double,
	EWieldableBookPageType_MAX,
};

// Enum Athena.EWieldableBookPageRenderingMode
enum class EWieldableBookPageRenderingMode : uint8_t {
	NoPagesRendered,
	DrawLeftPageAsCurrentOnly,
	DrawLeftPageAsPreviousAndRightPageAsCurrent,
	DrawLeftPageAsCurrentAndRightPageAsNext,
	EWieldableBookPageRenderingMode_MAX,
};

// Enum Athena.ERenderPageResult
enum class ERenderPageResult : uint8_t {
	RenderedPage,
	NoWorkDone,
	ERenderPageResult_MAX,
};

// Enum Athena.EEventLogEntryType
enum class EEventLogEntryType : uint8_t {
	None,
	PlayerDied,
	PlayerShipSpottedSloop,
	PlayerShipSpottedBrigantine,
	PlayerShipSpottedGalleon,
	ArrivedAtIsland,
	ArrivedAtShrine,
	DepartedIsland,
	DepartedShrine,
	BuriedTreasure,
	VoyageComplete,
	FortComplete,
	FortCompleteKeelHaulFort,
	FortCompleteHiddenSpringKeep,
	FortCompleteSailorsKnotStronghold,
	FortCompleteLostGoldFort,
	FortCompleteTheCrowsNestFortress,
	FortCompleteSkullKeep,
	FortCompleteKrakenWatchtower,
	FortCompleteSharkFinCamp,
	FortCompleteMoltenSandsFortress,
	FortOfFortuneCompleteKeelHaulFort,
	FortOfFortuneCompleteHiddenSpringKeep,
	FortOfFortuneCompleteSailorsKnotStronghold,
	FortOfFortuneCompleteLostGoldFort,
	FortOfFortuneCompleteTheCrowsNestFortress,
	FortOfFortuneCompleteSkullKeep,
	FortOfFortuneCompleteKrakenWatchtower,
	FortOfFortuneCompleteSharkFinCamp,
	FortOfFortuneCompleteMoltenSandsFortress,
	DamnedFortComplete,
	SeaFortConqueredSeaFort01,
	SeaFortConqueredSeaFort02,
	SeaFortConqueredSeaFort03,
	SeaFortConqueredSeaFort04,
	SeaFortConqueredSeaFort05,
	SeaFortConqueredSeaFort06,
	TreasuryCompletedSunkenShores,
	TreasuryCompletedLostAncients,
	TreasuryCompletedSecretWilds,
	TallTaleComplete,
	TallTaleShroudBreakerComplete,
	TallTaleCursedRogueComplete,
	TallTaleLegendaryStorytellerComplete,
	TallTaleStarsOfAThiefComplete,
	TallTaleWildRoseComplete,
	TallTaleArtOfTheTricksterComplete,
	TallTaleFateOfTheMorningstarComplete,
	TallTaleRevengeOfTheMorningstarComplete,
	TallTaleShoresOfGoldComplete,
	TallTaleAshenDragonComplete,
	TallTaleHeartOfFireComplete,
	TallTaleAPiratesLifeComplete,
	TallTaleTheSunkenPearlComplete,
	TallTaleCaptainsOfTheDamnedComplete,
	TallTaleDarkBrethrenComplete,
	TallTaleLordsOfTheSeaComplete,
	LordFought,
	LordDefeated,
	LordDefeatedCaptainBriggsy,
	LordDefeatedGraymarrow,
	LordDefeatedGoldHoarder,
	LordDefeatedGhostGraymarrow,
	LordDefeatedMutinousHelmsman,
	LordDefeatedTwoFacedScoundrel,
	LordDefeatedDuchess,
	LordDefeatedOldHoratio,
	LordDefeatedWardenChi,
	LordDefeatedCaptainGrimm,
	LordDefeatedRedRuth,
	FlameheartFought,
	GhostShipFought,
	GhostShipDefeatedGruntShip,
	GhostShipDefeatedGhostFlagship,
	GhostShipDefeatedGhostCaptainShip,
	GhostShipDefeatedBurningBlade,
	GhostShipDefeatedGhostBrethrenShip,
	GhostShipDefeatedGhostBrethrenCaptainShip,
	SkellyShipFought,
	SkellyShipDefeatedSkellySloop,
	SkellyShipDefeatedSkellyGalleon,
	KrakenEncountered,
	KrakenDefeated,
	MegEncountered,
	MegDefeatedHungeringOne,
	MegDefeatedQueenOfTheDepths,
	MegDefeatedShadowmaw,
	MegDefeatedAncientTerror,
	MegDefeatedGhostOfTheDeep,
	FoundMessageInABottle,
	FoundTreasure,
	AllianceFormed,
	AllianceDisbanded,
	Sunk,
	SailedDistance,
	ShipwreckExplored,
	PlayerShipLanternRowboatDocked,
	PlayerShipHarpoonRowboatDocked,
	PlayerShipCannonRowboatDocked,
	FightPlayers,
	EndedCaptaincy,
	EnteredSea,
	BattleNonCaptainsShip,
	BattleCaptainsShip,
	AllianceJoined,
	AllianceLeft,
	GoldHoarderEmissaryRaised,
	GoldHoarderEmissaryLevel5Reached,
	GoldHoarderEmissaryLowered,
	MerchantAllianceEmissaryRaised,
	MerchantAllianceEmissaryLevel5Reached,
	MerchantAllianceEmissaryLowered,
	OrderOfSoulsAllianceEmissaryRaised,
	OrderOfSoulsEmissaryLevel5Reached,
	OrderOfSoulsEmissaryLowered,
	AthenasFortuneAllianceEmissaryRaised,
	AthenasFortuneEmissaryLevel5Reached,
	AthenasFortuneEmissaryLowered,
	ReapersBonesAllianceEmissaryRaised,
	ReapersBonesEmissaryLevel5Reached,
	ReapersBonesEmissaryLowered,
	GoldHoarderVoyageComplete,
	GoldHoarderXMarksComplete,
	GoldHoarderRiddlesComplete,
	GoldHoarderWayfinderComplete,
	GoldHoarderAshenXMarksComplete,
	GoldHoarderAshenRiddleMapComplete,
	GoldHoarderAshenWayfinderComplete,
	OrderOfSoulsVoyageComplete,
	OrderOfSoulsAshenVoyageComplete,
	OrderOfSoulsGhostShipVoyageComplete,
	MerchantAllianceVoyageComplete,
	MerchantAllianceTradeGoodComplete,
	MerchantAllianceLostShipmentComplete,
	AthenasFortuneVoyageComplete,
	AthenasFortuneAshenVoyageComplete,
	AthenasFortuneHauntedIslandsComplete,
	AthenasFortuneLyingMapsComplete,
	AthenasFortunePictorialMapsComplete,
	AthenasFortuneShipwreckGraveyardsComplete,
	AthenasFortuneZoomMapsComplete,
	AthenasFortuneGhostGarrisonComplete,
	BilgeRatsVoyageComplete,
	EmergentVoyageComplete,
	TavernBoardQuestComplete,
	EnteredStorm,
	ExitedStorm,
	FiresDoused,
	ServantJoinedTheFight,
	ServantLeftTheFight,
	ServantBattleBegins,
	ServantStreakIncreased,
	ServantPirateLordShipsSunkSloop,
	ServantPirateLordShipsSunkBrigantine,
	ServantPirateLordShipsSunkGalleon,
	ServantPirateLordBossShipsSunkSloop,
	ServantPirateLordBossShipsSunkBrigantine,
	ServantPirateLordBossShipsSunkGalleon,
	GuardianJoinedTheFight,
	GuardianLeftTheFight,
	GuardianBattleBegins,
	GuardianStreakIncreased,
	GuardianFlameheartShipsSunkSloop,
	GuardianFlameheartShipsSunkBrigantine,
	GuardianFlameheartLordShipsSunkGalleon,
	GuardianFlameheartLordBossShipsSunkSloop,
	GuardianFlameheartLordBossShipsSunkBrigantine,
	GuardianFlameheartLordBossShipsSunkGalleon,
	Season8ShipSunkStreakIncreased,
	EEventLogEntryType_MAX,
};

// Enum Athena.ECaptainsLogPageType
enum class ECaptainsLogPageType : uint8_t {
	Invalid,
	Ship,
	Crew,
	Session,
	Log,
	ECaptainsLogPageType_MAX,
};

// Enum Athena.EHauntedFortPhase
enum class EHauntedFortPhase : uint8_t {
	NONE,
	Emplacements,
	Fort,
	Destroyed,
	EHauntedFortPhase_MAX,
};

// Enum Athena.ENavigationDirection
enum class ENavigationDirection : uint8_t {
	None,
	Left,
	Right,
	Up,
	Down,
	ENavigationDirection_MAX,
};

// Enum Athena.ETransientActorDiscardType
enum class ETransientActorDiscardType : uint8_t {
	MarkForDestruction,
	Unregister,
	Count,
	ETransientActorDiscardType_MAX,
};

// Enum Athena.ESittingActionStateDockingMode
enum class ESittingActionStateDockingMode : uint8_t {
	FindFloor,
	AttachDirectlyToSeat,
	ESittingActionStateDockingMode_MAX,
};

// Enum Athena.ESleepingActionStateDockingMode
enum class ESleepingActionStateDockingMode : uint8_t {
	FindFloor,
	AttachDirectlyToSeat,
	ESleepingActionStateDockingMode_MAX,
};

// Enum Athena.ESeatStatTimeOfDay
enum class ESeatStatTimeOfDay : uint8_t {
	Sunrise,
	Morning,
	MidDay,
	Afternoon,
	Sunset,
	Night,
	Unknown,
	ESeatStatTimeOfDay_MAX,
};

// Enum Athena.EAthenaAnimationCapstanState
enum class EAthenaAnimationCapstanState : uint8_t {
	Neutral,
	Positive,
	Negative,
	EAthenaAnimationCapstanState_MAX,
};

// Enum Athena.EAthenaAnimationJumpingState
enum class EAthenaAnimationJumpingState : uint8_t {
	None,
	Jumping,
	Falling,
	Impact,
	JumpFinished,
	PreImpact,
	EAthenaAnimationJumpingState_MAX,
};

// Enum Athena.EAthenaAnimationLadderState
enum class EAthenaAnimationLadderState : uint8_t {
	None,
	ClimbOn,
	ClimbOff,
	Climbing,
	EAthenaAnimationLadderState_MAX,
};

// Enum Athena.EAthenaAnimationLadderTransitionState
enum class EAthenaAnimationLadderTransitionState : uint8_t {
	None,
	Bottom,
	Top,
	EAthenaAnimationLadderTransitionState_MAX,
};

// Enum Athena.EIKFootPlantingState
enum class EIKFootPlantingState : uint8_t {
	On,
	Off,
	EIKFootPlantingState_MAX,
};

// Enum Athena.EIKSolverType
enum class EIKSolverType : uint8_t {
	NormalSolver,
	LODSolver,
	EIKSolverType_MAX,
};

// Enum Athena.EIKState
enum class EIKState : uint8_t {
	On,
	Off,
	EIKState_MAX,
};

// Enum Athena.EItemBlockingSubState
enum class EItemBlockingSubState : uint8_t {
	None,
	Main,
	Feedback,
	InFeedback,
	EItemBlockingSubState_MAX,
};

// Enum Athena.EComplexOneShotAttackType
enum class EComplexOneShotAttackType : uint8_t {
	CombatLocomotion,
	CombatStatic,
	CombatSwimming,
	CombatHeavy,
	CombatHeavySwimming,
	EComplexOneShotAttackType_MAX,
};

// Enum Athena.EComplexOneShotSubState
enum class EComplexOneShotSubState : uint8_t {
	WarmUp,
	WarmUpFromBlock,
	Action,
	Recover,
	HeavyAttackStun,
	EComplexOneShotSubState_MAX,
};

// Enum Athena.EAthenaAnimationWheelState
enum class EAthenaAnimationWheelState : uint8_t {
	Neutral,
	Positive,
	Negative,
	EAthenaAnimationWheelState_MAX,
};

// Enum Athena.EObjectPitchTargetingStates
enum class EObjectPitchTargetingStates : uint8_t {
	None,
	StandardPassive,
	StandardWater,
	Action_2,
	Action_1_Water,
	Action_3,
	Action_2_Water,
	EObjectPitchTargetingStates_MAX,
};

// Enum Athena.EObjectPitchTargetingLimbs
enum class EObjectPitchTargetingLimbs : uint8_t {
	None,
	RightArm,
	LeftArm,
	BothArms,
	EObjectPitchTargetingLimbs_MAX,
};

// Enum Athena.EAnimationWaterPumpState
enum class EAnimationWaterPumpState : uint8_t {
	None,
	PumpForwards,
	PumpBackwards,
	ExitPumping,
	EAnimationWaterPumpState_MAX,
};

// Enum Athena.EWieldedItemAnimationState
enum class EWieldedItemAnimationState : uint8_t {
	Equipping,
	Unequipping,
	Idle,
	Unequipped,
	ContinuousUse,
	OutOfContinuousUse,
	OneShot,
	ComplexOneShot,
	Blocking,
	EWieldedItemAnimationState_MAX,
};

// ScriptStruct Athena.CharacterSocketCollisionResult
// Size: 0xc0 (Inherited: 0x00)
struct FCharacterSocketCollisionResult {
	bool HasHit; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	struct FHitResult HitResult; // 0x04(0x80)
	struct FVector SocketVelocity; // 0x84(0x0c)
	struct FTransform SocketTransform; // 0x90(0x30)
};

// ScriptStruct Athena.CharacterSocketCollisionHandle
// Size: 0x0c (Inherited: 0x00)
struct FCharacterSocketCollisionHandle {
	char UnknownData_0[0xc]; // 0x00(0x0c)
};

// ScriptStruct Athena.ImpactDamageEvent
// Size: 0x58 (Inherited: 0x00)
struct FImpactDamageEvent {
	struct FGuid AttackId; // 0x00(0x10)
	struct UClass* DamagerType; // 0x10(0x08)
	struct AActor* DirectInstigator; // 0x18(0x08)
	struct AActor* RootInstigator; // 0x20(0x08)
	struct FVector Location; // 0x28(0x0c)
	struct FVector SurfaceNormal; // 0x34(0x0c)
	struct FVector Velocity; // 0x40(0x0c)
	float DamageAmount; // 0x4c(0x04)
	int32_t DamageSpread; // 0x50(0x04)
	char Reason; // 0x54(0x01)
	bool DealFriendlyFireDamage; // 0x55(0x01)
	char UnknownData_56[0x2]; // 0x56(0x02)
};

// ScriptStruct Athena.ProjectileAim
// Size: 0x50 (Inherited: 0x00)
struct FProjectileAim {
	struct FVector AimDirection; // 0x00(0x0c)
	struct FVector AimPosition; // 0x0c(0x0c)
	struct UPrimitiveComponent* AimBase; // 0x18(0x08)
	struct FTransform AimBaseTransform; // 0x20(0x30)
};

// ScriptStruct Athena.RewardId
// Size: 0x08 (Inherited: 0x00)
struct FRewardId {
	struct FName RewardId; // 0x00(0x08)
};

// ScriptStruct Athena.AchievementDefinition
// Size: 0x18 (Inherited: 0x00)
struct FAchievementDefinition {
	struct FName DevCenterId; // 0x00(0x08)
	struct TArray<struct FAchievementCriteria> UnlockCriteria; // 0x08(0x10)
};

// ScriptStruct Athena.AchievementCriteria
// Size: 0x18 (Inherited: 0x00)
struct FAchievementCriteria {
	struct FPlayerStat PlayerStat; // 0x00(0x04)
	char UnknownData_4[0x4]; // 0x04(0x04)
	uint64_t Threshold; // 0x08(0x08)
	char Operator; // 0x10(0x01)
	char UnknownData_11[0x7]; // 0x11(0x07)
};

// ScriptStruct Athena.PlayerStat
// Size: 0x04 (Inherited: 0x00)
struct FPlayerStat {
	uint32_t StatId; // 0x00(0x04)
};

// ScriptStruct Athena.FeatureToggledFogBankManagerAsset
// Size: 0x18 (Inherited: 0x00)
struct FFeatureToggledFogBankManagerAsset {
	struct FFeatureFlag FeatureToggle; // 0x00(0x0c)
	char UnknownData_C[0x4]; // 0x0c(0x04)
	struct UFogBankManagerDataAsset* Asset; // 0x10(0x08)
};

// ScriptStruct Athena.FogBankManagerFogAvoidanceArea
// Size: 0x10 (Inherited: 0x00)
struct FFogBankManagerFogAvoidanceArea {
	struct FVector Location; // 0x00(0x0c)
	float Radius; // 0x0c(0x04)
};

// ScriptStruct Athena.WaterPuzzleWaterLevel
// Size: 0x0c (Inherited: 0x00)
struct FWaterPuzzleWaterLevel {
	float WaterLevel; // 0x00(0x04)
	float FillTransitionTime; // 0x04(0x04)
	float DrainTransitionTime; // 0x08(0x04)
};

// ScriptStruct Athena.WaterPuzzleRepData
// Size: 0x08 (Inherited: 0x00)
struct FWaterPuzzleRepData {
	int32_t CurrentWaterLevelIndex; // 0x00(0x04)
	bool TransitionDueToReset; // 0x04(0x01)
	char UnknownData_5[0x3]; // 0x05(0x03)
};

// ScriptStruct Athena.AdventuresActorBundleInfo
// Size: 0x20 (Inherited: 0x00)
struct FAdventuresActorBundleInfo {
	struct FStringAssetReference Actor; // 0x00(0x10)
	struct TArray<struct FStringAssetReference> Pages; // 0x10(0x10)
};

// ScriptStruct Athena.AudioEmitterParameters
// Size: 0x10 (Inherited: 0x00)
struct FAudioEmitterParameters {
	struct UWwiseObjectPoolWrapper* LocalEmitterPool; // 0x00(0x08)
	struct UWwiseObjectPoolWrapper* RemoteEmitterPool; // 0x08(0x08)
};

// ScriptStruct Athena.WeaponProjectileEffectParams
// Size: 0x68 (Inherited: 0x00)
struct FWeaponProjectileEffectParams {
	bool ApplyStun; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	float StunDuration; // 0x04(0x04)
	bool ApplyKnockback; // 0x08(0x01)
	char UnknownData_9[0x3]; // 0x09(0x03)
	struct FKnockBackInfo KnockbackParams; // 0x0c(0x50)
	int32_t MinimumHitProjectilesForKnockback; // 0x5c(0x04)
	float MaximumKnockbackDistance; // 0x60(0x04)
	bool EnableKnockbackFalloffOverDistance; // 0x64(0x01)
	char UnknownData_65[0x3]; // 0x65(0x03)
};

// ScriptStruct Athena.KnockBackInfo
// Size: 0x50 (Inherited: 0x00)
struct FKnockBackInfo {
	struct FName FeatureName; // 0x00(0x08)
	float HorizontalVelocity; // 0x08(0x04)
	float VerticalVelocity; // 0x0c(0x04)
	float MinHorizontalVelocity; // 0x10(0x04)
	float MinVerticalVelocity; // 0x14(0x04)
	float SwimmingVelocity; // 0x18(0x04)
	float DockedHorizontalVelocity; // 0x1c(0x04)
	float DockedVerticalVelocity; // 0x20(0x04)
	bool UseDockedVelocitiesWhenDocked; // 0x24(0x01)
	char UnknownData_25[0x3]; // 0x25(0x03)
	struct FName RumbleTag; // 0x28(0x08)
	float StunDuration; // 0x30(0x04)
	float AIKnockbackDistance; // 0x34(0x04)
	float AIKnockbackSpeed; // 0x38(0x04)
	float AIKnockbackAcceleration; // 0x3c(0x04)
	char AIKnockbackStrengthType; // 0x40(0x01)
	bool UseOverrideLaunchDirection; // 0x41(0x01)
	char UnknownData_42[0x2]; // 0x42(0x02)
	struct FVector OverrideLaunchDirectionInWorldSpace; // 0x44(0x0c)
};

// ScriptStruct Athena.WeaponProjectileParams
// Size: 0xc0 (Inherited: 0x00)
struct FWeaponProjectileParams {
	float Damage; // 0x00(0x04)
	float DamageMultiplierAtMaximumRange; // 0x04(0x04)
	float LifeTime; // 0x08(0x04)
	float TrailFadeOutTime; // 0x0c(0x04)
	float Velocity; // 0x10(0x04)
	float TimeBeforeApplyingGravity; // 0x14(0x04)
	float DownForceVelocityFractionPerSecond; // 0x18(0x04)
	float VelocityDampeningPerSecond; // 0x1c(0x04)
	struct FLinearColor Color; // 0x20(0x10)
	struct UClass* ProjectileId; // 0x30(0x08)
	char HealthChangeReason; // 0x38(0x01)
	char UnknownData_39[0x3]; // 0x39(0x03)
	struct FWeaponProjectileEffectParams ProjectileEffects; // 0x3c(0x68)
	int32_t SuggestedMaxSimulationIterations; // 0xa4(0x04)
	float SuggestedMinTickTimeSecs; // 0xa8(0x04)
	float SuggestedMaxSimulationTimeStep; // 0xac(0x04)
	int32_t SuggestedFixedTimestepMaxSimulationIterations; // 0xb0(0x04)
	float SuggestedFixedTimestepMinTickTimeSecs; // 0xb4(0x04)
	float SuggestedFixedSimulationTimeStep; // 0xb8(0x04)
	char UnknownData_BC[0x4]; // 0xbc(0x04)
};

// ScriptStruct Athena.ProjectileWeaponParameters
// Size: 0x208 (Inherited: 0x00)
struct FProjectileWeaponParameters {
	int32_t AmmoClipSize; // 0x00(0x04)
	int32_t AmmoCostPerShot; // 0x04(0x04)
	float EquipDuration; // 0x08(0x04)
	float IntoAimingDuration; // 0x0c(0x04)
	float RecoilDuration; // 0x10(0x04)
	float ReloadDuration; // 0x14(0x04)
	struct FProjectileShotParams HipFireProjectileShotParams; // 0x18(0x1c)
	struct FProjectileShotParams AimDownSightsProjectileShotParams; // 0x34(0x1c)
	int32_t InaccuracySeed; // 0x50(0x04)
	float ProjectileDistributionMaxAngle; // 0x54(0x04)
	int32_t NumberOfProjectiles; // 0x58(0x04)
	float ProjectileMaximumRange; // 0x5c(0x04)
	float ProjectileHitScanMaximumRange; // 0x60(0x04)
	float ProjectileDamage; // 0x64(0x04)
	float ProjectileDamageMultiplierAtMaximumRange; // 0x68(0x04)
	char UnknownData_6C[0x4]; // 0x6c(0x04)
	struct UClass* DamagerType; // 0x70(0x08)
	struct UClass* ProjectileId; // 0x78(0x08)
	struct FWeaponProjectileParams AmmoParams; // 0x80(0xc0)
	bool UsesScope; // 0x140(0x01)
	char UnknownData_141[0x3]; // 0x141(0x03)
	float ZoomedRecoilDurationIncrease; // 0x144(0x04)
	float SecondsUntilZoomStarts; // 0x148(0x04)
	float SecondsUntilPostStarts; // 0x14c(0x04)
	float WeaponFiredAINoiseRange; // 0x150(0x04)
	float MaximumRequestPositionDelta; // 0x154(0x04)
	float MaximumRequestAngleDelta; // 0x158(0x04)
	float TimeoutTolerance; // 0x15c(0x04)
	float AimingMoveSpeedScalar; // 0x160(0x04)
	char AimSensitivitySettingCategory; // 0x164(0x01)
	char UnknownData_165[0x3]; // 0x165(0x03)
	float InAimFOV; // 0x168(0x04)
	float BlendSpeed; // 0x16c(0x04)
	struct UWwiseEvent* DryFireSfx; // 0x170(0x08)
	struct FAudioEmitterParameters AudioEmitterParameters; // 0x178(0x10)
	struct FName RumbleTag; // 0x188(0x08)
	bool KnockbackEnabled; // 0x190(0x01)
	char UnknownData_191[0x3]; // 0x191(0x03)
	struct FKnockBackInfo KnockbackParams; // 0x194(0x50)
	bool StunEnabled; // 0x1e4(0x01)
	char UnknownData_1E5[0x3]; // 0x1e5(0x03)
	float StunDuration; // 0x1e8(0x04)
	struct FVector TargetingOffset; // 0x1ec(0x0c)
	bool OverridePlayerCharacterInterpolationConeAngleAndDistanceWhenAiming; // 0x1f8(0x01)
	char UnknownData_1F9[0x3]; // 0x1f9(0x03)
	float OverridePlayerCharacterInterpolationConeAngleAndDistanceDuration; // 0x1fc(0x04)
	float PlayerCharacterInterpolationConeAngleOverride; // 0x200(0x04)
	float PlayerCharacterInterpolationDistanceOverride; // 0x204(0x04)
};

// ScriptStruct Athena.ProjectileShotParams
// Size: 0x1c (Inherited: 0x00)
struct FProjectileShotParams {
	int32_t InaccuracySeed; // 0x00(0x04)
	float ProjectileDistributionMaxAngle; // 0x04(0x04)
	int32_t NumberOfProjectiles; // 0x08(0x04)
	float ProjectileMaximumRange; // 0x0c(0x04)
	float ProjectileHitScanMaximumRange; // 0x10(0x04)
	float ProjectileDamage; // 0x14(0x04)
	float ProjectileDamageMultiplierAtMaximumRange; // 0x18(0x04)
};

// ScriptStruct Athena.Projectile
// Size: 0x1c (Inherited: 0x00)
struct FProjectile {
	struct FVector Origin; // 0x00(0x0c)
	struct FVector Direction; // 0x0c(0x0c)
	float MaxDistance; // 0x18(0x04)
};

// ScriptStruct Athena.FireBroadcast
// Size: 0x90 (Inherited: 0x00)
struct FFireBroadcast {
	struct AActor* Instigator; // 0x00(0x08)
	struct TArray<struct FHitResult> HitResults; // 0x08(0x10)
	struct FVector FirePosition; // 0x18(0x0c)
	struct FVector FireDirection; // 0x24(0x0c)
	struct FProjectileAim ProjectileAim; // 0x30(0x50)
	int32_t InaccuracySeed; // 0x80(0x04)
	char UnknownData_84[0xc]; // 0x84(0x0c)
};

// ScriptStruct Athena.FireRequest
// Size: 0xb0 (Inherited: 0x00)
struct FFireRequest {
	struct AActor* Instigator; // 0x00(0x08)
	char UnknownData_8[0x8]; // 0x08(0x08)
	struct FRemoteProjectileAim RemoteAimData; // 0x10(0x60)
	struct TArray<struct FHitResult> HitResults; // 0x70(0x10)
	bool HitResultsAreFromShadowHitScan; // 0x80(0x01)
	char UnknownData_81[0x7]; // 0x81(0x07)
	struct TArray<struct FFireRequestHitActorWorldTransform> HitActorWorldTransforms; // 0x88(0x10)
	struct FGuid TelemetryAttackId; // 0x98(0x10)
	int32_t InaccuracySeed; // 0xa8(0x04)
	char UnknownData_AC[0x4]; // 0xac(0x04)
};

// ScriptStruct Athena.FireRequestHitActorWorldTransform
// Size: 0x20 (Inherited: 0x00)
struct FFireRequestHitActorWorldTransform {
	struct AActor* Actor; // 0x00(0x08)
	struct FVector Location; // 0x08(0x0c)
	struct FRotator Rotation; // 0x14(0x0c)
};

// ScriptStruct Athena.RemoteProjectileAim
// Size: 0x60 (Inherited: 0x00)
struct FRemoteProjectileAim {
	struct FProjectileAim AimData; // 0x00(0x50)
	bool IsRelativeAim; // 0x50(0x01)
	char UnknownData_51[0x7]; // 0x51(0x07)
	struct FProjectileTimeStamp TimeStamp; // 0x58(0x08)
};

// ScriptStruct Athena.ProjectileTimeStamp
// Size: 0x08 (Inherited: 0x00)
struct FProjectileTimeStamp {
	char UnknownData_0[0x8]; // 0x00(0x08)
};

// ScriptStruct Athena.AchievementBlockThenHitAndGetBlockedThenTakeHit
// Size: 0x10 (Inherited: 0x00)
struct FAchievementBlockThenHitAndGetBlockedThenTakeHit {
	struct AAthenaPlayerCharacter* Character; // 0x00(0x08)
	float TimeWindowInSeconds; // 0x08(0x04)
	char UnknownData_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct Athena.AchievementHaveADrinkWithAnotherCrewAtAnOutpost
// Size: 0x20 (Inherited: 0x00)
struct FAchievementHaveADrinkWithAnotherCrewAtAnOutpost {
	struct AAthenaPlayerCharacter* Character; // 0x00(0x08)
	char UnknownData_8[0x10]; // 0x08(0x10)
	float RangeOfCheckInMetres; // 0x18(0x04)
	float DrinkConsumedVolumeThreshold; // 0x1c(0x04)
};

// ScriptStruct Athena.AchievementHeavyAttackRivalOffTheirShip
// Size: 0x10 (Inherited: 0x00)
struct FAchievementHeavyAttackRivalOffTheirShip {
	struct AAthenaCharacter* Character; // 0x00(0x08)
	float TimeWindowInSeconds; // 0x08(0x04)
	char UnknownData_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct Athena.AchievementKillOpponentFromBehindWithBlunderbuss
// Size: 0x04 (Inherited: 0x00)
struct FAchievementKillOpponentFromBehindWithBlunderbuss {
	float FacingDirAngleTolerance; // 0x00(0x04)
};

// ScriptStruct Athena.AchievementKillOpponentInContest
// Size: 0x08 (Inherited: 0x00)
struct FAchievementKillOpponentInContest {
	char UnknownData_0[0x8]; // 0x00(0x08)
};

// ScriptStruct Athena.SprintConditionsParams
// Size: 0x0c (Inherited: 0x00)
struct FSprintConditionsParams {
	float ForwardInputVectorTolerance; // 0x00(0x04)
	float MinVelocityForwardDot; // 0x04(0x04)
	float MinVelocityMagnitude; // 0x08(0x04)
};

// ScriptStruct Athena.SprintLogicHandler
// Size: 0x48 (Inherited: 0x00)
struct FSprintLogicHandler {
	char UnknownData_0[0x48]; // 0x00(0x48)
};

// ScriptStruct Athena.CloudTypeNormalizedWeight
// Size: 0x18 (Inherited: 0x00)
struct FCloudTypeNormalizedWeight {
	struct FLinearColor LodScreenPercentages; // 0x00(0x10)
	float ProbabilityWeight; // 0x10(0x04)
	float MeshRadius; // 0x14(0x04)
};

// ScriptStruct Athena.CloudTypeDefinition
// Size: 0x30 (Inherited: 0x00)
struct FCloudTypeDefinition {
	struct UStaticMesh* CloudMesh; // 0x00(0x08)
	struct UStaticMesh* CloudFluffyMesh; // 0x08(0x08)
	struct FVector2D ScaleRange; // 0x10(0x08)
	struct FVector2D StorminessRange; // 0x18(0x08)
	float ProbabilityWeight; // 0x20(0x04)
	float OverlapTolerance; // 0x24(0x04)
	bool IsStreetCloud; // 0x28(0x01)
	bool CastsShadow; // 0x29(0x01)
	char UnknownData_2A[0x6]; // 0x2a(0x06)
};

// ScriptStruct Athena.RenderedCloudProperties
// Size: 0x30 (Inherited: 0x00)
struct FRenderedCloudProperties {
	struct FVector WorldPosition; // 0x00(0x0c)
	float Fade; // 0x0c(0x04)
	float Storminess; // 0x10(0x04)
	float RotationYaw; // 0x14(0x04)
	float StreetRotationFront; // 0x18(0x04)
	float StreetRotationBack; // 0x1c(0x04)
	bool Visible; // 0x20(0x01)
	bool FluffVisible; // 0x21(0x01)
	bool IsStreetCloud; // 0x22(0x01)
	bool UpdatesThisFrame; // 0x23(0x01)
	char UnknownData_24[0xc]; // 0x24(0x0c)
};

// ScriptStruct Athena.TiledCloudProperties
// Size: 0x24 (Inherited: 0x00)
struct FTiledCloudProperties {
	struct FVector2D TilePosition; // 0x00(0x08)
	int32_t CloudTypeIndex; // 0x08(0x04)
	float RelativeRadius; // 0x0c(0x04)
	float Scale; // 0x10(0x04)
	float PressureThreshold; // 0x14(0x04)
	float RotationYaw; // 0x18(0x04)
	float OverlapTolerance; // 0x1c(0x04)
	char UnknownData_20[0x4]; // 0x20(0x04)
};

// ScriptStruct Athena.CloudVisualParameters
// Size: 0x70 (Inherited: 0x00)
struct FCloudVisualParameters {
	bool RenderInMainPass; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	struct FVector ScalingVector; // 0x04(0x0c)
	struct FVector2D BillboardScale; // 0x10(0x08)
	struct FVector2D BillboardRandomScale; // 0x18(0x08)
	struct FVector2D BillboardRearCutOff; // 0x20(0x08)
	struct FVector2D BillboardForeCutOff; // 0x28(0x08)
	struct FVector2D BillboardSink; // 0x30(0x08)
	float BillboardScaleAlphaDependence; // 0x38(0x04)
	float BillboardRotationRate; // 0x3c(0x04)
	float DistanceFadeExponent; // 0x40(0x04)
	float TurbulenceScale; // 0x44(0x04)
	float TurbulenceStrength; // 0x48(0x04)
	float FluffCullDistance; // 0x4c(0x04)
	struct UMaterialInterface* MaterialTemplatePointCloudSolid; // 0x50(0x08)
	struct UMaterialInterface* MaterialTemplatePointCloudFluffy; // 0x58(0x08)
	struct UMaterialInterface* MaterialTemplateStreetCloudSolid; // 0x60(0x08)
	struct UMaterialInterface* MaterialTemplateStreetCloudFluffy; // 0x68(0x08)
};

// ScriptStruct Athena.WalkConditionsParams
// Size: 0x08 (Inherited: 0x00)
struct FWalkConditionsParams {
	float WalkSpeedMultiplier; // 0x00(0x04)
	float WalkStopThreshold; // 0x04(0x04)
};

// ScriptStruct Athena.WalkLogicHandler
// Size: 0x0c (Inherited: 0x00)
struct FWalkLogicHandler {
	char UnknownData_0[0xc]; // 0x00(0x0c)
};

// ScriptStruct Athena.AthenaPlayerCharacterModelSwap
// Size: 0x68 (Inherited: 0x00)
struct FAthenaPlayerCharacterModelSwap {
	struct USkeletalMesh* FirstPersonMesh; // 0x00(0x08)
	struct UClass* FirstPersonAnimSetDataId; // 0x08(0x08)
	struct FPirateGeneratorAdditionalBakeInfo FirstPersonAdditionalBakeInfo; // 0x10(0x20)
	struct USkeletalMesh* ThirdPersonMesh; // 0x30(0x08)
	struct UClass* ThirdPersonAnimSetDataId; // 0x38(0x08)
	struct FPirateGeneratorAdditionalBakeInfo ThirdPersonAdditionalBakeInfo; // 0x40(0x20)
	char UnknownData_60[0x8]; // 0x60(0x08)
};

// ScriptStruct Athena.Alliance
// Size: 0x28 (Inherited: 0x00)
struct FAlliance {
	struct FGuid AllianceId; // 0x00(0x10)
	struct TArray<struct FGuid> Crews; // 0x10(0x10)
	char AllianceIndex; // 0x20(0x01)
	char UnknownData_21[0x7]; // 0x21(0x07)
};

// ScriptStruct Athena.CrewAllianceJoinStatus
// Size: 0x14 (Inherited: 0x00)
struct FCrewAllianceJoinStatus {
	struct FGuid CrewId; // 0x00(0x10)
	char AllianceJoinStatus; // 0x10(0x01)
	char LastAllianceJoinStatus; // 0x11(0x01)
	char UnknownData_12[0x2]; // 0x12(0x02)
};

// ScriptStruct Athena.NPCCustomAnimationBlueprintData
// Size: 0x68 (Inherited: 0x00)
struct FNPCCustomAnimationBlueprintData {
	bool SequenceActive; // 0x00(0x01)
	bool LoopActive; // 0x01(0x01)
	char UnknownData_2[0x2]; // 0x02(0x02)
	int32_t ActiveSequenceIndex; // 0x04(0x04)
	bool IsOneShot; // 0x08(0x01)
	char UnknownData_9[0x7]; // 0x09(0x07)
	struct FNPCCustomAnimationBlueprintPlayingAnimations BlueprintPlayingAnimations; // 0x10(0x28)
	struct FNPCCustomAnimationBlueprintPlayingMontage BlueprintPlayingFacialMontages; // 0x38(0x28)
	char CustomAnimationState; // 0x60(0x01)
	char UnknownData_61[0x7]; // 0x61(0x07)
};

// ScriptStruct Athena.NPCCustomAnimationBlueprintPlayingMontage
// Size: 0x28 (Inherited: 0x00)
struct FNPCCustomAnimationBlueprintPlayingMontage {
	struct UAnimMontage* OneShot; // 0x00(0x08)
	struct UAnimMontage* ContinouousIn; // 0x08(0x08)
	struct UAnimMontage* ContinouousLoop_A; // 0x10(0x08)
	struct UAnimMontage* ContinouousLoop_B; // 0x18(0x08)
	struct UAnimMontage* ContinouousOut; // 0x20(0x08)
};

// ScriptStruct Athena.NPCCustomAnimationBlueprintPlayingAnimations
// Size: 0x28 (Inherited: 0x00)
struct FNPCCustomAnimationBlueprintPlayingAnimations {
	struct UAnimSequenceBase* OneShot; // 0x00(0x08)
	struct UAnimSequenceBase* ContinouousIn; // 0x08(0x08)
	struct UAnimSequenceBase* ContinouousLoop_A; // 0x10(0x08)
	struct UAnimSequenceBase* ContinouousLoop_B; // 0x18(0x08)
	struct UAnimSequenceBase* ContinouousOut; // 0x20(0x08)
};

// ScriptStruct Athena.NPCCustomAnimationDataStructure
// Size: 0x38 (Inherited: 0x00)
struct FNPCCustomAnimationDataStructure {
	struct TArray<struct FNPCOneShotAnimationElement> OneShotSequences; // 0x00(0x10)
	struct TArray<struct FNPCContinuousAnimationElement> ContinuousSequences; // 0x10(0x10)
	struct UNPCHeldObjectData* WieldableCosmeticItemList; // 0x20(0x08)
	struct TArray<struct FNPCInitialSpawnedCosmeticItems> InitialSpawnedCosmeticItems; // 0x28(0x10)
};

// ScriptStruct Athena.NPCInitialSpawnedCosmeticItems
// Size: 0x10 (Inherited: 0x00)
struct FNPCInitialSpawnedCosmeticItems {
	struct UClass* CosmeticItemObject; // 0x00(0x08)
	struct FName AttachSocketName; // 0x08(0x08)
};

// ScriptStruct Athena.NPCContinuousAnimationElement
// Size: 0x38 (Inherited: 0x00)
struct FNPCContinuousAnimationElement {
	struct FName SequenceName; // 0x00(0x08)
	struct FNPCAnimationContinuousCycle ContinuousSequence; // 0x08(0x30)
};

// ScriptStruct Athena.NPCAnimationContinuousCycle
// Size: 0x30 (Inherited: 0x00)
struct FNPCAnimationContinuousCycle {
	struct FNPCAnimationSequence In; // 0x00(0x10)
	struct TArray<struct FNPCAnimationSequence> Loop; // 0x10(0x10)
	struct FNPCAnimationSequence Out; // 0x20(0x10)
};

// ScriptStruct Athena.NPCAnimationSequence
// Size: 0x10 (Inherited: 0x00)
struct FNPCAnimationSequence {
	struct UAnimSequenceBase* AnimationSequence; // 0x00(0x08)
	struct UAnimMontage* FacialAdditive; // 0x08(0x08)
};

// ScriptStruct Athena.NPCOneShotAnimationElement
// Size: 0x18 (Inherited: 0x00)
struct FNPCOneShotAnimationElement {
	struct FName SequenceName; // 0x00(0x08)
	struct TArray<struct FNPCAnimationSequence> OneShotSequence; // 0x08(0x10)
};

// ScriptStruct Athena.AnimNotifyWwiseObserver
// Size: 0x20 (Inherited: 0x00)
struct FAnimNotifyWwiseObserver {
	struct UWwiseEvent* OnEventPosted; // 0x00(0x08)
	bool PreventPlayingPostedEvent; // 0x08(0x01)
	char UnknownData_9[0x7]; // 0x09(0x07)
	struct TArray<struct UWwiseEvent*> AdditionalEventsToTrigger; // 0x10(0x10)
};

// ScriptStruct Athena.JoinedCrew
// Size: 0x14 (Inherited: 0x00)
struct FJoinedCrew {
	char UnknownData_0[0x14]; // 0x00(0x14)
};

// ScriptStruct Athena.AthenaAnimationCustomSkeletonAnimationBlueprintData
// Size: 0x58 (Inherited: 0x00)
struct FAthenaAnimationCustomSkeletonAnimationBlueprintData {
	bool SequenceActive; // 0x00(0x01)
	bool LoopActive; // 0x01(0x01)
	char UnknownData_2[0x2]; // 0x02(0x02)
	int32_t ActiveSequenceIndex; // 0x04(0x04)
	bool IsOneShot; // 0x08(0x01)
	char UnknownData_9[0x7]; // 0x09(0x07)
	struct FSkeletonCustomAnimationBlueprintPlayingAnimations BlueprintPlayingAnimations; // 0x10(0x38)
	struct UNPCHeldObjectData* WieldableCosmeticItemList; // 0x48(0x08)
	char CustomAnimationState; // 0x50(0x01)
	char UnknownData_51[0x3]; // 0x51(0x03)
	float BlendTime; // 0x54(0x04)
};

// ScriptStruct Athena.SkeletonCustomAnimationBlueprintPlayingAnimations
// Size: 0x38 (Inherited: 0x00)
struct FSkeletonCustomAnimationBlueprintPlayingAnimations {
	struct UAnimSequence* OneShot; // 0x00(0x08)
	struct UAnimSequence* ContinuousIn; // 0x08(0x08)
	struct UAnimSequence* ContinuousLoop_A; // 0x10(0x08)
	struct UAnimSequence* ContinuousLoop_B; // 0x18(0x08)
	struct UAnimSequence* ContinuousOut; // 0x20(0x08)
	struct TArray<struct UAnimSequence*> AlternateContinuousOuts; // 0x28(0x10)
};

// ScriptStruct Athena.SkeletonCustomAnimationDataStructure
// Size: 0x38 (Inherited: 0x00)
struct FSkeletonCustomAnimationDataStructure {
	struct TArray<struct FOneShotAnimationElement> OneShotSequences; // 0x00(0x10)
	struct TArray<struct FContinuousAnimationElement> ContinuousSequences; // 0x10(0x10)
	struct UNPCHeldObjectData* WieldableCosmeticItemList; // 0x20(0x08)
	struct TArray<struct UWwiseEvent*> AudioEvents; // 0x28(0x10)
};

// ScriptStruct Athena.ContinuousAnimationElement
// Size: 0x58 (Inherited: 0x00)
struct FContinuousAnimationElement {
	struct FName SequenceName; // 0x00(0x08)
	struct FAnimationContinuousCycle ContinuousSequence; // 0x08(0x48)
	float BlendTime; // 0x50(0x04)
	char UnknownData_54[0x4]; // 0x54(0x04)
};

// ScriptStruct Athena.AnimationContinuousCycle
// Size: 0x48 (Inherited: 0x00)
struct FAnimationContinuousCycle {
	struct UAnimSequence* In; // 0x00(0x08)
	float InEffectTime; // 0x08(0x04)
	char UnknownData_C[0x4]; // 0x0c(0x04)
	struct TArray<struct UAnimSequence*> Loop; // 0x10(0x10)
	struct UBlendSpace1D* LoopHitReact; // 0x20(0x08)
	struct UAnimSequence* Out; // 0x28(0x08)
	struct TArray<struct UAnimSequence*> OutAlternates; // 0x30(0x10)
	float OutUndockTime; // 0x40(0x04)
	char UnknownData_44[0x4]; // 0x44(0x04)
};

// ScriptStruct Athena.OneShotAnimationElement
// Size: 0x20 (Inherited: 0x00)
struct FOneShotAnimationElement {
	struct FName SequenceName; // 0x00(0x08)
	struct TArray<struct UAnimSequence*> OneShotSequence; // 0x08(0x10)
	float EffectTime; // 0x18(0x04)
	float BlendTime; // 0x1c(0x04)
};

// ScriptStruct Athena.AthenaAnimationLocomotion
// Size: 0x68 (Inherited: 0x00)
struct FAthenaAnimationLocomotion {
	struct FVector CharacterVelocity; // 0x00(0x0c)
	float WantedMovementSpeed; // 0x0c(0x04)
	float HalfWantedMovementSpeed; // 0x10(0x04)
	bool CharacterMoving; // 0x14(0x01)
	bool RunStopWanted; // 0x15(0x01)
	char UnknownData_16[0x2]; // 0x16(0x02)
	float TurnRate; // 0x18(0x04)
	float CurrentYaw; // 0x1c(0x04)
	float CurrentDirection; // 0x20(0x04)
	bool TurningActive; // 0x24(0x01)
	bool TurningLeft; // 0x25(0x01)
	bool IsSwimming; // 0x26(0x01)
	bool IsUnderwaterSwimming; // 0x27(0x01)
	float BlendedTurnRate; // 0x28(0x04)
	float MinimumMoveSpeedToTriggerRunStop; // 0x2c(0x04)
	float InterpSpeed; // 0x30(0x04)
	float TurnRateToDisableTurns; // 0x34(0x04)
	float TurningAnimationExplicitTime; // 0x38(0x04)
	float FixedBlendedTurnRateForAI; // 0x3c(0x04)
	bool IsInAITurn; // 0x40(0x01)
	char UnknownData_41[0x17]; // 0x41(0x17)
	struct UAthenaAnimationInstance* CachedOwner; // 0x58(0x08)
	char UnknownData_60[0x8]; // 0x60(0x08)
};

// ScriptStruct Athena.AthenaAnimationFishing
// Size: 0x3f0 (Inherited: 0x00)
struct FAthenaAnimationFishing {
	bool AnimationOverride; // 0x00(0x01)
	char UnknownData_1[0x3cf]; // 0x01(0x3cf)
	struct AActor* FishingRodActor; // 0x3d0(0x08)
	struct AActor* FishingFloat; // 0x3d8(0x08)
	struct UAthenaAnimationInstance* OwningAnimationInstance; // 0x3e0(0x08)
	char UnknownData_3E8[0x8]; // 0x3e8(0x08)
};

// ScriptStruct Athena.AthenaAnimationFishingParams
// Size: 0x34 (Inherited: 0x00)
struct FAthenaAnimationFishingParams {
	char FishingState; // 0x00(0x01)
	bool InFishing; // 0x01(0x01)
	char UnknownData_2[0x2]; // 0x02(0x02)
	struct FVector2D RodBend; // 0x04(0x08)
	float ReelSpeed; // 0x0c(0x04)
	bool CastFailed; // 0x10(0x01)
	bool IsFishHookedAndVisible; // 0x11(0x01)
	char UnknownData_12[0x2]; // 0x12(0x02)
	struct FVector2D PlayerInputForce; // 0x14(0x08)
	float TensionShake; // 0x1c(0x04)
	float LineSnapShake; // 0x20(0x04)
	bool IKIsActive; // 0x24(0x01)
	char UnknownData_25[0x3]; // 0x25(0x03)
	float IKBlendInSpeed; // 0x28(0x04)
	float IKBlendIOutSpeed; // 0x2c(0x04)
	bool IsComedyItem; // 0x30(0x01)
	char FishingJIPState; // 0x31(0x01)
	char UnknownData_32[0x2]; // 0x32(0x02)
};

// ScriptStruct Athena.AthenaAnimationIdleVariantChange
// Size: 0x10 (Inherited: 0x00)
struct FAthenaAnimationIdleVariantChange {
	float CurrentTime; // 0x00(0x04)
	float TriggerTime; // 0x04(0x04)
	int32_t VariantID; // 0x08(0x04)
	bool VariantCompleted; // 0x0c(0x01)
	char UnknownData_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct Athena.AthenaAnimationRowboatParams
// Size: 0xc8 (Inherited: 0x00)
struct FAthenaAnimationRowboatParams {
	bool InLeftArmRow; // 0x00(0x01)
	bool InLeftArmRecover; // 0x01(0x01)
	bool InRightArmRow; // 0x02(0x01)
	bool InRightArmRecover; // 0x03(0x01)
	float LeftArmForce; // 0x04(0x04)
	float LeftArmRecover; // 0x08(0x04)
	float RightArmForce; // 0x0c(0x04)
	float RightArmRecover; // 0x10(0x04)
	char Braking; // 0x14(0x01)
	bool BrakingLeftOrBoth; // 0x15(0x01)
	bool BrakingRightOrBoth; // 0x16(0x01)
	char UnknownData_17[0x1]; // 0x17(0x01)
	int32_t Direction; // 0x18(0x04)
	bool PlayIdle; // 0x1c(0x01)
	bool LeftArmInactive; // 0x1d(0x01)
	bool RightArmInactive; // 0x1e(0x01)
	char UnknownData_1F[0x1]; // 0x1f(0x01)
	struct FVector CameraAdjustment; // 0x20(0x0c)
	bool IsSeated; // 0x2c(0x01)
	char UnknownData_2D[0x3]; // 0x2d(0x03)
	struct FAthenaAnimationRowboatAnimationsFirstPerson RowBoatAnimationsFirstPerson; // 0x30(0x30)
	struct FAthenaAnimationRowboatAnimationsThirdPerson RowBoatAnimationsThirdPerson; // 0x60(0x50)
	struct FAthenaAnimationRowboatAnimationsPassenger RowBoatAnimationsPassenger; // 0xb0(0x18)
};

// ScriptStruct Athena.AthenaAnimationRowboatAnimationsPassenger
// Size: 0x18 (Inherited: 0x00)
struct FAthenaAnimationRowboatAnimationsPassenger {
	struct UAnimSequence* PassengerIntoSitting; // 0x00(0x08)
	struct UAnimSequence* PassengerSittingIdle; // 0x08(0x08)
	struct UAnimSequence* PassengerStand; // 0x10(0x08)
};

// ScriptStruct Athena.AthenaAnimationRowboatAnimationsThirdPerson
// Size: 0x50 (Inherited: 0x00)
struct FAthenaAnimationRowboatAnimationsThirdPerson {
	struct UAnimSequence* SitDown; // 0x00(0x08)
	struct UAnimSequence* Stand; // 0x08(0x08)
	struct UAnimSequence* Idle; // 0x10(0x08)
	struct UBlendSpace1D* Row; // 0x18(0x08)
	struct UBlendSpace1D* Recover; // 0x20(0x08)
	struct UBlendSpace1D* IntoRow; // 0x28(0x08)
	struct UBlendSpace1D* IntoRowBrake; // 0x30(0x08)
	struct UBlendSpace1D* BrakeRow; // 0x38(0x08)
	struct UBlendSpace1D* BrakeRecover; // 0x40(0x08)
	struct UBlendSpace1D* BrakeIdle; // 0x48(0x08)
};

// ScriptStruct Athena.AthenaAnimationRowboatAnimationsFirstPerson
// Size: 0x30 (Inherited: 0x00)
struct FAthenaAnimationRowboatAnimationsFirstPerson {
	struct UAnimSequence* SitDown; // 0x00(0x08)
	struct UAnimSequence* Stand; // 0x08(0x08)
	struct UAnimSequence* Idle; // 0x10(0x08)
	struct UAnimSequence* Row; // 0x18(0x08)
	struct UAnimSequence* Recover; // 0x20(0x08)
	struct UAnimSequence* Brake; // 0x28(0x08)
};

// ScriptStruct Athena.AthenaAnimationRowing
// Size: 0xe0 (Inherited: 0x00)
struct FAthenaAnimationRowing {
	struct AActor* ControlledObject; // 0x00(0x08)
	struct AActor* CachedPlayerCharacter; // 0x08(0x08)
	struct UClass* CosmeticOarClass; // 0x10(0x08)
	char UnknownData_18[0xc8]; // 0x18(0xc8)
};

// ScriptStruct Athena.AthenaAnimationWieldedItemStateMachine
// Size: 0x5f0 (Inherited: 0x00)
struct FAthenaAnimationWieldedItemStateMachine {
	char CurrentState; // 0x00(0x01)
	char PreviousState; // 0x01(0x01)
	bool ExpectingTransition; // 0x02(0x01)
	char UnknownData_3[0x5]; // 0x03(0x05)
	struct UClass* ContinuousUseInputId; // 0x08(0x08)
	struct UClass* OutOfContinuousUseInputId; // 0x10(0x08)
	struct UClass* OneShotUseInputId; // 0x18(0x08)
	bool OneShotIsAlternate; // 0x20(0x01)
	bool ContinuousIsAlternate; // 0x21(0x01)
	char OneShotAnimationVariant; // 0x22(0x01)
	bool IdleIsAlternate; // 0x23(0x01)
	bool UsePrimaryContinuousAnimations; // 0x24(0x01)
	bool UsePrimaryContinuousOutOfAnimations; // 0x25(0x01)
	bool UsePrimaryOneShotAnimations; // 0x26(0x01)
	char UnknownData_27[0x29]; // 0x27(0x29)
	struct UAnimSequence* LastValidAnimSequence; // 0x50(0x08)
	struct UBlendSpace1D* LastValidBlendspace; // 0x58(0x08)
	struct AActor* PreviousWieldedItem; // 0x60(0x08)
	bool DuplicateTransition; // 0x68(0x01)
	char UnknownData_69[0x3]; // 0x69(0x03)
	struct FName WieldSockets[0x07]; // 0x6c(0x38)
	char UnknownData_A4[0x54c]; // 0xa4(0x54c)
};

// ScriptStruct Athena.AthenaAnimationSkeletonCurseAnimations
// Size: 0x28 (Inherited: 0x00)
struct FAthenaAnimationSkeletonCurseAnimations {
	struct UAnimSequence* SkeletonDrunk; // 0x00(0x08)
	struct UAnimSequence* SkeletonDance; // 0x08(0x08)
	struct UAnimSequence* SkeletonSleepInto; // 0x10(0x08)
	struct UAnimSequence* SkeletonSleepLoop; // 0x18(0x08)
	struct UAnimSequence* SkeletonSleepOut; // 0x20(0x08)
};

// ScriptStruct Athena.AthenaAnimationSkeletonScream
// Size: 0x08 (Inherited: 0x00)
struct FAthenaAnimationSkeletonScream {
	struct UAnimSequence* SkeletonScream; // 0x00(0x08)
};

// ScriptStruct Athena.AthenaAnimationSkeletonFleeInGraph
// Size: 0x38 (Inherited: 0x00)
struct FAthenaAnimationSkeletonFleeInGraph {
	struct UAnimSequence* TurnLeft; // 0x00(0x08)
	struct UAnimSequence* TurnRight; // 0x08(0x08)
	struct UBlendSpace* LocomotionBase; // 0x10(0x08)
	struct UBlendSpace* LocomotionVariant; // 0x18(0x08)
	struct TArray<struct UBlendSpace*> LocomotionVariantSelection; // 0x20(0x10)
	int32_t PrecentageChanceOfVariantOccuring; // 0x30(0x04)
	char UnknownData_34[0x4]; // 0x34(0x04)
};

// ScriptStruct Athena.AthenaAnimationSkeletonFlee
// Size: 0x40 (Inherited: 0x00)
struct FAthenaAnimationSkeletonFlee {
	struct UClass* UseWithObject; // 0x00(0x08)
	struct TArray<struct UAnimSequence*> FleeTurnLeft; // 0x08(0x10)
	struct TArray<struct UAnimSequence*> FleeTurnRight; // 0x18(0x10)
	struct UBlendSpace* FleeLocomotionBase; // 0x28(0x08)
	struct TArray<struct UBlendSpace*> FleeLocomotionVariants; // 0x30(0x10)
};

// ScriptStruct Athena.AthenaAnimationSkeletonEmoteActionParams
// Size: 0x38 (Inherited: 0x00)
struct FAthenaAnimationSkeletonEmoteActionParams {
	struct TArray<struct FAthenaAnimationSkeletonEmoteActionAnimations> AllLoadedAIEmoteActionAnimations; // 0x00(0x10)
	char CurrentEmoteActionState; // 0x10(0x01)
	char UnknownData_11[0x7]; // 0x11(0x07)
	struct UAnimSequence* TauntAnimation; // 0x18(0x08)
	struct UAnimSequence* CheerAnimation; // 0x20(0x08)
	struct UAnimSequence* TauntAnimationB; // 0x28(0x08)
	struct UAnimSequence* CheerAnimationB; // 0x30(0x08)
};

// ScriptStruct Athena.AthenaAnimationSkeletonEmoteActionAnimations
// Size: 0x28 (Inherited: 0x00)
struct FAthenaAnimationSkeletonEmoteActionAnimations {
	struct UClass* UseWithObject; // 0x00(0x08)
	struct TArray<struct UAnimSequence*> Taunt; // 0x08(0x10)
	struct TArray<struct UAnimSequence*> Cheer; // 0x18(0x10)
};

// ScriptStruct Athena.AthenaAnimationSkeletonShipCaptainParams
// Size: 0x60 (Inherited: 0x00)
struct FAthenaAnimationSkeletonShipCaptainParams {
	struct FAthenaAnimationSkeletonShipCaptainAnimations AllSkeletonShipCaptainAnimations; // 0x00(0x48)
	struct UAnimSequence* ShipCaptainIdleCycleA; // 0x48(0x08)
	struct UAnimSequence* ShipCaptainIdleCycleB; // 0x50(0x08)
	char DockedAnimationState; // 0x58(0x01)
	char UnknownData_59[0x7]; // 0x59(0x07)
};

// ScriptStruct Athena.AthenaAnimationSkeletonShipCaptainAnimations
// Size: 0x48 (Inherited: 0x00)
struct FAthenaAnimationSkeletonShipCaptainAnimations {
	struct UAnimSequence* EnterDockedPose; // 0x00(0x08)
	struct TArray<struct UAnimSequence*> DockedIdles; // 0x08(0x10)
	struct UAnimSequence* ExitDockedPose; // 0x18(0x08)
	struct UAnimSequence* Taunt; // 0x20(0x08)
	struct UAnimSequence* RamInto; // 0x28(0x08)
	struct UAnimSequence* RamCycle; // 0x30(0x08)
	struct UAnimSequence* RamImpact; // 0x38(0x08)
	struct UAnimSequence* RamOutOf; // 0x40(0x08)
};

// ScriptStruct Athena.AthenaAnimationSkeletonSensingParams
// Size: 0x38 (Inherited: 0x00)
struct FAthenaAnimationSkeletonSensingParams {
	struct TArray<struct FAthenaAnimationSkeletonSensingAnimations> AllLoadedAISensingAnimations; // 0x00(0x10)
	char CurrentSensingState; // 0x10(0x01)
	char UnknownData_11[0x7]; // 0x11(0x07)
	struct UAnimSequence* InitialReactionAnimation; // 0x18(0x08)
	struct UBlendSpace1D* SearchingAnimation; // 0x20(0x08)
	struct UAnimSequence* AlertingOthersAnimation; // 0x28(0x08)
	struct UBlendSpace1D* PursuitAnimation; // 0x30(0x08)
};

// ScriptStruct Athena.AthenaAnimationSkeletonSensingAnimations
// Size: 0x28 (Inherited: 0x00)
struct FAthenaAnimationSkeletonSensingAnimations {
	struct UClass* UseWithObject; // 0x00(0x08)
	struct UAnimSequence* InitialReaction; // 0x08(0x08)
	struct UBlendSpace1D* Searching; // 0x10(0x08)
	struct UAnimSequence* AlertingOthers; // 0x18(0x08)
	struct UBlendSpace1D* Pursuit; // 0x20(0x08)
};

// ScriptStruct Athena.AthenaAnimationAI
// Size: 0x358 (Inherited: 0x00)
struct FAthenaAnimationAI {
	bool SpawnAnimationActive; // 0x00(0x01)
	bool SpawnAnimationReadyToBegin; // 0x01(0x01)
	char UnknownData_2[0x6]; // 0x02(0x06)
	struct UAnimSequence* AISpawn; // 0x08(0x08)
	struct UAnimSequence* AIDespawn; // 0x10(0x08)
	float AIAnimationSpawnTime; // 0x18(0x04)
	bool AISpawnOnLand; // 0x1c(0x01)
	bool AIFleeActive; // 0x1d(0x01)
	char UnknownData_1E[0x2]; // 0x1e(0x02)
	struct FAthenaAnimationSkeletonSensingParams AISensing; // 0x20(0x38)
	struct FAthenaAnimationSkeletonEmoteActionParams AIEmoteActions; // 0x58(0x38)
	struct FAthenaAnimationSkeletonShipCaptainParams SkeletonShipCaptainParams; // 0x90(0x60)
	char UnknownData_F0[0x268]; // 0xf0(0x268)
};

// ScriptStruct Athena.AthenaAnimationAIKnockback
// Size: 0x30 (Inherited: 0x00)
struct FAthenaAnimationAIKnockback {
	struct FAthenaAnimationSkeletonKnockbackLocomotionStrength KnockbackAnimations; // 0x00(0x20)
	char AIKnockbackDirection; // 0x20(0x01)
	char UnknownData_21[0x3]; // 0x21(0x03)
	char KnockbackActive : 1; // 0x24(0x01)
	char UnknownData_24_1 : 7; // 0x24(0x01)
	char UnknownData_25[0x3]; // 0x25(0x03)
	struct UAnimSequence* KnockbackAnimToUse; // 0x28(0x08)
};

// ScriptStruct Athena.AthenaAnimationSkeletonKnockbackLocomotionStrength
// Size: 0x20 (Inherited: 0x00)
struct FAthenaAnimationSkeletonKnockbackLocomotionStrength {
	struct FAthenaAnimationSkeletonKnockbackLocomotion LowStrength; // 0x00(0x10)
	struct FAthenaAnimationSkeletonKnockbackLocomotion HighStrength; // 0x10(0x10)
};

// ScriptStruct Athena.AthenaAnimationSkeletonKnockbackLocomotion
// Size: 0x10 (Inherited: 0x00)
struct FAthenaAnimationSkeletonKnockbackLocomotion {
	struct UAnimSequence* Forwards; // 0x00(0x08)
	struct UAnimSequence* Backwards; // 0x08(0x08)
};

// ScriptStruct Athena.AthenaAnimationFootPlanting
// Size: 0x48 (Inherited: 0x00)
struct FAthenaAnimationFootPlanting {
	char UnknownData_0[0x8]; // 0x00(0x08)
	struct FCollisionResponseContainer OverrideRaycast; // 0x08(0x20)
	float HipHeight; // 0x28(0x04)
	float HipPullStrength; // 0x2c(0x04)
	float DownDistance; // 0x30(0x04)
	float DownDistanceRangeStart; // 0x34(0x04)
	float DownDistanceRangeEnd; // 0x38(0x04)
	float IKLegStretch; // 0x3c(0x04)
	float SlopeAngle; // 0x40(0x04)
	bool Active; // 0x44(0x01)
	bool FeetContact; // 0x45(0x01)
	char UnknownData_46[0x2]; // 0x46(0x02)
};

// ScriptStruct Athena.AthenaAnimationStunData
// Size: 0x08 (Inherited: 0x00)
struct FAthenaAnimationStunData {
	char StunAnimType; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	char IsCursedVariant : 1; // 0x04(0x01)
	char UnknownData_4_1 : 7; // 0x04(0x01)
	char UnknownData_5[0x3]; // 0x05(0x03)
};

// ScriptStruct Athena.AthenaAnimationHarpoonLauncherAnimData
// Size: 0x28 (Inherited: 0x00)
struct FAthenaAnimationHarpoonLauncherAnimData {
	struct TArray<struct UBlendSpace1D*> Idle; // 0x00(0x10)
	struct UBlendSpace1D* FireInto; // 0x10(0x08)
	struct UBlendSpace1D* FireOutOf; // 0x18(0x08)
	struct UBlendSpace1D* FireAction; // 0x20(0x08)
};

// ScriptStruct Athena.AthenaAnimationMountedWeapon
// Size: 0x128 (Inherited: 0x00)
struct FAthenaAnimationMountedWeapon {
	bool IsFiring; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	float Pitch; // 0x04(0x04)
	float Yaw; // 0x08(0x04)
	char UnknownData_C[0x4]; // 0x0c(0x04)
	struct AActor* ControlledObject; // 0x10(0x08)
	char UnknownData_18[0x110]; // 0x18(0x110)
};

// ScriptStruct Athena.AssetDelayLoadEntry
// Size: 0x40 (Inherited: 0x00)
struct FAssetDelayLoadEntry {
	struct FString Comment; // 0x00(0x10)
	char LoadAtPhase; // 0x10(0x01)
	char Persistence; // 0x11(0x01)
	bool LoadForClient; // 0x12(0x01)
	bool LoadForServer; // 0x13(0x01)
	struct FName Feature; // 0x14(0x08)
	char UnknownData_1C[0x4]; // 0x1c(0x04)
	struct TArray<struct FStringAssetReference> AssetsToLoad; // 0x20(0x10)
	struct TArray<struct UClass*> BlueprintsToLoad; // 0x30(0x10)
};

// ScriptStruct Athena.RequestedLoopAnims
// Size: 0x10 (Inherited: 0x00)
struct FRequestedLoopAnims {
	struct FName RequestedLoopingAnimName; // 0x00(0x08)
	int32_t RequestedOutOfAnimIndex; // 0x08(0x04)
	int32_t AnimationAssetRequired; // 0x0c(0x04)
};

// ScriptStruct Athena.VoyageParticipantViewContainer
// Size: 0xd8 (Inherited: 0x00)
struct FVoyageParticipantViewContainer {
	struct FVoyageParticipantView State; // 0x00(0xd8)
};

// ScriptStruct Athena.VoyageParticipantView
// Size: 0xd8 (Inherited: 0x00)
struct FVoyageParticipantView {
	struct FText Title; // 0x00(0x38)
	struct FGuid Id; // 0x38(0x10)
	int32_t ChapterIndex; // 0x48(0x04)
	int32_t ChapterCount; // 0x4c(0x04)
	int32_t ActiveQuestCount; // 0x50(0x04)
	char History; // 0x54(0x01)
	char UnknownData_55[0x3]; // 0x55(0x03)
	struct UClass* Company; // 0x58(0x08)
	bool IsEmergent; // 0x60(0x01)
	bool IsTale; // 0x61(0x01)
	char EmergentSource; // 0x62(0x01)
	struct FViewVoyageBanners ViewVoyageBanners; // 0x63(0x03)
	bool DoNotNotifyParticipantsOnVoyageComplete; // 0x66(0x01)
	char UnknownData_67[0x1]; // 0x67(0x01)
	int32_t Rank; // 0x68(0x04)
	struct FNetActorPtr PlayerStateOfDiscoverer; // 0x6c(0x14)
	bool IsDiscovererMe; // 0x80(0x01)
	char UnknownData_81[0x3]; // 0x81(0x03)
	struct FName ChestRarity; // 0x84(0x08)
	bool PlayAudio; // 0x8c(0x01)
	char UnknownData_8D[0x3]; // 0x8d(0x03)
	int32_t ChestDiscoveredId; // 0x90(0x04)
	char UnknownData_94[0x4]; // 0x94(0x04)
	struct UPopUpMessageDesc* PopUpDesc; // 0x98(0x08)
	int32_t CollectCratesPopUpId; // 0xa0(0x04)
	char UnknownData_A4[0x4]; // 0xa4(0x04)
	struct TArray<struct FPlayerStat> VoyageCompletionStats; // 0xa8(0x10)
	struct TArray<struct FPlayerStat> ReapersMarkCompletionStats; // 0xb8(0x10)
	struct TArray<struct FVoyageCompletionReward> VoyageCompletionRewards; // 0xc8(0x10)
};

// ScriptStruct Athena.VoyageCompletionReward
// Size: 0x20 (Inherited: 0x00)
struct FVoyageCompletionReward {
	struct TArray<char> VoyageLocations; // 0x00(0x10)
	struct TArray<struct FRewardId> Rewards; // 0x10(0x10)
};

// ScriptStruct Athena.ViewVoyageBanners
// Size: 0x03 (Inherited: 0x00)
struct FViewVoyageBanners {
	char ShowIntroBanners; // 0x00(0x01)
	char ShowOutroBanners; // 0x01(0x01)
	struct FViewCustomVoyageBanners ShowCustomIntroBanners; // 0x02(0x01)
};

// ScriptStruct Athena.ViewCustomVoyageBanners
// Size: 0x01 (Inherited: 0x00)
struct FViewCustomVoyageBanners {
	char ShowQuestReceivedBanners; // 0x00(0x01)
};

// ScriptStruct Athena.AthenaCharacterSwimParams
// Size: 0x9c (Inherited: 0x00)
struct FAthenaCharacterSwimParams {
	float EnterSwimmingDepth; // 0x00(0x04)
	float ExitSwimmingDepth; // 0x04(0x04)
	float FloatHeight; // 0x08(0x04)
	float ThirdPersonMeshOffset; // 0x0c(0x04)
	float ThirdPersonMeshAdjustTime; // 0x10(0x04)
	float FullGravityHeight; // 0x14(0x04)
	float SurfaceSwimDepth; // 0x18(0x04)
	float SurfaceSwimExitDepth; // 0x1c(0x04)
	float SubmergedBuoyancyDepth; // 0x20(0x04)
	float ZeroDragDepth; // 0x24(0x04)
	float MaxBuoyancyAcceleration; // 0x28(0x04)
	float SubmergedBuoyancyAcceleration; // 0x2c(0x04)
	float SubmergedBuoyancyTime; // 0x30(0x04)
	float DragFactor; // 0x34(0x04)
	float MaxDragAcceleration; // 0x38(0x04)
	float MinPushDownRoofAngle; // 0x3c(0x04)
	float MinPushDownRoofZ; // 0x40(0x04)
	float MinCorrectionVelForSurfaceSwim; // 0x44(0x04)
	float SurfaceVelBlendTime; // 0x48(0x04)
	float UnderwaterSwimmingEntryPitch; // 0x4c(0x04)
	float UnderwaterSwimmingEntryAccel; // 0x50(0x04)
	float UnderwaterSwimDepth; // 0x54(0x04)
	float UnderwaterSwimmingDragSpeed; // 0x58(0x04)
	float UnderwaterSwimmingSpeed; // 0x5c(0x04)
	float PitchBlendOffRate; // 0x60(0x04)
	float MaxSwimDepth; // 0x64(0x04)
	float MaxSwimDepthBuoyancy; // 0x68(0x04)
	float MaxSwimDepthBuoyancyRange; // 0x6c(0x04)
	float MaxSwimDepthDragFactor; // 0x70(0x04)
	float CharacterCentreOffset; // 0x74(0x04)
	char WaterDepthTraceQueryType; // 0x78(0x01)
	char UnknownData_79[0x3]; // 0x79(0x03)
	struct FAthenaCharacterSwimSpeed SurfaceSwimSpeeds; // 0x7c(0x0c)
	struct FAthenaCharacterSwimSpeed UnderwaterSwimSpeeds; // 0x88(0x0c)
	float SurfaceSwimmingDepthWhenEnteredWater; // 0x94(0x04)
	char UnknownData_98[0x4]; // 0x98(0x04)
};

// ScriptStruct Athena.AthenaCharacterSwimSpeed
// Size: 0x0c (Inherited: 0x00)
struct FAthenaCharacterSwimSpeed {
	float SprintSpdAmp; // 0x00(0x04)
	float SprintAccelAmp; // 0x04(0x04)
	float TurnSpeedScalar; // 0x08(0x04)
};

// ScriptStruct Athena.AthenaCharacterDodgeParams
// Size: 0x10 (Inherited: 0x00)
struct FAthenaCharacterDodgeParams {
	float DodgeCooldown; // 0x00(0x04)
	float DodgeForce; // 0x04(0x04)
	float GroundLaunchAngle; // 0x08(0x04)
	bool DodgePerpendicularToGround; // 0x0c(0x01)
	bool Disabled; // 0x0d(0x01)
	char UnknownData_E[0x2]; // 0x0e(0x02)
};

// ScriptStruct Athena.NetPositionErrorTolerance
// Size: 0x08 (Inherited: 0x00)
struct FNetPositionErrorTolerance {
	float ZDistance; // 0x00(0x04)
	float XYDistance; // 0x04(0x04)
};

// ScriptStruct Athena.AthenaAnimationOverrideEntry
// Size: 0x48 (Inherited: 0x00)
struct FAthenaAnimationOverrideEntry {
	struct FName Name; // 0x00(0x08)
	struct FStringAssetReference MeshFirstPerson; // 0x08(0x10)
	struct FStringAssetReference MeshThirdPerson; // 0x18(0x10)
	struct FStringAssetReference AnimationDataStore; // 0x28(0x10)
	struct UClass* ALKFirstPerson; // 0x38(0x08)
	struct UClass* ALKThirdPerson; // 0x40(0x08)
};

// ScriptStruct Athena.PlayModeLevelArray
// Size: 0x20 (Inherited: 0x00)
struct FPlayModeLevelArray {
	struct TArray<struct FStringAssetReference> PlayModeLevels; // 0x00(0x10)
	struct TArray<struct FSubModeLevel> SubModes; // 0x10(0x10)
};

// ScriptStruct Athena.SubModeLevel
// Size: 0x20 (Inherited: 0x00)
struct FSubModeLevel {
	struct FString SubMode; // 0x00(0x10)
	struct FStringAssetReference Level; // 0x10(0x10)
};

// ScriptStruct Athena.FirstInteractableTelemetryEvent
// Size: 0x18 (Inherited: 0x00)
struct FFirstInteractableTelemetryEvent {
	float StartTime; // 0x00(0x04)
	float FirstSpinnerShownTime; // 0x04(0x04)
	float StartEntryLevelLoadTime; // 0x08(0x04)
	float StartLegalSplashTime; // 0x0c(0x04)
	float EndLegalSplashTime; // 0x10(0x04)
	float FirstInteractableTime; // 0x14(0x04)
};

// ScriptStruct Athena.LoadingTelemetryEvent
// Size: 0x28 (Inherited: 0x00)
struct FLoadingTelemetryEvent {
	struct FString LoadingEvent; // 0x00(0x10)
	struct FString MapName; // 0x10(0x10)
	float StartTime; // 0x20(0x04)
	float EndTime; // 0x24(0x04)
};

// ScriptStruct Athena.StorageContainerRefresher
// Size: 0xf8 (Inherited: 0x00)
struct FStorageContainerRefresher {
	char UnknownData_0[0xf8]; // 0x00(0xf8)
};

// ScriptStruct Athena.OnlineAthenaGameModeConfigurationSettings
// Size: 0x18 (Inherited: 0x00)
struct FOnlineAthenaGameModeConfigurationSettings {
	struct FTimespan PreLoginEntitlementQueryTimeout; // 0x00(0x08)
	struct FTimespan PreLoginPirateValidationTimeout; // 0x08(0x08)
	bool ConfigAllowCrossWorld; // 0x10(0x01)
	char UnknownData_11[0x7]; // 0x11(0x07)
};

// ScriptStruct Athena.ServerLifetimeConfigurationSettings
// Size: 0x0c (Inherited: 0x00)
struct FServerLifetimeConfigurationSettings {
	float ServerTimeToLiveSeconds; // 0x00(0x04)
	float HeartbeatFrequencySeconds; // 0x04(0x04)
	float MaxTimeToAcceptShutdownRequestSeconds; // 0x08(0x04)
};

// ScriptStruct Athena.ServerTelemetryConfigurationSettings
// Size: 0x10 (Inherited: 0x00)
struct FServerTelemetryConfigurationSettings {
	float PlayerHeartbeatInterval; // 0x00(0x04)
	bool TelemetryEnabled_ItemEquip; // 0x04(0x01)
	bool TelemetryEnabled_ItemUsageEnd; // 0x05(0x01)
	bool TelemetryEnabled_ItemUsageStart; // 0x06(0x01)
	bool TelemetryEnabled_ObjectUsageEnd; // 0x07(0x01)
	bool TelemetryEnabled_ObjectUsageStart; // 0x08(0x01)
	bool TelemetryEnabled_PlayerAction; // 0x09(0x01)
	bool TelemetryEnabled_PlayerChangedLoadout; // 0x0a(0x01)
	bool TelemetryEnabled_PlayerChangedShipLoadout; // 0x0b(0x01)
	bool TelemetryEnabled_PlayerHeartbeat; // 0x0c(0x01)
	bool TelemetryEnabled_PlayerPerformedEmote; // 0x0d(0x01)
	char UnknownData_E[0x2]; // 0x0e(0x02)
};

// ScriptStruct Athena.DebugReplicatedAbilityData
// Size: 0x20 (Inherited: 0x00)
struct FDebugReplicatedAbilityData {
	struct FAIAbilityDebugReplicatedIntervals AbilityIntervals; // 0x00(0x0c)
	char UnknownData_C[0x4]; // 0x0c(0x04)
	struct UClass* TypeClass; // 0x10(0x08)
	bool AbilityInRange; // 0x18(0x01)
	bool AbilityDebugBlocked; // 0x19(0x01)
	bool UseTimerBetween; // 0x1a(0x01)
	bool UseDamageBetween; // 0x1b(0x01)
	char DamageIntervalBlockMode; // 0x1c(0x01)
	char UnknownData_1D[0x3]; // 0x1d(0x03)
};

// ScriptStruct Athena.MakeFriendsEmoteParams
// Size: 0x18 (Inherited: 0x00)
struct FMakeFriendsEmoteParams {
	struct TArray<struct FName> TriggerEmoteNames; // 0x00(0x10)
	float TriggerDistanceThreshold; // 0x10(0x04)
	char UnknownData_14[0x4]; // 0x14(0x04)
};

// ScriptStruct Athena.CharacterSocketCollisionServiceParams
// Size: 0x08 (Inherited: 0x00)
struct FCharacterSocketCollisionServiceParams {
	float MaxCharacterDistanceSqr; // 0x00(0x04)
	int32_t MaxSockets; // 0x04(0x04)
};

// ScriptStruct Athena.MermaidRespawnConfig
// Size: 0x28 (Inherited: 0x00)
struct FMermaidRespawnConfig {
	float ScorePenaltyForEachMeterAwayFromShipwreck; // 0x00(0x04)
	float MinRespawnLocDistanceFromSunkShip; // 0x04(0x04)
	float MinScorePenaltyForEnemyShipProximity; // 0x08(0x04)
	float MaxScorePenaltyForEnemyShipProximity; // 0x0c(0x04)
	float MaxDistanceFromEnemyShipToApplyPenalty; // 0x10(0x04)
	float MinScorePenaltyForAlliedShipProximity; // 0x14(0x04)
	float MaxScorePenaltyForAlliedShipProximity; // 0x18(0x04)
	float MaxDistanceFromAlliedShipToApplyPenalty; // 0x1c(0x04)
	float MaxDistanceFromIslandWeHaveMapForToApplyPenalty; // 0x20(0x04)
	float ScorePenaltyForIslandsWeHaveMapFor; // 0x24(0x04)
};

// ScriptStruct Athena.DigSurfaceTypeParams
// Size: 0x38 (Inherited: 0x00)
struct FDigSurfaceTypeParams {
	char SurfaceType; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct FDigEventFxParams EnterGroundFx; // 0x08(0x18)
	struct FDigEventFxParams LeaveGroundFx; // 0x20(0x18)
};

// ScriptStruct Athena.DigEventFxParams
// Size: 0x18 (Inherited: 0x00)
struct FDigEventFxParams {
	struct UObject* Particles; // 0x00(0x08)
	bool bAttachParticlesToShovel; // 0x08(0x01)
	char UnknownData_9[0x7]; // 0x09(0x07)
	struct UForceFeedbackEffect* Rumble; // 0x10(0x08)
};

// ScriptStruct Athena.SurfaceDigHole
// Size: 0x18 (Inherited: 0x00)
struct FSurfaceDigHole {
	char SurfaceType; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct UClass* DigHoleClass; // 0x08(0x08)
	float DigAINoiseRange; // 0x10(0x04)
	char UnknownData_14[0x4]; // 0x14(0x04)
};

// ScriptStruct Athena.SharedShovelParams
// Size: 0x60 (Inherited: 0x00)
struct FSharedShovelParams {
	struct FShovelSurfaceDigType DigSurfaceDigType; // 0x00(0x10)
	char SandSurfaceType; // 0x10(0x01)
	char WetSandSurfaceType; // 0x11(0x01)
	char UnknownData_12[0x2]; // 0x12(0x02)
	float MaxHeightDifferenceToNotBeConsideredWetSand; // 0x14(0x04)
	struct FVector DigPosOffsetFromPlayerPos; // 0x18(0x0c)
	float SurfaceTypeRaycastLength; // 0x24(0x04)
	float MaxSurfaceAngleForDig; // 0x28(0x04)
	float InitialSphereCastRadiusForSuccessfulDig; // 0x2c(0x04)
	char ItemProxyCollisionChannel; // 0x30(0x01)
	char UnknownData_31[0x3]; // 0x31(0x03)
	float SphereRadiusForItemProxySweep; // 0x34(0x04)
	float RequiredObstacleFreeRadiusForSuccessfulDig; // 0x38(0x04)
	float ObstacleCheckStartOffsetZFromSphereTestPos; // 0x3c(0x04)
	int32_t NumSamplesForBlockingSurfacesTest; // 0x40(0x04)
	float MaxWaterDepthToStartSuccessfulDig; // 0x44(0x04)
	char HitTestTraceChannel; // 0x48(0x01)
	char UnknownData_49[0x3]; // 0x49(0x03)
	float MinPlanarTestRadius; // 0x4c(0x04)
	int32_t NumSamplesForPlanarityTest; // 0x50(0x04)
	float MaxBumpinessForPlanarityTestInCm; // 0x54(0x04)
	float AssumedPlayerWaistHeight; // 0x58(0x04)
	bool bDrawDebug; // 0x5c(0x01)
	char UnknownData_5D[0x3]; // 0x5d(0x03)
};

// ScriptStruct Athena.ShovelSurfaceDigType
// Size: 0x10 (Inherited: 0x00)
struct FShovelSurfaceDigType {
	struct TArray<struct FSurfaceDigType> SurfaceDigType; // 0x00(0x10)
};

// ScriptStruct Athena.SurfaceDigType
// Size: 0x02 (Inherited: 0x00)
struct FSurfaceDigType {
	char SurfaceType; // 0x00(0x01)
	char DigType; // 0x01(0x01)
};

// ScriptStruct Athena.CrewServiceParams
// Size: 0x70 (Inherited: 0x00)
struct FCrewServiceParams {
	float MinSafeDistanceToShip; // 0x00(0x04)
	float SpawnDistAroundSunkenShip; // 0x04(0x04)
	struct TArray<int32_t> VotesRequiredForSendToBrig; // 0x08(0x10)
	struct TArray<int32_t> VotesRequiredForReleaseFromBrig; // 0x18(0x10)
	struct TArray<int32_t> VotesRequiredForScuttleShip; // 0x28(0x10)
	struct TArray<int32_t> VotesRequiredForChangeMatchmakingVisibility; // 0x38(0x10)
	struct TArray<int32_t> VotesRequiredForArenaRivalVote; // 0x48(0x10)
	float BrigMinReleaseTime; // 0x58(0x04)
	float BrigServerTimeToRememberPastCrewMates; // 0x5c(0x04)
	float ScuttleInitialTimeoutTime; // 0x60(0x04)
	float ScuttleMultipleRequestTimeoutIncrement; // 0x64(0x04)
	float ScuttleMaxRequestTimeoutTime; // 0x68(0x04)
	char UnknownData_6C[0x4]; // 0x6c(0x04)
};

// ScriptStruct Athena.MermaidServiceParams
// Size: 0x88 (Inherited: 0x00)
struct FMermaidServiceParams {
	float LocallyActiveMermaidCheckInterval; // 0x00(0x04)
	float PlayerAbandonedCheckInterval; // 0x04(0x04)
	float MinDestroyDistancePlayerToMermaidIfPlayerNearEnemyShip; // 0x08(0x04)
	float MinDestroyDistancePlayerToMermaidIfPlayerNearIsland; // 0x0c(0x04)
	float MinDestroyDistancePlayerToMermaidIfPlayerNotNearIsland; // 0x10(0x04)
	float MaxDistFromCoastForPlayerToCountAsNearIsland; // 0x14(0x04)
	float MaxDistFromCoastForShipToCountAsNearIsland; // 0x18(0x04)
	float MinPlayerToShipDistForPlayerToQualifyAsAbandoned; // 0x1c(0x04)
	float MinPlayerToShipDistForPlayerToBeClearedOfAbandonedStatus; // 0x20(0x04)
	float MinPlayerToEnemyShipDistForPlayerToQualifyForStealthSpawns; // 0x24(0x04)
	float MinPlayerToWatercraftDistForPlayerToQualifyAsAbandoned; // 0x28(0x04)
	float MinDistFromAnyMermaidForPlayerToBeAbandonedIfPlayerNotNearIsland; // 0x2c(0x04)
	float MinDistFromAnyMermaidForPlayerToBeAbandonedIfPlayerNearIsland; // 0x30(0x04)
	int32_t MaxNumberOfConcurrentMermaids; // 0x34(0x04)
	float MinLifeTimeOfMermaidBeforeCanBeCulledInPopulationCheck; // 0x38(0x04)
	float SpawnDistAroundSaviourMermaid; // 0x3c(0x04)
	struct FMermaidServiceMermaidSpawnParams SpawnParams; // 0x40(0x48)
};

// ScriptStruct Athena.MermaidServiceMermaidSpawnParams
// Size: 0x48 (Inherited: 0x00)
struct FMermaidServiceMermaidSpawnParams {
	float MinDistFromSpawnOrigin; // 0x00(0x04)
	float MinDistFromSpawnOriginForDestroyedShip; // 0x04(0x04)
	float MaxDistFromSpawnOriginBeforeGivingUp; // 0x08(0x04)
	float DistIncrementPerFailedSpawnCircle; // 0x0c(0x04)
	int32_t NumSamplesInSpawnCircle; // 0x10(0x04)
	float SpawnCastStartZ; // 0x14(0x04)
	float MinSpawnDepth; // 0x18(0x04)
	float SpawnHalfConeAngleRestrictIfSpawningForPlayer; // 0x1c(0x04)
	char HitTestTraceChannel; // 0x20(0x01)
	char UnknownData_21[0x3]; // 0x21(0x03)
	float AssumedMermaidRadius; // 0x24(0x04)
	float MinDistanceOfFinalSpawnPosToAnyActiveMermaid; // 0x28(0x04)
	float MinDistanceOfFinalSpawnPosToAnyActiveMermaidWhenNearEnemyShip; // 0x2c(0x04)
	float MinDistFromEdgeOfWorld; // 0x30(0x04)
	float MinAngularStepSize; // 0x34(0x04)
	float MaxAngularStepSize; // 0x38(0x04)
	float MinDistanceIncrementPerFail; // 0x3c(0x04)
	float MaxDistanceIncrementPerFail; // 0x40(0x04)
	float AdditionalDistanceFromOriginMultiplierPerMeter; // 0x44(0x04)
};

// ScriptStruct Athena.PlayerModerationParams
// Size: 0x0c (Inherited: 0x00)
struct FPlayerModerationParams {
	float PlayerReportableDistance; // 0x00(0x04)
	float PlayerReportableTimeBetweenChecksInSeconds; // 0x04(0x04)
	float RemovePlayerFromListAfterSeconds; // 0x08(0x04)
};

// ScriptStruct Athena.ToggleableAIShipServiceDataAssetFileLocation
// Size: 0x18 (Inherited: 0x00)
struct FToggleableAIShipServiceDataAssetFileLocation {
	struct FName ToggleName; // 0x00(0x08)
	struct FStringAssetReference Location; // 0x08(0x10)
};

// ScriptStruct Athena.FirstPersonAnimaticActionStateConstructionInfo
// Size: 0x60 (Inherited: 0x30)
struct FFirstPersonAnimaticActionStateConstructionInfo : FActorActionStateConstructionInfo {
	struct FFirstPersonAnimaticSettings FirstPersonAnimaticSettings; // 0x30(0x2c)
	char UnknownData_5C[0x4]; // 0x5c(0x04)
};

// ScriptStruct Athena.FirstPersonAnimaticSettings
// Size: 0x2c (Inherited: 0x00)
struct FFirstPersonAnimaticSettings {
	struct FVector CutsceneFirstPersonMeshOffset; // 0x00(0x0c)
	struct FRotator CutsceneRotation; // 0x0c(0x0c)
	float TimeBeforeFadeIn; // 0x18(0x04)
	float FadeInDuration; // 0x1c(0x04)
	float FirstPersonMeshBoundsScale; // 0x20(0x04)
	struct FName FirstPersonAnimName; // 0x24(0x08)
};

// ScriptStruct Athena.CharacterAnimaticSettings
// Size: 0x58 (Inherited: 0x00)
struct FCharacterAnimaticSettings {
	char UnknownData_0[0x58]; // 0x00(0x58)
};

// ScriptStruct Athena.UIReturnedToPlayerEvent
// Size: 0x10 (Inherited: 0x10)
struct FUIReturnedToPlayerEvent : FNetworkEventStruct {
};

// ScriptStruct Athena.NetworkEventStruct
// Size: 0x10 (Inherited: 0x10)
struct FNetworkEventStruct : FBoxedRpc {
};

// ScriptStruct Athena.EventPlayerControllerKillNotification
// Size: 0x01 (Inherited: 0x00)
struct FEventPlayerControllerKillNotification {
	bool PlaySfx; // 0x00(0x01)
};

// ScriptStruct Athena.EventPlayerControllerHitNotification
// Size: 0x01 (Inherited: 0x00)
struct FEventPlayerControllerHitNotification {
	bool PlaySfx; // 0x00(0x01)
};

// ScriptStruct Athena.EventPlayerControllerHitNotificationOld
// Size: 0x01 (Inherited: 0x00)
struct FEventPlayerControllerHitNotificationOld {
	bool PlaySfx; // 0x00(0x01)
};

// ScriptStruct Athena.EventClientPlayerSpawnedBeforeGameState
// Size: 0x10 (Inherited: 0x10)
struct FEventClientPlayerSpawnedBeforeGameState : FNetworkEventStruct {
};

// ScriptStruct Athena.EventPlayerTeleportToSafety
// Size: 0x10 (Inherited: 0x10)
struct FEventPlayerTeleportToSafety : FNetworkEventStruct {
};

// ScriptStruct Athena.EventPlayerControllerUnPossess
// Size: 0x08 (Inherited: 0x00)
struct FEventPlayerControllerUnPossess {
	struct APawn* Pawn; // 0x00(0x08)
};

// ScriptStruct Athena.EventPlayerControllerPossess
// Size: 0x08 (Inherited: 0x00)
struct FEventPlayerControllerPossess {
	struct APawn* Pawn; // 0x00(0x08)
};

// ScriptStruct Athena.EventAthenaPlayerControllerEndingPlay
// Size: 0x08 (Inherited: 0x00)
struct FEventAthenaPlayerControllerEndingPlay {
	struct AAthenaPlayerController* Controller; // 0x00(0x08)
};

// ScriptStruct Athena.EventAthenaPlayerControllerBegunPlay
// Size: 0x08 (Inherited: 0x00)
struct FEventAthenaPlayerControllerBegunPlay {
	struct AAthenaPlayerController* Controller; // 0x00(0x08)
};

// ScriptStruct Athena.EventPlayerControllerDestroyedCalled
// Size: 0x08 (Inherited: 0x00)
struct FEventPlayerControllerDestroyedCalled {
	struct AAthenaPlayerController* Controller; // 0x00(0x08)
};

// ScriptStruct Athena.ContestTimerData
// Size: 0x18 (Inherited: 0x00)
struct FContestTimerData {
	float Time; // 0x00(0x04)
	char UnknownData_4[0x4]; // 0x04(0x04)
	struct FString ServicesConfigRetrievalString; // 0x08(0x10)
};

// ScriptStruct Athena.EmergentContestVoyageRecipe
// Size: 0x1c8 (Inherited: 0x150)
struct FEmergentContestVoyageRecipe : FVoyageRecipe {
	bool IsSharableVoyage; // 0x150(0x01)
	char UnknownData_151[0x7]; // 0x151(0x07)
	struct FContestZoneDistribution WeightedContestZonesToActivate; // 0x158(0x10)
	struct FContestTimerData ContestVoyageTime; // 0x168(0x18)
	struct FStringClassReference ScoreSystemToLoad; // 0x180(0x10)
	struct FText ContestArenaName; // 0x190(0x38)
};

// ScriptStruct Athena.VoyageRecipe
// Size: 0x150 (Inherited: 0x00)
struct FVoyageRecipe {
	struct FQuestDistributionParams QuestDistribution; // 0x00(0xc8)
	struct FQuestSelectionParams QuestSelection; // 0xc8(0x08)
	struct TArray<struct FQuestPoolParams> QuestPools; // 0xd0(0x10)
	bool UseFixedFinalQuestPool; // 0xe0(0x01)
	bool RandomiseChapters; // 0xe1(0x01)
	char UnknownData_E2[0x6]; // 0xe2(0x06)
	struct FQuestPoolParams FixedFinalQuestPool; // 0xe8(0x30)
	bool DoNotNotifyParticipantsOnVoyageComplete; // 0x118(0x01)
	bool DoNotNotifyParticipantsOnQuestsReceived; // 0x119(0x01)
	char UnknownData_11A[0x6]; // 0x11a(0x06)
	struct TArray<struct FPlayerStat> CompletionStats; // 0x120(0x10)
	struct TArray<struct FPlayerStat> ReapersMarkCompletionStats; // 0x130(0x10)
	struct TArray<struct FVoyageCompletionReward> VoyageCompletionRewards; // 0x140(0x10)
};

// ScriptStruct Athena.QuestPoolParams
// Size: 0x30 (Inherited: 0x00)
struct FQuestPoolParams {
	float Weight; // 0x00(0x04)
	char UnknownData_4[0x4]; // 0x04(0x04)
	struct TArray<struct FWeightedQuestParams> Quests; // 0x08(0x10)
	struct TArray<struct FWeightedVoyageLocationParams> Location; // 0x18(0x10)
	bool ChainLocations; // 0x28(0x01)
	bool AllowRepeatIslandsWithinQuest; // 0x29(0x01)
	bool LimitTimesCanBeSelected; // 0x2a(0x01)
	char UnknownData_2B[0x1]; // 0x2b(0x01)
	int32_t MaxTimesCanBeSelected; // 0x2c(0x04)
};

// ScriptStruct Athena.WeightedVoyageLocationParams
// Size: 0x18 (Inherited: 0x00)
struct FWeightedVoyageLocationParams {
	char Filter; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	float Weight; // 0x04(0x04)
	struct TArray<struct FVoyageLocationParams> Locations; // 0x08(0x10)
};

// ScriptStruct Athena.VoyageLocationParams
// Size: 0x58 (Inherited: 0x00)
struct FVoyageLocationParams {
	char Type; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	struct FVoyageLocationFixedParams Fixed; // 0x04(0x08)
	char UnknownData_C[0x4]; // 0x0c(0x04)
	struct FVoyageLocationRandomParams Random; // 0x10(0x48)
};

// ScriptStruct Athena.VoyageLocationRandomParams
// Size: 0x48 (Inherited: 0x00)
struct FVoyageLocationRandomParams {
	bool NPCsOnly; // 0x00(0x01)
	bool CargoRunNPCsOnly; // 0x01(0x01)
	bool Feature; // 0x02(0x01)
	bool Resource; // 0x03(0x01)
	bool Outpost; // 0x04(0x01)
	bool Fort; // 0x05(0x01)
	bool SeaPost; // 0x06(0x01)
	bool HasLandmarks; // 0x07(0x01)
	bool OnlyNamedIslands; // 0x08(0x01)
	char UnknownData_9[0x7]; // 0x09(0x07)
	struct UVoyageLocationOnlyNamedIslandListDataAsset* OnlyNamedIslandsListDataAsset; // 0x10(0x08)
	struct TArray<struct UClass*> Seas; // 0x18(0x10)
	bool WithinDistance; // 0x28(0x01)
	char UnknownData_29[0x3]; // 0x29(0x03)
	struct FVoyageLocationDistance Distance; // 0x2c(0x08)
	char UnknownData_34[0x14]; // 0x34(0x14)
};

// ScriptStruct Athena.VoyageLocationDistance
// Size: 0x08 (Inherited: 0x00)
struct FVoyageLocationDistance {
	float Min; // 0x00(0x04)
	float Max; // 0x04(0x04)
};

// ScriptStruct Athena.VoyageLocationFixedParams
// Size: 0x08 (Inherited: 0x00)
struct FVoyageLocationFixedParams {
	struct FName Name; // 0x00(0x08)
};

// ScriptStruct Athena.WeightedQuestParams
// Size: 0x460 (Inherited: 0x00)
struct FWeightedQuestParams {
	struct TArray<char> LocationFilters; // 0x00(0x10)
	float Weight; // 0x10(0x04)
	char UnknownData_14[0x4]; // 0x14(0x04)
	struct FQuestParams Params; // 0x18(0x448)
};

// ScriptStruct Athena.QuestParams
// Size: 0x448 (Inherited: 0x00)
struct FQuestParams {
	char Type; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct FXMarksTheSpotQuestParams XMarksTheSpot; // 0x08(0x88)
	struct FRiddleQuestParams Riddle; // 0x90(0x40)
	struct FBountyQuestParams Bounty; // 0xd0(0x180)
	struct FMerchantQuestParams Merchant; // 0x250(0xd8)
	struct FCargoRunQuestParams CargoRun; // 0x328(0xc8)
	struct FTaleQuestParams Tale; // 0x3f0(0x50)
	struct FMatchmakingQuestParams Matchmake; // 0x440(0x01)
	struct FStagingQuestParams Staging; // 0x441(0x01)
	struct FEmergantVoyageQuestParams EmergantVoyage; // 0x442(0x01)
	struct FRewardQuestParams Reward; // 0x443(0x01)
	char UnknownData_444[0x4]; // 0x444(0x04)
};

// ScriptStruct Athena.RewardQuestParams
// Size: 0x01 (Inherited: 0x00)
struct FRewardQuestParams {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EmergantVoyageQuestParams
// Size: 0x01 (Inherited: 0x00)
struct FEmergantVoyageQuestParams {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.StagingQuestParams
// Size: 0x01 (Inherited: 0x00)
struct FStagingQuestParams {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.MatchmakingQuestParams
// Size: 0x01 (Inherited: 0x00)
struct FMatchmakingQuestParams {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.TaleQuestParams
// Size: 0x50 (Inherited: 0x30)
struct FTaleQuestParams : FQuestTypeParams {
	struct UQuestDescDataAsset* TaleQuestAsset; // 0x30(0x20)
};

// ScriptStruct Athena.QuestTypeParams
// Size: 0x30 (Inherited: 0x00)
struct FQuestTypeParams {
	char UnknownData_0[0x8]; // 0x00(0x08)
	struct UWeightedTreasureChestDescAsset* ReferencedRewards; // 0x08(0x08)
	struct TArray<struct FWeightedTreasureChestDesc> Rewards; // 0x10(0x10)
	struct UWeightedItemDescSpawnDataAsset* RewardsAsset; // 0x20(0x08)
	struct UClass* OverrideTreasureMapItemDesc; // 0x28(0x08)
};

// ScriptStruct Athena.WeightedTreasureChestDesc
// Size: 0x18 (Inherited: 0x00)
struct FWeightedTreasureChestDesc {
	float Weight; // 0x00(0x04)
	struct FName Feature; // 0x04(0x08)
	char UnknownData_C[0x4]; // 0x0c(0x04)
	struct UClass* Desc; // 0x10(0x08)
};

// ScriptStruct Athena.CargoRunQuestParams
// Size: 0xc8 (Inherited: 0x30)
struct FCargoRunQuestParams : FQuestTypeParams {
	bool IsCargoRunQuestV2; // 0x30(0x01)
	char UnknownData_31[0x7]; // 0x31(0x07)
	struct FWeightedProbabilityRange NumberOfRequiredItems; // 0x38(0x20)
	struct FWeightedProbabilityRangeOfRanges TimeLimitInMinutes; // 0x58(0x30)
	struct UCargoRunQuestRandomRequiredItemsDataAsset* RequiredItemsDataAsset; // 0x88(0x08)
	struct UCargoRunQuestRandomRequiredItemsDataAsset* GroupedRequiredItemsDataAsset; // 0x90(0x08)
	struct FWeightedProbabilityRange NumberOfGroups; // 0x98(0x20)
	struct TArray<struct FCargoRunQuestCategoryGroupBounds> CategoryGroupBounds; // 0xb8(0x10)
};

// ScriptStruct Athena.CargoRunQuestCategoryGroupBounds
// Size: 0x1c (Inherited: 0x00)
struct FCargoRunQuestCategoryGroupBounds {
	struct FName GroupName; // 0x00(0x08)
	float Weight; // 0x08(0x04)
	int32_t MinNum; // 0x0c(0x04)
	int32_t MaxNum; // 0x10(0x04)
	int32_t MinDifferent; // 0x14(0x04)
	int32_t MaxDifferent; // 0x18(0x04)
};

// ScriptStruct Athena.MerchantQuestParams
// Size: 0xd8 (Inherited: 0x30)
struct FMerchantQuestParams : FQuestTypeParams {
	bool IsMerchantQuestV2; // 0x30(0x01)
	char UnknownData_31[0x7]; // 0x31(0x07)
	struct TArray<char> IslandTypes; // 0x38(0x10)
	struct FWeightedProbabilityRange NumberOfRequiredItems; // 0x48(0x20)
	struct FWeightedProbabilityRangeOfRanges TimeLimitInMinutes; // 0x68(0x30)
	struct UMerchantQuestRequiredItemsDataAsset* RequiredItemsDataAsset; // 0x98(0x08)
	struct UMerchantQuestRandomRequiredItemsDataAsset* RandomRequiredItemsDataAsset; // 0xa0(0x08)
	struct FWeightedProbabilityRange NumberOfGroups; // 0xa8(0x20)
	struct TArray<struct FMerchantQuestCategoryGroupBounds> CategoryGroupBounds; // 0xc8(0x10)
};

// ScriptStruct Athena.MerchantQuestCategoryGroupBounds
// Size: 0x1c (Inherited: 0x00)
struct FMerchantQuestCategoryGroupBounds {
	struct FName GroupName; // 0x00(0x08)
	float Weight; // 0x08(0x04)
	int32_t MinNum; // 0x0c(0x04)
	int32_t MaxNum; // 0x10(0x04)
	int32_t MinDifferent; // 0x14(0x04)
	int32_t MaxDifferent; // 0x18(0x04)
};

// ScriptStruct Athena.BountyQuestParams
// Size: 0x180 (Inherited: 0x30)
struct FBountyQuestParams : FQuestTypeParams {
	struct UAIBountySpawner* Spawner; // 0x30(0x08)
	struct FBountyQuestRandomSpawnGeneratorParams BountyQuestRandomSpawnGeneratorParams; // 0x38(0x148)
};

// ScriptStruct Athena.BountyQuestRandomSpawnGeneratorParams
// Size: 0x148 (Inherited: 0x00)
struct FBountyQuestRandomSpawnGeneratorParams {
	struct FWeightedProbabilityRange NumberOfWaves; // 0x00(0x20)
	struct FWeightedProbabilityRange NumberOfWaveGroups; // 0x20(0x20)
	int32_t MinNumberOfAIPerWave; // 0x40(0x04)
	int32_t MaxNumberOfAIPerWave; // 0x44(0x04)
	struct TArray<int32_t> AdditionalAIPerPlayer; // 0x48(0x10)
	int32_t MinFormsPerEncounter; // 0x58(0x04)
	int32_t MaxFormsPerEncounter; // 0x5c(0x04)
	bool AllowMultipleFormsPerWave; // 0x60(0x01)
	char UnknownData_61[0x7]; // 0x61(0x07)
	struct FWeightedProbabilityRange FormsPerWave; // 0x68(0x20)
	int32_t MinVarietiesPerEncounter; // 0x88(0x04)
	int32_t MaxVarietiesPerEncounter; // 0x8c(0x04)
	float MinTimeBetweenSpawns; // 0x90(0x04)
	float MaxTimeBetweenSpawns; // 0x94(0x04)
	float MinTimeBetweenWaves; // 0x98(0x04)
	float MaxTimeBetweenWaves; // 0x9c(0x04)
	struct FWeightedProbabilityRange WavesPerRelocate; // 0xa0(0x20)
	struct FWeightedProbabilityRange WaveSplitChance; // 0xc0(0x20)
	struct TArray<float> WaveSuicideTime; // 0xe0(0x10)
	float WaveSuicideMinDist; // 0xf0(0x04)
	char UnknownData_F4[0x4]; // 0xf4(0x04)
	struct UAIEncounterGenerationRecipeRankOrderList* Recipes; // 0xf8(0x08)
	struct FWeightedProbabilityRange NumberOfTargetsTotal; // 0x100(0x20)
	struct FWeightedProbabilityRange NumberOfTargetsWhichAreCaptains; // 0x120(0x20)
	float ChanceOfAllTargetsBeingOnTheLastWave; // 0x140(0x04)
	float ChanceOfFemale; // 0x144(0x04)
};

// ScriptStruct Athena.RiddleQuestParams
// Size: 0x40 (Inherited: 0x30)
struct FRiddleQuestParams : FQuestTypeParams {
	uint32_t MinNumGates; // 0x30(0x04)
	uint32_t MaxNumGates; // 0x34(0x04)
	struct UBoobyTrapSpawnerDataAsset* BoobyTrapSpawnerDataAsset; // 0x38(0x08)
};

// ScriptStruct Athena.XMarksTheSpotQuestParams
// Size: 0x88 (Inherited: 0x30)
struct FXMarksTheSpotQuestParams : FQuestTypeParams {
	struct FWeightedProbabilityRange NumTreasureLocations; // 0x30(0x20)
	struct UBoobyTrapSpawnerDataAsset* BoobyTrapSpawnerDataAsset; // 0x50(0x08)
	struct TArray<struct UBoobyTrapSpawnerDataAsset*> UniqueTreasureLocationBoobyTraps; // 0x58(0x10)
	struct TArray<struct UWeightedTreasureChestDescAsset*> UniqueTreasureLocationRewards; // 0x68(0x10)
	struct TArray<struct UWeightedItemDescSpawnDataAsset*> UniqueTreasureLocationRewardsAssets; // 0x78(0x10)
};

// ScriptStruct Athena.QuestSelectionParams
// Size: 0x08 (Inherited: 0x00)
struct FQuestSelectionParams {
	char PoolSelectionMethod; // 0x00(0x01)
	char LocationSelectionMethod; // 0x01(0x01)
	bool UseChapterBasedVoyageHistory; // 0x02(0x01)
	char UnknownData_3[0x1]; // 0x03(0x01)
	int32_t MaxNumberOfPoolRetries; // 0x04(0x04)
};

// ScriptStruct Athena.QuestDistributionParams
// Size: 0xc8 (Inherited: 0x00)
struct FQuestDistributionParams {
	char Method; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct FQuestDistributionAllAtOnceParams AllAtOnce; // 0x08(0x40)
	struct FQuestDistributionPerChapterParams PerChapter; // 0x48(0x68)
	struct FQuestDistributionFixedChaptersParams FixedChapters; // 0xb0(0x18)
};

// ScriptStruct Athena.QuestDistributionFixedChaptersParams
// Size: 0x18 (Inherited: 0x00)
struct FQuestDistributionFixedChaptersParams {
	bool UseProceduralQuestRewards; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	int32_t NumChapters; // 0x04(0x04)
	struct TArray<struct FChapterDataEntry> Chapters; // 0x08(0x10)
};

// ScriptStruct Athena.ChapterDataEntry
// Size: 0x10 (Inherited: 0x00)
struct FChapterDataEntry {
	int32_t NumQuests; // 0x00(0x04)
	char UnknownData_4[0x4]; // 0x04(0x04)
	struct UVoyageRewardDataAsset* PerChapterRewardAsset; // 0x08(0x08)
};

// ScriptStruct Athena.QuestDistributionPerChapterParams
// Size: 0x68 (Inherited: 0x00)
struct FQuestDistributionPerChapterParams {
	int32_t MinNumChapters; // 0x00(0x04)
	char UnknownData_4[0x4]; // 0x04(0x04)
	struct FWeightedProbabilityRange NumQuests; // 0x08(0x20)
	struct FWeightedProbabilityRange NumQuestsInFirstChapter; // 0x28(0x20)
	struct FWeightedProbabilityRange NumQuestsInOtherChapters; // 0x48(0x20)
};

// ScriptStruct Athena.QuestDistributionAllAtOnceParams
// Size: 0x40 (Inherited: 0x00)
struct FQuestDistributionAllAtOnceParams {
	struct FWeightedProbabilityRange NumQuests; // 0x00(0x20)
	struct FWeightedProbabilityRange QuestsPerChapter; // 0x20(0x20)
};

// ScriptStruct Athena.ContestZoneDistribution
// Size: 0x10 (Inherited: 0x00)
struct FContestZoneDistribution {
	struct TArray<struct FWeightedContestZone> WeightedContestZones; // 0x00(0x10)
};

// ScriptStruct Athena.WeightedContestZone
// Size: 0x0c (Inherited: 0x00)
struct FWeightedContestZone {
	struct FName ContestZoneName; // 0x00(0x08)
	int32_t Weight; // 0x08(0x04)
};

// ScriptStruct Athena.ContestIslandArchetype
// Size: 0x10 (Inherited: 0x00)
struct FContestIslandArchetype {
	struct TArray<struct FWeightedContestIslandData> AvailableIslands; // 0x00(0x10)
};

// ScriptStruct Athena.WeightedContestIslandData
// Size: 0x10 (Inherited: 0x00)
struct FWeightedContestIslandData {
	struct FContestVoyageIslandData IslandData; // 0x00(0x0c)
	int32_t WeightedChance; // 0x0c(0x04)
};

// ScriptStruct Athena.ContestVoyageIslandData
// Size: 0x0c (Inherited: 0x00)
struct FContestVoyageIslandData {
	struct FName IslandName; // 0x00(0x08)
	int32_t MaxItemCountForIsland; // 0x08(0x04)
};

// ScriptStruct Athena.EventCharacterHitReaction
// Size: 0x58 (Inherited: 0x00)
struct FEventCharacterHitReaction {
	struct FImpactDamageEvent ImpactDamage; // 0x00(0x58)
};

// ScriptStruct Athena.EventPlayerCharacterPuzzleVaultIncorrect
// Size: 0x01 (Inherited: 0x00)
struct FEventPlayerCharacterPuzzleVaultIncorrect {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EventPlayerCharacterPuzzleVaultComplete
// Size: 0x01 (Inherited: 0x00)
struct FEventPlayerCharacterPuzzleVaultComplete {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EventPlayerCharacterInPuzzleVaultChanged
// Size: 0x08 (Inherited: 0x00)
struct FEventPlayerCharacterInPuzzleVaultChanged {
	bool IsInPuzzleVault; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	float CurrentWaterLevel; // 0x04(0x04)
};

// ScriptStruct Athena.EventItemUseAINoiseEvent
// Size: 0x0c (Inherited: 0x00)
struct FEventItemUseAINoiseEvent {
	float NoiseRange; // 0x00(0x04)
	struct FName NoiseTag; // 0x04(0x08)
};

// ScriptStruct Athena.EventAnimationShopInteraction
// Size: 0x10 (Inherited: 0x00)
struct FEventAnimationShopInteraction {
	bool Active; // 0x00(0x01)
	char Type; // 0x01(0x01)
	char UnknownData_2[0x6]; // 0x02(0x06)
	struct AActor* Interactor; // 0x08(0x08)
};

// ScriptStruct Athena.EventFaceTargetEnabled
// Size: 0x01 (Inherited: 0x00)
struct FEventFaceTargetEnabled {
	bool Enabled; // 0x00(0x01)
};

// ScriptStruct Athena.EventRemoteCharacterStartedDig
// Size: 0x01 (Inherited: 0x00)
struct FEventRemoteCharacterStartedDig {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EventRequestVomit
// Size: 0x0c (Inherited: 0x00)
struct FEventRequestVomit {
	char UnknownData_0[0xc]; // 0x00(0x0c)
};

// ScriptStruct Athena.EventIsDrunk
// Size: 0x01 (Inherited: 0x00)
struct FEventIsDrunk {
	bool bIsDrunk; // 0x00(0x01)
};

// ScriptStruct Athena.EventFallWithDamageLegNotBroken
// Size: 0x08 (Inherited: 0x00)
struct FEventFallWithDamageLegNotBroken {
	struct FName RumbleTag; // 0x00(0x08)
};

// ScriptStruct Athena.EventHealedLeg
// Size: 0x01 (Inherited: 0x00)
struct FEventHealedLeg {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EventBrokeLeg
// Size: 0x08 (Inherited: 0x00)
struct FEventBrokeLeg {
	struct FName RumbleTag; // 0x00(0x08)
};

// ScriptStruct Athena.EventPlayerGhostShipWhiteOutStarted
// Size: 0x01 (Inherited: 0x00)
struct FEventPlayerGhostShipWhiteOutStarted {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EventCharacterRestarted
// Size: 0x01 (Inherited: 0x00)
struct FEventCharacterRestarted {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EventCharacterLanded
// Size: 0x84 (Inherited: 0x00)
struct FEventCharacterLanded {
	struct FHitResult HitResult; // 0x00(0x80)
	float VerticalSpeed; // 0x80(0x04)
};

// ScriptStruct Athena.EventCharacterJumped
// Size: 0x01 (Inherited: 0x00)
struct FEventCharacterJumped {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EventCharacterDestroyed
// Size: 0x01 (Inherited: 0x00)
struct FEventCharacterDestroyed {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EventCharacterInteraction
// Size: 0x08 (Inherited: 0x00)
struct FEventCharacterInteraction {
	struct UObject* Interactable; // 0x00(0x08)
};

// ScriptStruct Athena.ClientTelemetryConfigurationSettings
// Size: 0x1c (Inherited: 0x00)
struct FClientTelemetryConfigurationSettings {
	float HighMemoryPerformanceHeartbeatIntervalSeconds; // 0x00(0x04)
	float HighMemoryThresholdDurango; // 0x04(0x04)
	float HighMemoryThresholdEdmonton; // 0x08(0x04)
	float HighMemoryThresholdScorpio; // 0x0c(0x04)
	float HighMemoryThresholdLockhart; // 0x10(0x04)
	float HighMemoryThresholdAnaconda; // 0x14(0x04)
	float PlayerAggregatePositionInterval; // 0x18(0x04)
};

// ScriptStruct Athena.UISlatePerformanceTelemetryFragment
// Size: 0x04 (Inherited: 0x00)
struct FUISlatePerformanceTelemetryFragment {
	uint32_t NumAtlasPages; // 0x00(0x04)
};

// ScriptStruct Athena.ResolutionTelemetryFragment
// Size: 0x10 (Inherited: 0x00)
struct FResolutionTelemetryFragment {
	uint32_t ResolutionWidth; // 0x00(0x04)
	uint32_t ResolutionHeight; // 0x04(0x04)
	float ScreenPercentage; // 0x08(0x04)
	bool DynamicResolution; // 0x0c(0x01)
	char UnknownData_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct Athena.ShippingStatsTelemetryFragment
// Size: 0x18 (Inherited: 0x00)
struct FShippingStatsTelemetryFragment {
	struct FJsonObjectWrapper Json; // 0x00(0x18)
};

// ScriptStruct Athena.AudioDataTelemetryFragment
// Size: 0xe0 (Inherited: 0x00)
struct FAudioDataTelemetryFragment {
	uint32_t WwiseDefaultPoolMemoryUsage; // 0x00(0x04)
	uint32_t WwiseTotalMemoryUsage; // 0x04(0x04)
	uint32_t APUHeapFreeBytes; // 0x08(0x04)
	uint32_t WwiseTotalMediaMemoryUsage; // 0x0c(0x04)
	uint32_t TritonMemoryUsage; // 0x10(0x04)
	int8_t WwiseKWeightedOutput; // 0x14(0x01)
	char UnknownData_15[0x3]; // 0x15(0x03)
	uint32_t OutputClippingCount; // 0x18(0x04)
	int8_t NonUIBusKWeightedOutput; // 0x1c(0x01)
	char UnknownData_1D[0x3]; // 0x1d(0x03)
	struct TArray<uint32_t> WwiseStateGroups; // 0x20(0x10)
	struct TArray<uint32_t> WwiseStateValues; // 0x30(0x10)
	struct TArray<uint32_t> PeakProxyCountsPools; // 0x40(0x10)
	struct TArray<uint32_t> PeakProxyCounts; // 0x50(0x10)
	struct TArray<uint32_t> StreamFindFailedIDs; // 0x60(0x10)
	struct TArray<uint32_t> StreamOpenFailedIDs; // 0x70(0x10)
	struct TArray<uint32_t> StreamReadFailedIDs; // 0x80(0x10)
	struct TArray<struct FSoundBankFailureTelemetryEntry> FailedToLoadBankIDs; // 0x90(0x10)
	uint32_t FailedPostEventCount; // 0xa0(0x04)
	uint32_t IODeviceMemUsage; // 0xa4(0x04)
	uint32_t PeakIOBytesRead; // 0xa8(0x04)
	float AverageIOBytesPerSecondRead; // 0xac(0x04)
	struct FFrameDurationDataTelemetryFragment FrameKickoffTimesInMs; // 0xb0(0x10)
	struct FFrameDurationDataTelemetryFragment UpdateDurationsInMs; // 0xc0(0x10)
	struct FFrameDurationDataTelemetryFragment TritonQueryAcousticsTimesInMs; // 0xd0(0x10)
};

// ScriptStruct Athena.FrameDurationDataTelemetryFragment
// Size: 0x10 (Inherited: 0x00)
struct FFrameDurationDataTelemetryFragment {
	float Min; // 0x00(0x04)
	float Max; // 0x04(0x04)
	float Average; // 0x08(0x04)
	float StdDeviation; // 0x0c(0x04)
};

// ScriptStruct Athena.SoundBankFailureTelemetryEntry
// Size: 0x08 (Inherited: 0x00)
struct FSoundBankFailureTelemetryEntry {
	uint32_t BankID; // 0x00(0x04)
	uint32_t FailureReason; // 0x04(0x04)
};

// ScriptStruct Athena.PlayFabPartyTelemetryFragment
// Size: 0x20 (Inherited: 0x00)
struct FPlayFabPartyTelemetryFragment {
	int64_t TotalMemoryUsed; // 0x00(0x08)
	uint32_t FailedPermissionsChecksCount; // 0x08(0x04)
	uint32_t RequestEntityIDsFromXUIDsFailedCount; // 0x0c(0x04)
	struct TArray<struct FPlayFabPartyNetworkStats> PerNetworkStats; // 0x10(0x10)
};

// ScriptStruct Athena.PlayFabPartyNetworkStats
// Size: 0x28 (Inherited: 0x00)
struct FPlayFabPartyNetworkStats {
	uint64_t PingTimeToRelayServerInMs; // 0x00(0x08)
	uint64_t SentPackets; // 0x08(0x08)
	uint64_t RetriedPackets; // 0x10(0x08)
	uint64_t DroppedPackets; // 0x18(0x08)
	uint64_t ReceivedPackets; // 0x20(0x08)
};

// ScriptStruct Athena.FrameTypeTelemetryFragment
// Size: 0x18 (Inherited: 0x00)
struct FFrameTypeTelemetryFragment {
	uint64_t NumLoadingScreenFrames; // 0x00(0x08)
	uint64_t NumFullyOccludedFrames; // 0x08(0x08)
	uint64_t NumFullScreenUIFrames; // 0x10(0x08)
};

// ScriptStruct Athena.RefreshRateTelemetryFragment
// Size: 0x08 (Inherited: 0x00)
struct FRefreshRateTelemetryFragment {
	bool Supports120Hz; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	uint32_t RefreshRate; // 0x04(0x04)
};

// ScriptStruct Athena.HDRTelemetryFragment
// Size: 0x01 (Inherited: 0x00)
struct FHDRTelemetryFragment {
	bool HDR; // 0x00(0x01)
};

// ScriptStruct Athena.UIFrameDurationDataTelemetryFragment
// Size: 0x10 (Inherited: 0x00)
struct FUIFrameDurationDataTelemetryFragment {
	float Min; // 0x00(0x04)
	float Max; // 0x04(0x04)
	float Average; // 0x08(0x04)
	float StdDeviation; // 0x0c(0x04)
};

// ScriptStruct Athena.GarbageCollectionFrametimeTelemetryFragment
// Size: 0x18 (Inherited: 0x00)
struct FGarbageCollectionFrametimeTelemetryFragment {
	struct TArray<float> GCFrametimesMs; // 0x00(0x10)
	float MaxGCFrametimeMs; // 0x10(0x04)
	char UnknownData_14[0x4]; // 0x14(0x04)
};

// ScriptStruct Athena.HitchDataTelemetryFragment
// Size: 0x20 (Inherited: 0x00)
struct FHitchDataTelemetryFragment {
	uint64_t NumLowSeverityHitches; // 0x00(0x08)
	uint64_t NumMediumSeverityHitches; // 0x08(0x08)
	uint64_t NumHighSeverityHitches; // 0x10(0x08)
	uint64_t NumHighestSeverityHitches; // 0x18(0x08)
};

// ScriptStruct Athena.StutterDataTelemetryFragment
// Size: 0x0c (Inherited: 0x00)
struct FStutterDataTelemetryFragment {
	float StutterFramePercentage; // 0x00(0x04)
	float StutterFrameDeltaMax; // 0x04(0x04)
	float StutterFrameDeltaAverage; // 0x08(0x04)
};

// ScriptStruct Athena.ServerNetworkDataTelemetryFragment
// Size: 0x20 (Inherited: 0x00)
struct FServerNetworkDataTelemetryFragment {
	struct FPacketDiscardStats DiscardedPackets; // 0x00(0x20)
};

// ScriptStruct Athena.NetworkDataTelemetryFragmentInput
// Size: 0x28 (Inherited: 0x01)
struct FNetworkDataTelemetryFragmentInput : FTelemetryFragmentInput {
	uint64_t AvgRttMilliseconds; // 0x00(0x08)
	uint64_t AvgOutBytesPerSecond; // 0x08(0x08)
	uint64_t AvgInBytesPerSecond; // 0x10(0x08)
	uint64_t AvgOutVoiceBytesPerSecond; // 0x18(0x08)
	uint64_t AvgInVoiceBytesPerSecond; // 0x20(0x08)
};

// ScriptStruct Athena.TelemetryFragmentInput
// Size: 0x01 (Inherited: 0x00)
struct FTelemetryFragmentInput {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.NetworkDataTelemetryFragment
// Size: 0x28 (Inherited: 0x00)
struct FNetworkDataTelemetryFragment {
	uint64_t AvgRttMilliseconds; // 0x00(0x08)
	uint64_t AvgOutBytesPerSecond; // 0x08(0x08)
	uint64_t AvgInBytesPerSecond; // 0x10(0x08)
	uint64_t AvgOutVoiceBytesPerSecond; // 0x18(0x08)
	uint64_t AvgInVoiceBytesPerSecond; // 0x20(0x08)
};

// ScriptStruct Athena.PerformanceTelemetryFragmentInput
// Size: 0x18 (Inherited: 0x01)
struct FPerformanceTelemetryFragmentInput : FTelemetryFragmentInput {
	char UnknownData_1[0x17]; // 0x01(0x17)
};

// ScriptStruct Athena.MemoryDataTelemetryFragment
// Size: 0x170 (Inherited: 0x00)
struct FMemoryDataTelemetryFragment {
	uint64_t MemAvailPhyAvg; // 0x00(0x08)
	uint64_t MemAvailPhyMin; // 0x08(0x08)
	uint64_t MemAvailPhyMax; // 0x10(0x08)
	uint64_t MemAvailVirAvg; // 0x18(0x08)
	uint64_t MemAvailVirMin; // 0x20(0x08)
	uint64_t MemAvailVirMax; // 0x28(0x08)
	uint64_t MemUsedPhyAvg; // 0x30(0x08)
	uint64_t MemUsedPhyMin; // 0x38(0x08)
	uint64_t MemUsedPhyMax; // 0x40(0x08)
	uint64_t MemUsedVirAvg; // 0x48(0x08)
	uint64_t MemUsedVirMin; // 0x50(0x08)
	uint64_t MemUsedVirMax; // 0x58(0x08)
	uint64_t MemAvailPhyUIAvg; // 0x60(0x08)
	uint64_t MemAvailPhyUIMin; // 0x68(0x08)
	uint64_t MemAvailPhyUIMax; // 0x70(0x08)
	uint64_t MemAvailVirUIAvg; // 0x78(0x08)
	uint64_t MemAvailVirUIMin; // 0x80(0x08)
	uint64_t MemAvailVirUIMax; // 0x88(0x08)
	uint64_t MemUsedPhyUIAvg; // 0x90(0x08)
	uint64_t MemUsedPhyUIMin; // 0x98(0x08)
	uint64_t MemUsedPhyUIMax; // 0xa0(0x08)
	uint64_t MemUsedVirUIAvg; // 0xa8(0x08)
	uint64_t MemUsedVirUIMin; // 0xb0(0x08)
	uint64_t MemUsedVirUIMax; // 0xb8(0x08)
	uint64_t MemUsedMallocCurrent; // 0xc0(0x08)
	uint64_t MemUsedMallocPeak; // 0xc8(0x08)
	struct TArray<struct FMemoryTableData> TableInfo; // 0xd0(0x10)
	uint64_t NumLargeAllocations; // 0xe0(0x08)
	uint64_t PeakLargeAllocations; // 0xe8(0x08)
	uint64_t MemUsedCachedPagesCurrent; // 0xf0(0x08)
	uint64_t MemUsedCachedPagesPeak; // 0xf8(0x08)
	uint64_t MemUsedAsyncLoadingRegularMax; // 0x100(0x08)
	uint64_t MemUsedAsyncLoadingOverflowMax; // 0x108(0x08)
	uint64_t MemUsedAsyncLoadingExtraOverflowMax; // 0x110(0x08)
	int32_t HighMemoryThresholdPercentage; // 0x118(0x04)
	char UnknownData_11C[0x4]; // 0x11c(0x04)
	uint64_t MemUsedTexturePoolAvg; // 0x120(0x08)
	uint64_t MemUsedTexturePoolMin; // 0x128(0x08)
	uint64_t MemUsedTexturePoolMax; // 0x130(0x08)
	uint64_t MemUsedTextureUnstreamedAvg; // 0x138(0x08)
	uint64_t MemUsedTextureUnstreamedMin; // 0x140(0x08)
	uint64_t MemUsedTextureUnstreamedMax; // 0x148(0x08)
	uint64_t MemUsedRenderTargetAvg; // 0x150(0x08)
	uint64_t MemUsedRenderTargetMin; // 0x158(0x08)
	uint64_t MemUsedRenderTargetMax; // 0x160(0x08)
	uint64_t NumActiveUObjects; // 0x168(0x08)
};

// ScriptStruct Athena.MemoryTableData
// Size: 0x18 (Inherited: 0x00)
struct FMemoryTableData {
	uint64_t BlockSize; // 0x00(0x08)
	uint64_t NumActivePools; // 0x08(0x08)
	uint64_t PeakActivePools; // 0x10(0x08)
};

// ScriptStruct Athena.InventoryMemory
// Size: 0x50 (Inherited: 0x00)
struct FInventoryMemory {
	struct TMap<struct UClass*, int32_t> LastEquippedIndexOfCategoryMap; // 0x00(0x50)
};

// ScriptStruct Athena.IslandEventIcons
// Size: 0x10 (Inherited: 0x00)
struct FIslandEventIcons {
	struct UTexture* ActiveEventIcon; // 0x00(0x08)
	struct UTexture* InactiveEventIcon; // 0x08(0x08)
};

// ScriptStruct Athena.CanvasWorldMapShipLocation
// Size: 0x58 (Inherited: 0x00)
struct FCanvasWorldMapShipLocation {
	struct FGuid CrewId; // 0x00(0x10)
	struct UClass* ShipSize; // 0x10(0x08)
	struct FVector2D Location; // 0x18(0x08)
	float Rotation; // 0x20(0x04)
	struct FCanvasLerpData LerpData; // 0x24(0x10)
	bool IsInAlliance; // 0x34(0x01)
	bool IsInFaction; // 0x35(0x01)
	bool IsFactionMaxRank; // 0x36(0x01)
	bool IsInvadingShip; // 0x37(0x01)
	struct FName CrewFactionName; // 0x38(0x08)
	char ReapersMarkLevel; // 0x40(0x01)
	char EmissaryLevel; // 0x41(0x01)
	bool IsContestShip; // 0x42(0x01)
	char UnknownData_43[0x5]; // 0x43(0x05)
	struct UTexture* CrewLiveryOverlayIcon; // 0x48(0x08)
	bool IsReapersTrackedShip; // 0x50(0x01)
	bool IsInTunnel; // 0x51(0x01)
	char UnknownData_52[0x6]; // 0x52(0x06)
};

// ScriptStruct Athena.CanvasLerpData
// Size: 0x10 (Inherited: 0x00)
struct FCanvasLerpData {
	float LerpTime; // 0x00(0x04)
	float EaseExponent; // 0x04(0x04)
	char UnknownData_8[0x8]; // 0x08(0x08)
};

// ScriptStruct Athena.CanvasWorldMapGeneric
// Size: 0x20 (Inherited: 0x00)
struct FCanvasWorldMapGeneric {
	struct AActor* MarkerActor; // 0x00(0x08)
	struct UTexture* Icon; // 0x08(0x08)
	struct FVector Location; // 0x10(0x0c)
	char UnknownData_1C[0x4]; // 0x1c(0x04)
};

// ScriptStruct Athena.CanvasWorldMapReaperTrackedBootItemIcon
// Size: 0x18 (Inherited: 0x00)
struct FCanvasWorldMapReaperTrackedBootItemIcon {
	char BootyItemType; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct UTexture* Texture; // 0x08(0x08)
	char UnknownData_10[0x8]; // 0x10(0x08)
};

// ScriptStruct Athena.CanvasWorldMapShipIcons
// Size: 0x18 (Inherited: 0x00)
struct FCanvasWorldMapShipIcons {
	struct UClass* ShipSize; // 0x00(0x08)
	struct UTexture* ShipTexture; // 0x08(0x08)
	struct UTexture* OffscreenTexture; // 0x10(0x08)
};

// ScriptStruct Athena.CanvasWorldMapWorldData
// Size: 0x20 (Inherited: 0x00)
struct FCanvasWorldMapWorldData {
	struct FVector2D Min; // 0x00(0x08)
	struct FVector2D Max; // 0x08(0x08)
	struct TArray<struct FCanvasWorldMapIslandData> Islands; // 0x10(0x10)
};

// ScriptStruct Athena.CanvasWorldMapIslandData
// Size: 0x60 (Inherited: 0x00)
struct FCanvasWorldMapIslandData {
	struct FText Name; // 0x00(0x38)
	struct UTexture* IslandTex; // 0x38(0x08)
	struct FBox2D Bounds; // 0x40(0x14)
	float Rotation; // 0x54(0x04)
	float LabelOffset; // 0x58(0x04)
	char UnknownData_5C[0x4]; // 0x5c(0x04)
};

// ScriptStruct Athena.MapTableCanvasDetails
// Size: 0x30 (Inherited: 0x00)
struct FMapTableCanvasDetails {
	struct TArray<struct FCanvasWorldMapBackgroundItems> BackgroundDetails; // 0x00(0x10)
	struct TArray<struct FCanvasWorldMapForegroundItems> ForegroundDetails; // 0x10(0x10)
	struct TArray<struct FCanvasWorldMapSeaAreaItems> SeaDetails; // 0x20(0x10)
};

// ScriptStruct Athena.CanvasWorldMapSeaAreaItems
// Size: 0x50 (Inherited: 0x00)
struct FCanvasWorldMapSeaAreaItems {
	struct UTexture* Texture; // 0x00(0x08)
	struct FText Name; // 0x08(0x38)
	struct FVector2D Location; // 0x40(0x08)
	struct FName FeatureName; // 0x48(0x08)
};

// ScriptStruct Athena.CanvasWorldMapForegroundItems
// Size: 0x20 (Inherited: 0x00)
struct FCanvasWorldMapForegroundItems {
	struct UTexture* Texture; // 0x00(0x08)
	struct FName FeatureToggle; // 0x08(0x08)
	struct TArray<struct FVector2D> Locations; // 0x10(0x10)
};

// ScriptStruct Athena.CanvasWorldMapBackgroundItems
// Size: 0x20 (Inherited: 0x00)
struct FCanvasWorldMapBackgroundItems {
	struct UTexture* Texture; // 0x00(0x08)
	struct FVector2D WorldSize; // 0x08(0x08)
	struct TArray<struct FVector2D> Locations; // 0x10(0x10)
};

// ScriptStruct Athena.VoyageProposalDescViewModel
// Size: 0x118 (Inherited: 0x100)
struct FVoyageProposalDescViewModel : FVoyageDisplayInformation {
	struct FString ProposalDesc; // 0x100(0x10)
	char State; // 0x110(0x01)
	char UnknownData_111[0x3]; // 0x111(0x03)
	int32_t VoyageIndex; // 0x114(0x04)
};

// ScriptStruct Athena.VoyageDisplayInformation
// Size: 0x100 (Inherited: 0x00)
struct FVoyageDisplayInformation {
	struct FText Title; // 0x00(0x38)
	struct FText Description; // 0x38(0x38)
	struct FText StateDescription; // 0x70(0x38)
	struct FString KeyArtUrl; // 0xa8(0x10)
	struct FString IconUrl; // 0xb8(0x10)
	int32_t RumouredHaulMin; // 0xc8(0x04)
	bool Locked; // 0xcc(0x01)
	char UnknownData_CD[0x3]; // 0xcd(0x03)
	struct FString Category; // 0xd0(0x10)
	struct FString PreviewImageUrl; // 0xe0(0x10)
	struct FString ThumbnailImageUrl; // 0xf0(0x10)
};

// ScriptStruct Athena.EventUpdateIslandEventToggle
// Size: 0x1c (Inherited: 0x00)
struct FEventUpdateIslandEventToggle {
	struct FGuid EventID; // 0x00(0x10)
	struct FVector2D EventScreenPos; // 0x10(0x08)
	bool IsInverted; // 0x18(0x01)
	char UnknownData_19[0x3]; // 0x19(0x03)
};

// ScriptStruct Athena.EventRefreshIslandEventData
// Size: 0x01 (Inherited: 0x00)
struct FEventRefreshIslandEventData {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EventUpdateIslandEventHighlight
// Size: 0x01 (Inherited: 0x00)
struct FEventUpdateIslandEventHighlight {
	bool IsHighlightActive; // 0x00(0x01)
};

// ScriptStruct Athena.IslandEventTooltipData
// Size: 0x110 (Inherited: 0x00)
struct FIslandEventTooltipData {
	struct FVoyageDisplayInformation DisplayInfo; // 0x00(0x100)
	struct FGuid EventID; // 0x100(0x10)
};

// ScriptStruct Athena.IslandEventIconData
// Size: 0x58 (Inherited: 0x00)
struct FIslandEventIconData {
	struct FIslandEventData EventData; // 0x00(0x38)
	struct FIslandEventIcons IslandIcons; // 0x38(0x10)
	struct FIslandEventIcons HeaderIcons; // 0x48(0x10)
};

// ScriptStruct Athena.IslandEventData
// Size: 0x38 (Inherited: 0x00)
struct FIslandEventData {
	struct UClass* EventType; // 0x00(0x08)
	struct FStringAssetReference VoyageDescAssetString; // 0x08(0x10)
	struct FVector2D WorldPos; // 0x18(0x08)
	bool IsActive; // 0x20(0x01)
	char UnknownData_21[0x3]; // 0x21(0x03)
	struct FGuid EventID; // 0x24(0x10)
	char UnknownData_34[0x4]; // 0x34(0x04)
};

// ScriptStruct Athena.IslandNameAndBounds
// Size: 0x1c (Inherited: 0x00)
struct FIslandNameAndBounds {
	struct FName IslandName; // 0x00(0x08)
	struct FBox2D IslandBounds; // 0x08(0x14)
};

// ScriptStruct Athena.EventIslandEventDataChanged
// Size: 0x01 (Inherited: 0x00)
struct FEventIslandEventDataChanged {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.WorldSafeZone
// Size: 0x18 (Inherited: 0x00)
struct FWorldSafeZone {
	char UnknownData_0[0x18]; // 0x00(0x18)
};

// ScriptStruct Athena.AthenaWorldSettingsGameEventSchedulerSettingsConfiguration
// Size: 0x18 (Inherited: 0x00)
struct FAthenaWorldSettingsGameEventSchedulerSettingsConfiguration {
	struct FName FeatureFlag; // 0x00(0x08)
	char RequiredPlayMode; // 0x08(0x01)
	char UnknownData_9[0x7]; // 0x09(0x07)
	struct UGameEventSchedulerSettingsAsset* EventSchedulerSettings; // 0x10(0x08)
};

// ScriptStruct Athena.HoopData
// Size: 0x18 (Inherited: 0x00)
struct FHoopData {
	float HoopRadius; // 0x00(0x04)
	char UnknownData_4[0x4]; // 0x04(0x04)
	struct TArray<struct FWwiseEventsIcon> EventIcons; // 0x08(0x10)
};

// ScriptStruct Athena.WwiseEventsIcon
// Size: 0x18 (Inherited: 0x00)
struct FWwiseEventsIcon {
	struct UTexture2D* IconTexture; // 0x00(0x08)
	struct TArray<struct UWwiseEvent*> WwiseEvents; // 0x08(0x10)
};

// ScriptStruct Athena.ActiveHudIconData
// Size: 0x20 (Inherited: 0x00)
struct FActiveHudIconData {
	char UnknownData_0[0x18]; // 0x00(0x18)
	struct UTexture2D* IconTexture; // 0x18(0x08)
};

// ScriptStruct Athena.DeferredBakedDecal
// Size: 0x38 (Inherited: 0x00)
struct FDeferredBakedDecal {
	char UnknownData_0[0x38]; // 0x00(0x38)
};

// ScriptStruct Athena.MerchantCrateItemInfoFaunaBreedRarityEntry
// Size: 0xc0 (Inherited: 0x00)
struct FMerchantCrateItemInfoFaunaBreedRarityEntry {
	struct UClass* FaunaBreed; // 0x00(0x08)
	struct FName Rarity; // 0x08(0x08)
	struct FBootyItemStats HandInStats; // 0x10(0x90)
	struct FCompanyBootyStatList CompanySpecificStats; // 0xa0(0x10)
	struct TArray<struct FCompanySpecificBootyReward> CompanySpecificHandInRewardIds; // 0xb0(0x10)
};

// ScriptStruct Athena.CompanySpecificBootyReward
// Size: 0x18 (Inherited: 0x00)
struct FCompanySpecificBootyReward {
	struct UClass* CompanyId; // 0x00(0x08)
	struct FRewardId RewardId; // 0x08(0x08)
	bool RequirePirateLegend; // 0x10(0x01)
	char UnknownData_11[0x7]; // 0x11(0x07)
};

// ScriptStruct Athena.CompanyBootyStatList
// Size: 0x10 (Inherited: 0x00)
struct FCompanyBootyStatList {
	struct TArray<struct FCompanyBootyStats> CompanyList; // 0x00(0x10)
};

// ScriptStruct Athena.CompanyBootyStats
// Size: 0x98 (Inherited: 0x00)
struct FCompanyBootyStats {
	struct UClass* CompanyId; // 0x00(0x08)
	struct FBootyItemStats Stats; // 0x08(0x90)
};

// ScriptStruct Athena.BootyItemStats
// Size: 0x90 (Inherited: 0x00)
struct FBootyItemStats {
	struct TArray<struct FPlayerStat> HandInPlayerStats; // 0x00(0x10)
	struct TArray<struct FPlayerStat> HandInStolenPlayerStats; // 0x10(0x10)
	struct TArray<struct FPlayerStat> HandInAsPirateLegendPlayerStats; // 0x20(0x10)
	struct TArray<struct FPlayerStat> HandInOnSchedulePlayerStats; // 0x30(0x10)
	struct TArray<struct FPlayerStat> HandInAsPirateLegendOnSchedulePlayerStats; // 0x40(0x10)
	struct TArray<struct FEmissaryBootyItemStats> HandInAsEmissaryPlayerStats; // 0x50(0x10)
	struct TArray<struct FEmissaryBootyItemStats> HandInAsMaxLevelEmissaryPlayerStats; // 0x60(0x10)
	struct TArray<struct FEmissaryBootyItemStats> HandInStolenAsEmissaryPlayerStats; // 0x70(0x10)
	struct TArray<struct FEmissaryBootyItemStats> HandInStolenAsMaxLevelEmissaryPlayerStats; // 0x80(0x10)
};

// ScriptStruct Athena.EmissaryBootyItemStats
// Size: 0x18 (Inherited: 0x00)
struct FEmissaryBootyItemStats {
	struct UClass* EmissaryCompany; // 0x00(0x08)
	struct TArray<struct FPlayerStat> Stats; // 0x08(0x10)
};

// ScriptStruct Athena.MerchantCrateSfx
// Size: 0x20 (Inherited: 0x00)
struct FMerchantCrateSfx {
	struct UWwiseEvent* EquipSfx; // 0x00(0x08)
	struct UWwiseEvent* UnequipSfx; // 0x08(0x08)
	struct UWwiseEvent* WielderLandedJumpSfx; // 0x10(0x08)
	struct UWwiseEvent* WielderFootstepLayerOneshot; // 0x18(0x08)
};

// ScriptStruct Athena.BeaconLitWithFlameOfFateStatsToFire
// Size: 0x18 (Inherited: 0x00)
struct FBeaconLitWithFlameOfFateStatsToFire {
	char FlameOfFateType; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct TArray<struct FPlayerStat> StatsToFire; // 0x08(0x10)
};

// ScriptStruct Athena.BeaconData
// Size: 0x02 (Inherited: 0x00)
struct FBeaconData {
	bool LightIsOn_Server; // 0x00(0x01)
	char FlameOfFateType; // 0x01(0x01)
};

// ScriptStruct Athena.BeaconExtinguishedEvent
// Size: 0x01 (Inherited: 0x00)
struct FBeaconExtinguishedEvent {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.BeaconLitEvent
// Size: 0x01 (Inherited: 0x00)
struct FBeaconLitEvent {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.DeactivateHatchEvent
// Size: 0x08 (Inherited: 0x00)
struct FDeactivateHatchEvent {
	struct FName EventID; // 0x00(0x08)
};

// ScriptStruct Athena.ActivateHatchEvent
// Size: 0x0c (Inherited: 0x00)
struct FActivateHatchEvent {
	struct FName EventID; // 0x00(0x08)
	char FlameSpecificPhobia; // 0x08(0x01)
	char UnknownData_9[0x3]; // 0x09(0x03)
};

// ScriptStruct Athena.BedPartDesc
// Size: 0x10 (Inherited: 0x00)
struct FBedPartDesc {
	struct UMaterialInterface* BedMaterial; // 0x00(0x08)
	struct UMaterialInterface* DrapesMaterial; // 0x08(0x08)
};

// ScriptStruct Athena.BellPlayerStats
// Size: 0x10 (Inherited: 0x00)
struct FBellPlayerStats {
	struct TArray<struct FPlayerStat> StatsToFireUponBellRing; // 0x00(0x10)
};

// ScriptStruct Athena.BellDesc
// Size: 0x18 (Inherited: 0x00)
struct FBellDesc {
	struct UStaticMesh* BellMesh; // 0x00(0x08)
	struct UWwiseEvent* BellRingSFX; // 0x08(0x08)
	struct UWwiseEvent* BellRingTurbulenceSFX; // 0x10(0x08)
};

// ScriptStruct Athena.PageLayoutRepInfo
// Size: 0x28 (Inherited: 0x00)
struct FPageLayoutRepInfo {
	char UnknownData_0[0x8]; // 0x00(0x08)
	struct TArray<struct FTreasureMapWidgetTexture> Images; // 0x08(0x10)
	struct TArray<struct FTreasureMapWidgetLocalisedTextWithFontOverride> GeneralText; // 0x18(0x10)
};

// ScriptStruct Athena.TreasureMapWidgetLocalisedTextWithFontOverride
// Size: 0x80 (Inherited: 0x78)
struct FTreasureMapWidgetLocalisedTextWithFontOverride : FTreasureMapWidgetLocalisedText {
	struct UFont* FontOverride; // 0x78(0x08)
};

// ScriptStruct Athena.TreasureMapWidgetLocalisedText
// Size: 0x78 (Inherited: 0x3c)
struct FTreasureMapWidgetLocalisedText : FTreasureMapWidgetText {
	char UnknownData_3C[0x4]; // 0x3c(0x04)
	struct FText Text; // 0x40(0x38)
};

// ScriptStruct Athena.TreasureMapWidgetText
// Size: 0x3c (Inherited: 0x1c)
struct FTreasureMapWidgetText : FTreasureMapWidget {
	float Scale; // 0x1c(0x04)
	bool CutoutTextStyle; // 0x20(0x01)
	bool ShouldStrikethroughOnStart; // 0x21(0x01)
	char UnknownData_22[0x2]; // 0x22(0x02)
	float StrikethroughThickness; // 0x24(0x04)
	float StrikethroughOffset; // 0x28(0x04)
	struct FLinearColor StrikethroughColor; // 0x2c(0x10)
};

// ScriptStruct Athena.TreasureMapWidget
// Size: 0x1c (Inherited: 0x00)
struct FTreasureMapWidget {
	struct FVector2D Position; // 0x00(0x08)
	char HorizontalAlignment; // 0x08(0x01)
	char VerticalAlignment; // 0x09(0x01)
	char UnknownData_A[0x2]; // 0x0a(0x02)
	float Angle; // 0x0c(0x04)
	float Width; // 0x10(0x04)
	float Opacity; // 0x14(0x04)
	bool DisableCanvasWidthClamp; // 0x18(0x01)
	char UnknownData_19[0x3]; // 0x19(0x03)
};

// ScriptStruct Athena.TreasureMapWidgetTexture
// Size: 0x30 (Inherited: 0x1c)
struct FTreasureMapWidgetTexture : FTreasureMapWidget {
	char UnknownData_1C[0x4]; // 0x1c(0x04)
	struct UTexture* Image; // 0x20(0x08)
	float RelativeHeightModifier; // 0x28(0x04)
	bool FlipX; // 0x2c(0x01)
	bool ScaleHeightOnMultipleLines; // 0x2d(0x01)
	char UnknownData_2E[0x2]; // 0x2e(0x02)
};

// ScriptStruct Athena.QuestBookPageRenderer
// Size: 0x18 (Inherited: 0x00)
struct FQuestBookPageRenderer {
	struct UFont* Font; // 0x00(0x08)
	float FontScale; // 0x08(0x04)
	float FontMaxScale; // 0x0c(0x04)
	float FontLineSpacingScale; // 0x10(0x04)
	char UnknownData_14[0x4]; // 0x14(0x04)
};

// ScriptStruct Athena.QuestBookMaterialHandler
// Size: 0x140 (Inherited: 0x00)
struct FQuestBookMaterialHandler {
	int32_t PageWidth; // 0x00(0x04)
	int32_t PageHeight; // 0x04(0x04)
	struct FQuestBookPageRenderer PageTextRenderer; // 0x08(0x18)
	struct UMaybeCompressedCanvasRenderTarget2D* LeftSpreadLeftPageRenderTarget; // 0x20(0x08)
	struct UMaybeCompressedCanvasRenderTarget2D* LeftSpreadRightPageRenderTarget; // 0x28(0x08)
	struct UMaybeCompressedCanvasRenderTarget2D* RightSpreadLeftPageRenderTarget; // 0x30(0x08)
	struct UMaybeCompressedCanvasRenderTarget2D* RightSpreadRightPageRenderTarget; // 0x38(0x08)
	struct UQuestBookPageLayout* LeftSpreadLeftPageContents; // 0x40(0x08)
	char UnknownData_48[0x10]; // 0x48(0x10)
	struct UQuestBookPageLayout* LeftSpreadRightPageContents; // 0x58(0x08)
	char UnknownData_60[0x10]; // 0x60(0x10)
	struct UQuestBookPageLayout* RightSpreadLeftPageContents; // 0x70(0x08)
	char UnknownData_78[0x10]; // 0x78(0x10)
	struct UQuestBookPageLayout* RightSpreadRightPageContents; // 0x88(0x08)
	char UnknownData_90[0xb0]; // 0x90(0xb0)
};

// ScriptStruct Athena.PageReference
// Size: 0x18 (Inherited: 0x00)
struct FPageReference {
	struct FStringAssetReference PageReference; // 0x00(0x10)
	char NumberOfPages; // 0x10(0x01)
	char UnknownData_11[0x7]; // 0x11(0x07)
};

// ScriptStruct Athena.QuestBookRepInfo
// Size: 0x28 (Inherited: 0x00)
struct FQuestBookRepInfo {
	int32_t LeftPageIndex; // 0x00(0x04)
	char UnknownData_4[0x4]; // 0x04(0x04)
	struct TArray<int32_t> CurrentBookContents; // 0x08(0x10)
	struct TArray<struct FPageLayoutRepInfo> ProcPageList; // 0x18(0x10)
};

// ScriptStruct Athena.BountyMapTargetDesc
// Size: 0x50 (Inherited: 0x00)
struct FBountyMapTargetDesc {
	struct FTreasureMapTextDesc Name; // 0x00(0x48)
	struct UTexture* MugShotImage; // 0x48(0x08)
};

// ScriptStruct Athena.TreasureMapTextDesc
// Size: 0x48 (Inherited: 0x00)
struct FTreasureMapTextDesc {
	struct FText Pattern; // 0x00(0x38)
	struct TArray<struct FTreasureMapTextEntry> Substitutions; // 0x38(0x10)
};

// ScriptStruct Athena.TreasureMapTextEntry
// Size: 0x48 (Inherited: 0x00)
struct FTreasureMapTextEntry {
	struct FString Name; // 0x00(0x10)
	struct FText Substitution; // 0x10(0x38)
};

// ScriptStruct Athena.BountyMapContents
// Size: 0x68 (Inherited: 0x00)
struct FBountyMapContents {
	struct FTreasureMapTextDesc Location; // 0x00(0x48)
	struct TArray<struct FTreasureMapTextDesc> Descriptions; // 0x48(0x10)
	struct TArray<struct FBountyMapTargetDesc> Targets; // 0x58(0x10)
};

// ScriptStruct Athena.CannonDesc
// Size: 0x30 (Inherited: 0x00)
struct FCannonDesc {
	struct FStringAssetReference CannonBarrelMesh; // 0x00(0x10)
	int64_t CannonBarrelCachedMeshResourceSize; // 0x10(0x08)
	struct FStringAssetReference CannonBoxMesh; // 0x18(0x10)
	int64_t CannonBoxCachedMeshResourceSize; // 0x28(0x08)
};

// ScriptStruct Athena.EventCannonFiredOnServer
// Size: 0x08 (Inherited: 0x00)
struct FEventCannonFiredOnServer {
	struct ACannon* Cannon; // 0x00(0x08)
};

// ScriptStruct Athena.EventCannonFired
// Size: 0x20 (Inherited: 0x00)
struct FEventCannonFired {
	struct ACannon* FiredCannon; // 0x00(0x08)
	char UnknownData_8[0x18]; // 0x08(0x18)
};

// ScriptStruct Athena.EventCannonAimingStoppedYaw
// Size: 0x01 (Inherited: 0x00)
struct FEventCannonAimingStoppedYaw {
	bool IsAtEnd; // 0x00(0x01)
};

// ScriptStruct Athena.EventCannonAimingStoppedPitch
// Size: 0x01 (Inherited: 0x00)
struct FEventCannonAimingStoppedPitch {
	bool IsAtEnd; // 0x00(0x01)
};

// ScriptStruct Athena.EventCannonAimingStartedYaw
// Size: 0x01 (Inherited: 0x00)
struct FEventCannonAimingStartedYaw {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EventCannonAimingStartedPitch
// Size: 0x01 (Inherited: 0x00)
struct FEventCannonAimingStartedPitch {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EventCannonAimingCenteredYaw
// Size: 0x01 (Inherited: 0x00)
struct FEventCannonAimingCenteredYaw {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EventCannonAimingCenteredPitch
// Size: 0x01 (Inherited: 0x00)
struct FEventCannonAimingCenteredPitch {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.AchievementSailCloseToShipWithoutFiring
// Size: 0x18 (Inherited: 0x00)
struct FAchievementSailCloseToShipWithoutFiring {
	float RangeToRemainWithinInMetres; // 0x00(0x04)
	float DistanceToTravelInMetres; // 0x04(0x04)
	char UnknownData_8[0x10]; // 0x08(0x10)
};

// ScriptStruct Athena.AchievementSailFullyWithTheWind
// Size: 0x08 (Inherited: 0x00)
struct FAchievementSailFullyWithTheWind {
	float DistanceToTravelInMetres; // 0x00(0x04)
	char UnknownData_4[0x4]; // 0x04(0x04)
};

// ScriptStruct Athena.AchievementSailThroughStormAtNightWithLightsOff
// Size: 0x90 (Inherited: 0x00)
struct FAchievementSailThroughStormAtNightWithLightsOff {
	uint32_t RequiredTravelDistance; // 0x00(0x04)
	char UnknownData_4[0x5c]; // 0x04(0x5c)
	struct AShip* Ship; // 0x60(0x08)
	char UnknownData_68[0x28]; // 0x68(0x28)
};

// ScriptStruct Athena.AchievementSailWithFlameOfFateColoursAboard
// Size: 0x118 (Inherited: 0x00)
struct FAchievementSailWithFlameOfFateColoursAboard {
	uint32_t RequiredTravelDistanceInMetres; // 0x00(0x04)
	char UnknownData_4[0x4]; // 0x04(0x04)
	struct AShip* Ship; // 0x08(0x08)
	struct TArray<struct AShipInteractableLight*> ShipLights; // 0x10(0x10)
	char UnknownData_20[0xf8]; // 0x20(0xf8)
};

// ScriptStruct Athena.ShipPartConnections
// Size: 0x98 (Inherited: 0x00)
struct FShipPartConnections {
	struct FName AnchorName; // 0x00(0x08)
	struct FName CapstanName; // 0x08(0x08)
	struct FName RudderName; // 0x10(0x08)
	struct FName WheelName; // 0x18(0x08)
	struct FName MainMastName; // 0x20(0x08)
	struct FName MainMastSailHoistRightName; // 0x28(0x08)
	struct FName MainMastSailHoistLeftName; // 0x30(0x08)
	struct FName MainMastSailAngleRightName; // 0x38(0x08)
	struct FName MainMastSailAngleLeftName; // 0x40(0x08)
	struct FName MizzenMastName; // 0x48(0x08)
	struct FName MizzenMastSailHoistRightName; // 0x50(0x08)
	struct FName MizzenMastSailHoistLeftName; // 0x58(0x08)
	struct FName MizzenMastSailAngleRightName; // 0x60(0x08)
	struct FName MizzenMastSailAngleLeftName; // 0x68(0x08)
	struct FName ForeMastName; // 0x70(0x08)
	struct FName ForeMastSailHoistRightName; // 0x78(0x08)
	struct FName ForeMastSailHoistLeftName; // 0x80(0x08)
	struct FName ForeMastSailAngleRightName; // 0x88(0x08)
	struct FName ForeMastSailAngleLeftName; // 0x90(0x08)
};

// ScriptStruct Athena.ShipCurseFXData
// Size: 0x30 (Inherited: 0x00)
struct FShipCurseFXData {
	char ShipCurseTag; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct TArray<struct FShipCurseVFXTemplate> VFXTemplates; // 0x08(0x10)
	struct FShipCurseAudioLoop AudioLoop; // 0x18(0x18)
};

// ScriptStruct Athena.ShipCurseAudioLoop
// Size: 0x18 (Inherited: 0x00)
struct FShipCurseAudioLoop {
	struct UWwiseEvent* PlayLoop; // 0x00(0x08)
	struct UWwiseEvent* StopLoop; // 0x08(0x08)
	struct UWwiseObjectPoolWrapper* PoolWrapper; // 0x10(0x08)
};

// ScriptStruct Athena.ShipCurseVFXTemplate
// Size: 0x20 (Inherited: 0x00)
struct FShipCurseVFXTemplate {
	struct UClass* ActorClass; // 0x00(0x08)
	struct UParticleSystem* Template; // 0x08(0x08)
	struct FString SocketNameSubstring; // 0x10(0x10)
};

// ScriptStruct Athena.EventApplyStatusShipCurseEnd
// Size: 0x01 (Inherited: 0x00)
struct FEventApplyStatusShipCurseEnd {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EventApplyStatusShipCurse
// Size: 0x20 (Inherited: 0x00)
struct FEventApplyStatusShipCurse {
	char UnknownData_0[0x8]; // 0x00(0x08)
	struct FStatus Status; // 0x08(0x18)
};

// ScriptStruct Athena.EventCurseWheelLockEnd
// Size: 0x01 (Inherited: 0x00)
struct FEventCurseWheelLockEnd {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EventCurseWheelLock
// Size: 0x08 (Inherited: 0x00)
struct FEventCurseWheelLock {
	char CurseTag; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	float AngleThreshold; // 0x04(0x04)
};

// ScriptStruct Athena.EventCurseSpawnAIOnShip
// Size: 0x08 (Inherited: 0x00)
struct FEventCurseSpawnAIOnShip {
	struct UAIFixedWavesSpawner* AISpawner; // 0x00(0x08)
};

// ScriptStruct Athena.EventCurseBallastEnd
// Size: 0x01 (Inherited: 0x00)
struct FEventCurseBallastEnd {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EventCurseBallast
// Size: 0x04 (Inherited: 0x00)
struct FEventCurseBallast {
	char UnknownData_0[0x4]; // 0x00(0x04)
};

// ScriptStruct Athena.EventShipCurseFXEnd
// Size: 0x30 (Inherited: 0x00)
struct FEventShipCurseFXEnd {
	struct FShipCurseFXData CurseFXData; // 0x00(0x30)
};

// ScriptStruct Athena.EventShipCurseFX
// Size: 0x30 (Inherited: 0x00)
struct FEventShipCurseFX {
	struct FShipCurseFXData CurseFXData; // 0x00(0x30)
};

// ScriptStruct Athena.CurseShipCannonsEvent
// Size: 0x0c (Inherited: 0x00)
struct FCurseShipCannonsEvent {
	float PitchAngle; // 0x00(0x04)
	float YawAngle; // 0x04(0x04)
	float BlendTime; // 0x08(0x04)
};

// ScriptStruct Athena.EventEnableInteractionPoints
// Size: 0x18 (Inherited: 0x00)
struct FEventEnableInteractionPoints {
	char ShipCurseTag; // 0x00(0x01)
	char CurseTag; // 0x01(0x01)
	char UnknownData_2[0x6]; // 0x02(0x06)
	struct TArray<struct UClass*> InteractionPointsToEnable; // 0x08(0x10)
};

// ScriptStruct Athena.EventDisableInteractionPoints
// Size: 0x18 (Inherited: 0x00)
struct FEventDisableInteractionPoints {
	char ShipCurseTag; // 0x00(0x01)
	char CurseTag; // 0x01(0x01)
	char UnknownData_2[0x6]; // 0x02(0x06)
	struct TArray<struct UClass*> InteractionPointsToDisable; // 0x08(0x10)
};

// ScriptStruct Athena.EventCurseCapstan
// Size: 0x04 (Inherited: 0x00)
struct FEventCurseCapstan {
	float DurationToToggleCapstanPosition; // 0x00(0x04)
};

// ScriptStruct Athena.EventCurseChangeSailHeight
// Size: 0x04 (Inherited: 0x00)
struct FEventCurseChangeSailHeight {
	float Duration; // 0x00(0x04)
};

// ScriptStruct Athena.TimedResponseAction
// Size: 0x30 (Inherited: 0x00)
struct FTimedResponseAction {
	struct TArray<struct AActor*> TargetActors; // 0x00(0x10)
	float Duration; // 0x10(0x04)
	bool IsActive; // 0x14(0x01)
	char UnknownData_15[0x1b]; // 0x15(0x1b)
};

// ScriptStruct Athena.ShipCurseSpawnedFXForCurse
// Size: 0x18 (Inherited: 0x00)
struct FShipCurseSpawnedFXForCurse {
	char UnknownData_0[0x8]; // 0x00(0x08)
	struct TArray<struct FShipCurseSpawnedFXObject> SpawnedFXObjects; // 0x08(0x10)
};

// ScriptStruct Athena.ShipCurseSpawnedFXObject
// Size: 0x30 (Inherited: 0x00)
struct FShipCurseSpawnedFXObject {
	char UnknownData_0[0x28]; // 0x00(0x28)
	struct UWwiseEvent* StopAudioLoopEvent; // 0x28(0x08)
};

// ScriptStruct Athena.ShipActiveCurseFXData
// Size: 0x30 (Inherited: 0x00)
struct FShipActiveCurseFXData {
	struct FShipCurseFXData CurseFXData; // 0x00(0x30)
};

// ScriptStruct Athena.ShipConfigurationSettings
// Size: 0x18 (Inherited: 0x00)
struct FShipConfigurationSettings {
	float MetresSailedStatSendFrequency; // 0x00(0x04)
	float MinimumDistanceSailedBeforeSendingUpdate; // 0x04(0x04)
	float MaxVelocityAllowedForServerMigration; // 0x08(0x04)
	float MaxAngularVelocityAllowedForServerMigration; // 0x0c(0x04)
	float ShipHeartbeatFrequencySeconds; // 0x10(0x04)
	bool MigrationBasedOnVelocityEnabled; // 0x14(0x01)
	char UnknownData_15[0x3]; // 0x15(0x03)
};

// ScriptStruct Athena.LiquidContents
// Size: 0x40 (Inherited: 0x00)
struct FLiquidContents {
	struct AShip* LiquidSource; // 0x00(0x08)
	struct TArray<struct AShip*> LiquidTargets; // 0x08(0x10)
	struct AActor* Container; // 0x18(0x08)
	float LiquidVolume; // 0x20(0x04)
	struct FGuid ScoopID; // 0x24(0x10)
	float LiquidTransferFillAmountModifier; // 0x34(0x04)
	char ContainerType; // 0x38(0x01)
	char UnknownData_39[0x7]; // 0x39(0x07)
};

// ScriptStruct Athena.BucketContentsInfo
// Size: 0x58 (Inherited: 0x00)
struct FBucketContentsInfo {
	char ThrowableLiquidType; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct UClass* ProjectileClassToSpawn; // 0x08(0x08)
	struct UClass* ProjectileClassToSpawnAtWielder; // 0x10(0x08)
	struct UWwiseEvent* ThrowSfx; // 0x18(0x08)
	struct UObject* ThrowVfxFirstPerson; // 0x20(0x08)
	struct UObject* ThrowVfxThirdPerson; // 0x28(0x08)
	struct UObject* DrenchWielderVfxThirdPerson; // 0x30(0x08)
	struct UObject* BucketContentsParticleSystemFirstPerson; // 0x38(0x08)
	struct UObject* BucketContentsParticleSystemThirdPerson; // 0x40(0x08)
	struct FName SwitchState; // 0x48(0x08)
	float LiquidLevel; // 0x50(0x04)
	char UnknownData_54[0x4]; // 0x54(0x04)
};

// ScriptStruct Athena.QuestVariablePlayerActor
// Size: 0x30 (Inherited: 0x30)
struct FQuestVariablePlayerActor : FQuestVariable {
};

// ScriptStruct Athena.QuestVariable
// Size: 0x30 (Inherited: 0x00)
struct FQuestVariable {
	char UnknownData_0[0x18]; // 0x00(0x18)
	struct FName ParamName; // 0x18(0x08)
	TScriptInterface<struct UTaleQuestExpressionInterface> Expression; // 0x20(0x10)
};

// ScriptStruct Athena.LocationGeneratorSample
// Size: 0x1c (Inherited: 0x00)
struct FLocationGeneratorSample {
	char Type; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	struct FVector Location; // 0x04(0x0c)
	struct FVector Normal; // 0x10(0x0c)
};

// ScriptStruct Athena.CampaignPopUpNotificationInfo
// Size: 0x10 (Inherited: 0x00)
struct FCampaignPopUpNotificationInfo {
	struct FName Name; // 0x00(0x08)
	struct UPopUpMessageDesc* PopUp; // 0x08(0x08)
};

// ScriptStruct Athena.CannonEnchantmentDesc
// Size: 0x18 (Inherited: 0x00)
struct FCannonEnchantmentDesc {
	struct UObject* MuzzleFlashVfxFirstPerson; // 0x00(0x08)
	struct UObject* MuzzleFlashVfxThirdPerson; // 0x08(0x08)
	struct UWwiseEvent* FireSfx; // 0x10(0x08)
};

// ScriptStruct Athena.FactionStreakIcon
// Size: 0x10 (Inherited: 0x00)
struct FFactionStreakIcon {
	struct UTexture* FactionStreakIcon; // 0x00(0x08)
	struct UClass* Faction; // 0x08(0x08)
};

// ScriptStruct Athena.CapstanDesc
// Size: 0x48 (Inherited: 0x00)
struct FCapstanDesc {
	struct FStringAssetReference CapstanBodyMesh; // 0x00(0x10)
	int64_t CapstanBodyCachedMeshResourceSize; // 0x10(0x08)
	struct FStringAssetReference CapstanArmMesh; // 0x18(0x10)
	int64_t CapstanArmCachedMeshResourceSize; // 0x28(0x08)
	struct FStringAssetReference CapstanReleaseMesh; // 0x30(0x10)
	int64_t CapstanReleaseCachedMeshResourceSize; // 0x40(0x08)
};

// ScriptStruct Athena.CapstanAudioParams
// Size: 0x68 (Inherited: 0x00)
struct FCapstanAudioParams {
	struct UWwiseEvent* CapstanStart; // 0x00(0x08)
	struct UWwiseEvent* CapstanStop; // 0x08(0x08)
	struct UWwiseEvent* CapstanDamagedStart; // 0x10(0x08)
	struct UWwiseEvent* CapstanDamagedStop; // 0x18(0x08)
	struct UWwiseEvent* CapstanStopFullyRaised; // 0x20(0x08)
	struct UWwiseEvent* CapstanStopFullyLowered; // 0x28(0x08)
	struct UWwiseObjectPoolWrapper* CapstanEmitterPool; // 0x30(0x08)
	struct FName CapstanTurnRateRtpc; // 0x38(0x08)
	float CapstanTurnMinRtpcValue; // 0x40(0x04)
	float CapstanTurnMaxRtpcValue; // 0x44(0x04)
	struct FName BoatVelocityRtpc; // 0x48(0x08)
	float BoatVelocityMinRtpcValue; // 0x50(0x04)
	float BoatVelocityMaxRtpcValue; // 0x54(0x04)
	float EmpiricalMaxShipVelocity; // 0x58(0x04)
	struct FName CapstanDamageRtpc; // 0x5c(0x08)
	float CapstanDamageRtpcMaxValue; // 0x64(0x04)
};

// ScriptStruct Athena.CapstanNetState
// Size: 0x08 (Inherited: 0x00)
struct FCapstanNetState {
	float TargetRatio; // 0x00(0x04)
	bool IsLocked; // 0x04(0x01)
	char UnknownData_5[0x3]; // 0x05(0x03)
};

// ScriptStruct Athena.CapstanParams
// Size: 0x14 (Inherited: 0x00)
struct FCapstanParams {
	float MaxVelocityPerPlayer; // 0x00(0x04)
	float MaxFreeLoweringVelocity; // 0x04(0x04)
	float MaxError; // 0x08(0x04)
	float CorrectiveForceMultiplier; // 0x0c(0x04)
	float PlayerAnimationOnCapstanMultiplier; // 0x10(0x04)
};

// ScriptStruct Athena.RepairableComponentMaxDamageLevelOverride
// Size: 0x0c (Inherited: 0x00)
struct FRepairableComponentMaxDamageLevelOverride {
	struct FName FeatureName; // 0x00(0x08)
	int32_t MaxDamageLevel; // 0x08(0x04)
};

// ScriptStruct Athena.RepairableAuthoritiveRepairState
// Size: 0x18 (Inherited: 0x00)
struct FRepairableAuthoritiveRepairState {
	char RepairableState; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct TArray<struct AActor*> RepairingList; // 0x08(0x10)
};

// ScriptStruct Athena.CaptainCurtainsPartDesc
// Size: 0x20 (Inherited: 0x00)
struct FCaptainCurtainsPartDesc {
	struct FStringAssetReference PrimaryCurtainMesh; // 0x00(0x10)
	struct UMaterialInterface* SecondaryCurtainMaterial; // 0x10(0x08)
	int64_t PrimaryCurtainCachedMeshResourceSize; // 0x18(0x08)
};

// ScriptStruct Athena.CompanyCargoRunHandInStats
// Size: 0x38 (Inherited: 0x00)
struct FCompanyCargoRunHandInStats {
	struct UClass* CompanyId; // 0x00(0x08)
	struct TArray<struct FPlayerStat> StatsToFireOnHandIn; // 0x08(0x10)
	struct TArray<struct FPlayerStat> StatsToFireOnDamagedHandIn; // 0x18(0x10)
	struct TArray<struct FPlayerStat> StatsToFirePerHealthTierOnHandIn; // 0x28(0x10)
};

// ScriptStruct Athena.CompanySpecificCargoRunStats
// Size: 0x18 (Inherited: 0x00)
struct FCompanySpecificCargoRunStats {
	struct UClass* CompanyId; // 0x00(0x08)
	struct TArray<struct FPlayerStat> StatsToFireUponPerfectOnTimeHandIn; // 0x08(0x10)
};

// ScriptStruct Athena.CompanySpecificCargoRunReward
// Size: 0x28 (Inherited: 0x00)
struct FCompanySpecificCargoRunReward {
	struct UClass* CompanyId; // 0x00(0x08)
	struct FCargoRunReward Reward; // 0x08(0x20)
};

// ScriptStruct Athena.CargoRunReward
// Size: 0x20 (Inherited: 0x00)
struct FCargoRunReward {
	struct TArray<struct FRewardId> OnTimeRewards; // 0x00(0x10)
	struct TArray<struct FRewardId> LateRewards; // 0x10(0x10)
};

// ScriptStruct Athena.CargoRunMapContents
// Size: 0x60 (Inherited: 0x00)
struct FCargoRunMapContents {
	struct FGuid NPCId; // 0x00(0x10)
	int32_t CompanyIndex; // 0x10(0x04)
	int32_t NumOfItems; // 0x14(0x04)
	struct FTreasureMapTextDesc PickupLocationHint; // 0x18(0x48)
};

// ScriptStruct Athena.CarouselPirateDesc
// Size: 0x30 (Inherited: 0x00)
struct FCarouselPirateDesc {
	int32_t Seed; // 0x00(0x04)
	char Gender; // 0x04(0x01)
	char Ethnicity; // 0x05(0x01)
	char UnknownData_6[0x2]; // 0x06(0x02)
	float Age; // 0x08(0x04)
	struct FRadialCoordinate BodyShape; // 0x0c(0x08)
	float Dirtiness; // 0x14(0x04)
	float Wonkiness; // 0x18(0x04)
	char UnknownData_1C[0x4]; // 0x1c(0x04)
	struct TArray<struct UClass*> Outfit; // 0x20(0x10)
};

// ScriptStruct Athena.CarouselPirateGeneratorParams
// Size: 0xc8 (Inherited: 0x00)
struct FCarouselPirateGeneratorParams {
	int32_t MinNumOfEachGender; // 0x00(0x04)
	int32_t MinNumOfEachEthnicity; // 0x04(0x04)
	struct TArray<struct FCarouselPirateGroup> Groups; // 0x08(0x10)
	struct FCarouselPirateGroup Default; // 0x18(0x6c)
	char UnknownData_84[0x4]; // 0x84(0x04)
	struct FCarouselPirateClothing MaleClothing; // 0x88(0x20)
	struct FCarouselPirateClothing FemaleClothing; // 0xa8(0x20)
};

// ScriptStruct Athena.CarouselPirateClothing
// Size: 0x20 (Inherited: 0x00)
struct FCarouselPirateClothing {
	struct TArray<struct FCarouselPirateClothingItem> AvailableItems; // 0x00(0x10)
	struct TArray<struct FCarouselPirateClothingCategoryBias> Probabilities; // 0x10(0x10)
};

// ScriptStruct Athena.CarouselPirateClothingCategoryBias
// Size: 0x10 (Inherited: 0x00)
struct FCarouselPirateClothingCategoryBias {
	struct UClass* Category; // 0x00(0x08)
	float LikelihoodOfHaving; // 0x08(0x04)
	bool ProgressivlyDecreaseChance; // 0x0c(0x01)
	char UnknownData_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct Athena.CarouselPirateClothingItem
// Size: 0x10 (Inherited: 0x00)
struct FCarouselPirateClothingItem {
	struct UClass* Item; // 0x00(0x08)
	char EthnicityFilter; // 0x08(0x01)
	char UnknownData_9[0x7]; // 0x09(0x07)
};

// ScriptStruct Athena.CarouselPirateGroup
// Size: 0x6c (Inherited: 0x00)
struct FCarouselPirateGroup {
	struct FName Name; // 0x00(0x08)
	int32_t Count; // 0x08(0x04)
	struct FFloatRange Age; // 0x0c(0x10)
	struct FFloatRange Wonkiness; // 0x1c(0x10)
	struct FFloatRange Dirt; // 0x2c(0x10)
	struct FCarouselPirateBodyshape MaleBodyShape; // 0x3c(0x18)
	struct FCarouselPirateBodyshape FemaleBodyShape; // 0x54(0x18)
};

// ScriptStruct Athena.CarouselPirateBodyshape
// Size: 0x18 (Inherited: 0x00)
struct FCarouselPirateBodyshape {
	float RandomizationBias; // 0x00(0x04)
	struct FFloatRange ShapeMagnitude; // 0x04(0x10)
	struct FCarouselPirateBodyshapeCompass BodyShapeCompass; // 0x14(0x02)
	char UnknownData_16[0x2]; // 0x16(0x02)
};

// ScriptStruct Athena.CarouselPirateBodyshapeCompass
// Size: 0x02 (Inherited: 0x00)
struct FCarouselPirateBodyshapeCompass {
	char StartDirection; // 0x00(0x01)
	char EndDirection; // 0x01(0x01)
};

// ScriptStruct Athena.CatalogOfferCommodity
// Size: 0x18 (Inherited: 0x00)
struct FCatalogOfferCommodity {
	struct UClass* RequiredEmissary; // 0x00(0x08)
	struct FCommoditySelectionType Type; // 0x08(0x08)
	char Demand; // 0x10(0x01)
	char UnknownData_11[0x7]; // 0x11(0x07)
};

// ScriptStruct Athena.CatalogOfferBundleDataAsset
// Size: 0x18 (Inherited: 0x00)
struct FCatalogOfferBundleDataAsset {
	uint32_t TileSize; // 0x00(0x04)
	char UnknownData_4[0x4]; // 0x04(0x04)
	struct FStringAssetReference TileImage; // 0x08(0x10)
};

// ScriptStruct Athena.CatalogOfferRewardDataAsset
// Size: 0x10 (Inherited: 0x00)
struct FCatalogOfferRewardDataAsset {
	struct UClass* Company; // 0x00(0x08)
	struct FRewardId Reward; // 0x08(0x08)
};

// ScriptStruct Athena.CatalogOfferPrerequisitesDataAsset
// Size: 0x28 (Inherited: 0x00)
struct FCatalogOfferPrerequisitesDataAsset {
	struct TArray<struct UClass*> Entitlements; // 0x00(0x10)
	struct TArray<struct FCatalogOfferCompanyLevelDataAsset> CompanyLevel; // 0x10(0x10)
	uint32_t EntitlementRequirementThreshold; // 0x20(0x04)
	char UnknownData_24[0x4]; // 0x24(0x04)
};

// ScriptStruct Athena.CatalogOfferCompanyLevelDataAsset
// Size: 0x10 (Inherited: 0x00)
struct FCatalogOfferCompanyLevelDataAsset {
	struct UClass* Company; // 0x00(0x08)
	uint32_t Level; // 0x08(0x04)
	char UnknownData_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct Athena.CategoryDefaultsUnit
// Size: 0x18 (Inherited: 0x00)
struct FCategoryDefaultsUnit {
	struct TArray<struct FString> PartialStrings; // 0x00(0x10)
	struct UClass* Category; // 0x10(0x08)
};

// ScriptStruct Athena.ChandelierPartDesc
// Size: 0x30 (Inherited: 0x00)
struct FChandelierPartDesc {
	struct FStringAssetReference ChandelierMesh; // 0x00(0x10)
	struct FStringAssetReference FlamesMesh; // 0x10(0x10)
	int64_t ChandelierCachedMeshResourceSize; // 0x20(0x08)
	int64_t ChandelierFlamesCachedMeshResourceSize; // 0x28(0x08)
};

// ScriptStruct Athena.PlayerMusicController
// Size: 0x210 (Inherited: 0x00)
struct FPlayerMusicController {
	struct UPlayerMusicControllerParams* PlayerMusicParams; // 0x00(0x08)
	char UnknownData_8[0x30]; // 0x08(0x30)
	struct AActor* LocalPlayerActor; // 0x38(0x08)
	struct UPlayerOceanAudioComponent* PlayerOceanAudioComponent; // 0x40(0x08)
	struct UPlayerAtmosphericsAudioComponent* AtmosphericsAudioComponent; // 0x48(0x08)
	struct AAthenaPlayerCharacter* AthenaPlayerCharacter; // 0x50(0x08)
	struct AAthenaWorldSettings* AthenaWorldSettings; // 0x58(0x08)
	char UnknownData_60[0x160]; // 0x60(0x160)
	struct FTimeStampedInvasionMusicState TimeStampedInvaderMatchmakingState; // 0x1c0(0x18)
	char UnknownData_1D8[0x10]; // 0x1d8(0x10)
	struct TArray<struct FAudioStingRelevantShips> RelevantAudioStingShips; // 0x1e8(0x10)
	struct TArray<struct FAudioStingShipsSpotted> AudioStingShipsSpottedRecently; // 0x1f8(0x10)
	char UnknownData_208[0x8]; // 0x208(0x08)
};

// ScriptStruct Athena.AudioStingShipsSpotted
// Size: 0x10 (Inherited: 0x00)
struct FAudioStingShipsSpotted {
	struct AActor* SpottedShip; // 0x00(0x08)
	double TimeSpotted; // 0x08(0x08)
};

// ScriptStruct Athena.AudioStingRelevantShips
// Size: 0x10 (Inherited: 0x00)
struct FAudioStingRelevantShips {
	struct AActor* Ship; // 0x00(0x08)
	bool IsAIShip; // 0x08(0x01)
	bool IsEmissary; // 0x09(0x01)
	bool IsCaptainedShip; // 0x0a(0x01)
	char UnknownData_B[0x5]; // 0x0b(0x05)
};

// ScriptStruct Athena.NamedStateSelector
// Size: 0x18 (Inherited: 0x00)
struct FNamedStateSelector {
	struct TArray<struct FNameActiveStatePair> NamedStates; // 0x00(0x10)
	struct FName DefaultStateName; // 0x10(0x08)
};

// ScriptStruct Athena.NameActiveStatePair
// Size: 0x0c (Inherited: 0x00)
struct FNameActiveStatePair {
	struct FName StateName; // 0x00(0x08)
	bool IsActive; // 0x08(0x01)
	char UnknownData_9[0x3]; // 0x09(0x03)
};

// ScriptStruct Athena.FogTypeToAudio
// Size: 0x18 (Inherited: 0x00)
struct FFogTypeToAudio {
	char FogBankType; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct UWwiseEvent* FogMusicPlayEvent; // 0x08(0x08)
	struct UWwiseEvent* FogMusicStopEvent; // 0x10(0x08)
};

// ScriptStruct Athena.StateCategoryGroup
// Size: 0x20 (Inherited: 0x18)
struct FStateCategoryGroup : FNamedStateSelector {
	struct FName GroupName; // 0x18(0x08)
};

// ScriptStruct Athena.HealthChangeAudio
// Size: 0x10 (Inherited: 0x00)
struct FHealthChangeAudio {
	char Reason; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct UWwiseEvent* Sfx; // 0x08(0x08)
};

// ScriptStruct Athena.DamageTypeToAudio
// Size: 0x28 (Inherited: 0x00)
struct FDamageTypeToAudio {
	struct UClass* DamagerType; // 0x00(0x08)
	struct FName AudioState; // 0x08(0x08)
	struct UWwiseEvent* StartAudioEvent; // 0x10(0x08)
	struct UWwiseEvent* EndAudioEvent; // 0x18(0x08)
	float Duration; // 0x20(0x04)
	char UnknownData_24[0x4]; // 0x24(0x04)
};

// ScriptStruct Athena.CharacterSocketFootWaterImpactResult
// Size: 0x1c (Inherited: 0x00)
struct FCharacterSocketFootWaterImpactResult {
	struct FVector Position; // 0x00(0x0c)
	struct FVector SocketVelocity; // 0x0c(0x0c)
	int32_t FootIndex; // 0x18(0x04)
};

// ScriptStruct Athena.CharacterFootWaterImpactResult
// Size: 0x20 (Inherited: 0x00)
struct FCharacterFootWaterImpactResult {
	struct FCharacterSocketFootWaterImpactResult SocketFootImpactResult; // 0x00(0x1c)
	int32_t FootIndex; // 0x1c(0x04)
};

// ScriptStruct Athena.CharacterFootImpactResult
// Size: 0xd0 (Inherited: 0x00)
struct FCharacterFootImpactResult {
	struct FHitResult HitResult; // 0x00(0x80)
	char FootImpactType; // 0x80(0x01)
	char UnknownData_81[0xf]; // 0x81(0x0f)
	struct FTransform SocketTransform; // 0x90(0x30)
	struct FVector SocketVelocity; // 0xc0(0x0c)
	int32_t FootIndex; // 0xcc(0x04)
};

// ScriptStruct Athena.CharacterSocketCollisionDesc
// Size: 0x28 (Inherited: 0x00)
struct FCharacterSocketCollisionDesc {
	struct FName SocketName; // 0x00(0x08)
	struct USkeletalMeshComponent* SkeletalMeshComponent; // 0x08(0x08)
	char TraceType; // 0x10(0x01)
	char UnknownData_11[0x3]; // 0x11(0x03)
	float TraceDistance; // 0x14(0x04)
	float TraceOffset; // 0x18(0x04)
	char ResultType; // 0x1c(0x01)
	char UnknownData_1D[0x3]; // 0x1d(0x03)
	int32_t FootIndex; // 0x20(0x04)
	char UnknownData_24[0x4]; // 0x24(0x04)
};

// ScriptStruct Athena.SocketCollisionExitWaterEvent
// Size: 0x28 (Inherited: 0x00)
struct FSocketCollisionExitWaterEvent {
	char UnknownData_0[0x28]; // 0x00(0x28)
};

// ScriptStruct Athena.SocketCollisionEnterWaterEvent
// Size: 0x28 (Inherited: 0x00)
struct FSocketCollisionEnterWaterEvent {
	char UnknownData_0[0x28]; // 0x00(0x28)
};

// ScriptStruct Athena.SocketCollisionEvent
// Size: 0xd0 (Inherited: 0x00)
struct FSocketCollisionEvent {
	char UnknownData_0[0xd0]; // 0x00(0xd0)
};

// ScriptStruct Athena.ChestOfRageReplicatedData
// Size: 0x0c (Inherited: 0x00)
struct FChestOfRageReplicatedData {
	char State; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	float RageValue; // 0x04(0x04)
	bool HasBeenActivated; // 0x08(0x01)
	char UnknownData_9[0x3]; // 0x09(0x03)
};

// ScriptStruct Athena.EventReceiveChestOfRageComponentState
// Size: 0x08 (Inherited: 0x00)
struct FEventReceiveChestOfRageComponentState {
	struct UChestOfRageComponent* Source; // 0x00(0x08)
};

// ScriptStruct Athena.ChestOfRageDamageTableEntry
// Size: 0x08 (Inherited: 0x00)
struct FChestOfRageDamageTableEntry {
	char Reason; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	float TimeToAdd; // 0x04(0x04)
};

// ScriptStruct Athena.ClothingLoadout
// Size: 0x10 (Inherited: 0x00)
struct FClothingLoadout {
	struct TArray<struct UClass*> Items; // 0x00(0x10)
};

// ScriptStruct Athena.ClothingChestRandomFilter
// Size: 0x10 (Inherited: 0x00)
struct FClothingChestRandomFilter {
	struct UClass* Category; // 0x00(0x08)
	float Likelihood; // 0x08(0x04)
	char UnknownData_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct Athena.ClothingLoadoutContainer
// Size: 0x18 (Inherited: 0x00)
struct FClothingLoadoutContainer {
	struct FClothingLoadout Loadout; // 0x00(0x10)
	bool HasBeenSet; // 0x10(0x01)
	char UnknownData_11[0x7]; // 0x11(0x07)
};

// ScriptStruct Athena.CloudWeatherParameters
// Size: 0x28 (Inherited: 0x00)
struct FCloudWeatherParameters {
	struct FVector2D DefaultCloudVelocity; // 0x00(0x08)
	struct UMaterialParameterCollection* AtmosphericMaterialParams; // 0x08(0x08)
	float GlobalAtmosphericPressure; // 0x10(0x04)
	float AtmosphericPressureThresholdSize; // 0x14(0x04)
	float MaxWindDelayLength; // 0x18(0x04)
	float WindSpeedMultiplier; // 0x1c(0x04)
	char UsesGlobalWindService : 1; // 0x20(0x01)
	char UsesPressureZones : 1; // 0x20(0x01)
	char CloudsCastShadows : 1; // 0x20(0x01)
	char PressureIsControlledByParameterCollection : 1; // 0x20(0x01)
	char UnknownData_20_4 : 4; // 0x20(0x01)
	char UnknownData_21[0x7]; // 0x21(0x07)
};

// ScriptStruct Athena.CloudTileParameters
// Size: 0x20 (Inherited: 0x00)
struct FCloudTileParameters {
	struct TArray<struct FCloudTypeDefinition> Meshes; // 0x00(0x10)
	int32_t Samples; // 0x10(0x04)
	int32_t Seed; // 0x14(0x04)
	float MeshScaleMultiplier; // 0x18(0x04)
	bool ShouldCloudTileBeGenerated; // 0x1c(0x01)
	char UnknownData_1D[0x3]; // 0x1d(0x03)
};

// ScriptStruct Athena.CloudDomeParameters
// Size: 0x28 (Inherited: 0x00)
struct FCloudDomeParameters {
	float Width; // 0x00(0x04)
	float DomeToTileProportion; // 0x04(0x04)
	float Height; // 0x08(0x04)
	float HighPressureExtraHeight; // 0x0c(0x04)
	float FadeProportion; // 0x10(0x04)
	float DistanceCurvatureOvershoot; // 0x14(0x04)
	float DistantStreetCloudRotation; // 0x18(0x04)
	float ProportionOfCloudDomeToAlwaysUpdate; // 0x1c(0x04)
	int32_t SplitRemainingCloudsOverThisManyUpdates; // 0x20(0x04)
	bool UpdateClosestProportionEveryOtherFrame; // 0x24(0x01)
	bool EnableDistanceCurvature; // 0x25(0x01)
	char UnknownData_26[0x2]; // 0x26(0x02)
};

// ScriptStruct Athena.CoastObject
// Size: 0x50 (Inherited: 0x00)
struct FCoastObject {
	struct USplineComponent* CoastSplineInternal; // 0x00(0x08)
	struct USplineComponent* InnerSplineInternal; // 0x08(0x08)
	struct FVector SplineOrigin; // 0x10(0x0c)
	float CoastalLookupSquaredDistance; // 0x1c(0x04)
	char UnknownData_20[0x30]; // 0x20(0x30)
};

// ScriptStruct Athena.HUDBlur
// Size: 0x18 (Inherited: 0x00)
struct FHUDBlur {
	struct UMaterialParameterCollectionInstance* ScreenEffectsMaterialParameterCollectionInstance; // 0x00(0x08)
	char UnknownData_8[0x10]; // 0x08(0x10)
};

// ScriptStruct Athena.HUDBlurParams
// Size: 0x18 (Inherited: 0x00)
struct FHUDBlurParams {
	struct UMaterialParameterCollection* ScreenEffectsMaterialParameterCollection; // 0x00(0x08)
	struct FHUDBlurSourceParams MenuBlurParams; // 0x08(0x08)
	struct FHUDBlurSourceParams MigrationBlurParams; // 0x10(0x08)
};

// ScriptStruct Athena.HUDBlurSourceParams
// Size: 0x08 (Inherited: 0x00)
struct FHUDBlurSourceParams {
	float SecondsToFullyBlur; // 0x00(0x04)
	float SecondsToFullyUnblur; // 0x04(0x04)
};

// ScriptStruct Athena.HttpClientComponentRequestEvent
// Size: 0x98 (Inherited: 0x00)
struct FHttpClientComponentRequestEvent {
	struct FString Uri; // 0x00(0x10)
	struct FString Body; // 0x10(0x10)
	bool ShouldEncrypt; // 0x20(0x01)
	bool ShouldAuthorize; // 0x21(0x01)
	char UnknownData_22[0x6]; // 0x22(0x06)
	struct FString Method; // 0x28(0x10)
	struct TMap<struct FString, struct FString> Headers; // 0x38(0x50)
	struct FString Id; // 0x88(0x10)
};

// ScriptStruct Athena.HttpClientComponentResponseEvent
// Size: 0x28 (Inherited: 0x00)
struct FHttpClientComponentResponseEvent {
	bool Success; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct FString Body; // 0x08(0x10)
	struct FString Id; // 0x18(0x10)
};

// ScriptStruct Athena.PlayerTalkingSettings
// Size: 0x30 (Inherited: 0x00)
struct FPlayerTalkingSettings {
	struct FLinearColor IconTint; // 0x00(0x10)
	struct UTexture2D* Icon; // 0x10(0x08)
	float ScreenEdgePadding; // 0x18(0x04)
	float Scale; // 0x1c(0x04)
	float FadeInTimeInSeconds; // 0x20(0x04)
	char UnknownData_24[0xc]; // 0x24(0x0c)
};

// ScriptStruct Athena.UpdateShipPreviewWorldEvent
// Size: 0x78 (Inherited: 0x00)
struct FUpdateShipPreviewWorldEvent {
	struct UClass* ShipSize; // 0x00(0x08)
	struct TArray<struct UClass*> ShipCustomizationClasses; // 0x08(0x10)
	struct FShipPersistenceModel DamageState; // 0x18(0x50)
	struct FString Name; // 0x68(0x10)
};

// ScriptStruct Athena.ShipPersistenceModel
// Size: 0x50 (Inherited: 0x01)
struct FShipPersistenceModel : FPersistenceModel {
	struct TArray<struct FShipPartDamagePersistenceModel> PartDamagePersistenceModels; // 0x00(0x10)
	struct FHullDamagePersistenceModel HullDamageModel; // 0x10(0x10)
	struct FHullCharringPersistenceModel HullCharringModel; // 0x20(0x18)
	struct FMapTablePersistenceModel MapTablePersistenceModel; // 0x38(0x10)
	struct FShipInternalWaterPersistenceModel InternalWaterModel; // 0x48(0x04)
	char UnknownData_4D[0x3]; // 0x4d(0x03)
};

// ScriptStruct Athena.PersistenceModel
// Size: 0x01 (Inherited: 0x00)
struct FPersistenceModel {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.ShipInternalWaterPersistenceModel
// Size: 0x04 (Inherited: 0x01)
struct FShipInternalWaterPersistenceModel : FPersistenceModel {
	float InternalWaterLevel; // 0x00(0x04)
};

// ScriptStruct Athena.MapTablePersistenceModel
// Size: 0x10 (Inherited: 0x01)
struct FMapTablePersistenceModel : FPersistenceModel {
	struct TArray<struct FVector2D> MapPins; // 0x00(0x10)
};

// ScriptStruct Athena.ShipPreviewFailedEvent
// Size: 0x01 (Inherited: 0x00)
struct FShipPreviewFailedEvent {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.CachingOfShipPreviewLoadoutsCompleteEvent
// Size: 0x01 (Inherited: 0x00)
struct FCachingOfShipPreviewLoadoutsCompleteEvent {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.RequestCachingOfShipPreviewLoadoutsEvent
// Size: 0x60 (Inherited: 0x00)
struct FRequestCachingOfShipPreviewLoadoutsEvent {
	struct TArray<struct FString> Ids; // 0x00(0x10)
	struct TArray<struct FString> Names; // 0x10(0x10)
	struct TArray<struct FString> DamageStates; // 0x20(0x10)
	struct TArray<struct FString> OwnerUserIds; // 0x30(0x10)
	struct TArray<struct FString> OwnerPirateIds; // 0x40(0x10)
	struct TArray<struct FString> Signatures; // 0x50(0x10)
};

// ScriptStruct Athena.CachedShipLoadout
// Size: 0x80 (Inherited: 0x00)
struct FCachedShipLoadout {
	struct FGuid ShipId; // 0x00(0x10)
	struct FString Name; // 0x10(0x10)
	struct TArray<struct FShipPartCustomizationModel> ShipPartCustomisations; // 0x20(0x10)
	struct FShipPersistenceModel DamageState; // 0x30(0x50)
};

// ScriptStruct Athena.ShipPartCustomizationModel
// Size: 0x08 (Inherited: 0x00)
struct FShipPartCustomizationModel {
	struct FName EntitlementId; // 0x00(0x08)
};

// ScriptStruct Athena.ShipPreviewData
// Size: 0x30 (Inherited: 0x00)
struct FShipPreviewData {
	struct FString Id; // 0x00(0x10)
	struct FString Name; // 0x10(0x10)
	struct FString DamageState; // 0x20(0x10)
};

// ScriptStruct Athena.RequestShipPreviewUpdateEvent
// Size: 0x20 (Inherited: 0x00)
struct FRequestShipPreviewUpdateEvent {
	struct FString ShipId; // 0x00(0x10)
	struct FString ShipType; // 0x10(0x10)
};

// ScriptStruct Athena.ShipPreviewLoadingEvent
// Size: 0x01 (Inherited: 0x00)
struct FShipPreviewLoadingEvent {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.ShipPreviewLoadedEvent
// Size: 0x01 (Inherited: 0x00)
struct FShipPreviewLoadedEvent {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.ShipPreviewCreatedEvent
// Size: 0x10 (Inherited: 0x00)
struct FShipPreviewCreatedEvent {
	struct FString PreviewURL; // 0x00(0x10)
};

// ScriptStruct Athena.RequestDestroyShipPreviewEvent
// Size: 0x01 (Inherited: 0x00)
struct FRequestDestroyShipPreviewEvent {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.RequestCreateShipPreviewEvent
// Size: 0x08 (Inherited: 0x00)
struct FRequestCreateShipPreviewEvent {
	int32_t ResolutionX; // 0x00(0x04)
	int32_t ResolutionY; // 0x04(0x04)
};

// ScriptStruct Athena.CoherentToWwiseEventDataAssetEntry
// Size: 0x18 (Inherited: 0x00)
struct FCoherentToWwiseEventDataAssetEntry {
	struct FString CueKey; // 0x00(0x10)
	struct UWwiseEvent* AudioEvent; // 0x10(0x08)
};

// ScriptStruct Athena.AmmoUI
// Size: 0x128 (Inherited: 0x00)
struct FAmmoUI {
	char UnknownData_0[0x18]; // 0x00(0x18)
	struct APawn* TargetPawn; // 0x18(0x08)
	char UnknownData_20[0x108]; // 0x20(0x108)
};

// ScriptStruct Athena.HealthUI
// Size: 0x1b0 (Inherited: 0x00)
struct FHealthUI {
	float MinVisibleHealth; // 0x00(0x04)
	float ContinuousTimePerUpdate; // 0x04(0x04)
	char UnknownData_8[0x18]; // 0x08(0x18)
	struct APawn* TargetPawn; // 0x20(0x08)
	char UnknownData_28[0x188]; // 0x28(0x188)
};

// ScriptStruct Athena.CompanyRankData
// Size: 0x10 (Inherited: 0x00)
struct FCompanyRankData {
	struct TArray<struct FCompanyRankGradeData> RankGradeData; // 0x00(0x10)
};

// ScriptStruct Athena.CompanyRankGradeData
// Size: 0x18 (Inherited: 0x00)
struct FCompanyRankGradeData {
	struct UClass* Rank; // 0x00(0x08)
	struct FStringAssetReference Ribbon; // 0x08(0x10)
};

// ScriptStruct Athena.CompanyShopInfo
// Size: 0x60 (Inherited: 0x00)
struct FCompanyShopInfo {
	bool ShouldShowCompanyInfo; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct FStringAssetReference InfoSkin; // 0x08(0x10)
	struct FText InfoTitle; // 0x18(0x38)
	struct TArray<struct FText> InfoTips; // 0x50(0x10)
};

// ScriptStruct Athena.CompanyShopSkin
// Size: 0x20 (Inherited: 0x00)
struct FCompanyShopSkin {
	struct FStringAssetReference TopBanner; // 0x00(0x10)
	struct FStringAssetReference BottomBanner; // 0x10(0x10)
};

// ScriptStruct Athena.CompanySkin
// Size: 0xb8 (Inherited: 0x00)
struct FCompanySkin {
	struct FStringAssetReference BackgroundImage; // 0x00(0x10)
	struct FStringAssetReference RibbonImage; // 0x10(0x10)
	char Style; // 0x20(0x01)
	char UnknownData_21[0x7]; // 0x21(0x07)
	struct FString RankIncreaseAudioCue; // 0x28(0x10)
	struct FString RankIncreaseStopAudioCue; // 0x38(0x10)
	struct FString RankLevelUpAudioCue; // 0x48(0x10)
	struct FString RankTriggerAudioCue; // 0x58(0x10)
	struct FString EmissaryRankIncreaseAudioCue; // 0x68(0x10)
	struct FString EmissaryRankIncreaseStopAudioCue; // 0x78(0x10)
	struct FString EmissaryRankLevelUpAudioCue; // 0x88(0x10)
	struct FString EmissaryRankTriggerAudioCue; // 0x98(0x10)
	struct FString EmissaryRankLevelUpMusicCue; // 0xa8(0x10)
};

// ScriptStruct Athena.CompanyProgressIcons
// Size: 0x18 (Inherited: 0x00)
struct FCompanyProgressIcons {
	struct TArray<struct FCompanyProgressIcon> Icons; // 0x00(0x10)
	uint32_t Step; // 0x10(0x04)
	char UnknownData_14[0x4]; // 0x14(0x04)
};

// ScriptStruct Athena.CompanyProgressIcon
// Size: 0x10 (Inherited: 0x00)
struct FCompanyProgressIcon {
	struct FStringAssetReference Icon; // 0x00(0x10)
};

// ScriptStruct Athena.CompanyReputationProgressModelCollection
// Size: 0x10 (Inherited: 0x00)
struct FCompanyReputationProgressModelCollection {
	struct TArray<struct FCompanyReputationProgressModel> CompanyProgress; // 0x00(0x10)
};

// ScriptStruct Athena.CompanyReputationProgressModel
// Size: 0x30 (Inherited: 0x00)
struct FCompanyReputationProgressModel {
	struct FName CompanyId; // 0x00(0x08)
	uint32_t Level; // 0x08(0x04)
	uint32_t DistinctionLevel; // 0x0c(0x04)
	uint32_t Xp; // 0x10(0x04)
	struct FCompanyLevelDefinition NextCompanyLevel; // 0x14(0x08)
	char UnknownData_1C[0x4]; // 0x1c(0x04)
	struct FString Sig; // 0x20(0x10)
};

// ScriptStruct Athena.CompanyLevelDefinition
// Size: 0x08 (Inherited: 0x00)
struct FCompanyLevelDefinition {
	uint32_t Level; // 0x00(0x04)
	uint32_t XpRequiredToAttain; // 0x04(0x04)
};

// ScriptStruct Athena.PlayerNewDistinctionLevelEvent
// Size: 0x10 (Inherited: 0x00)
struct FPlayerNewDistinctionLevelEvent {
	uint32_t NewDistinctionLevel; // 0x00(0x04)
	uint32_t PreviousDistinctionLevel; // 0x04(0x04)
	struct FName CompanyId; // 0x08(0x08)
};

// ScriptStruct Athena.PlayerNewLevelEvent
// Size: 0x10 (Inherited: 0x00)
struct FPlayerNewLevelEvent {
	uint32_t NewLevel; // 0x00(0x04)
	uint32_t PreviousLevel; // 0x04(0x04)
	struct FName CompanyId; // 0x08(0x08)
};

// ScriptStruct Athena.EventCompanyRankProgressUpdateNotification
// Size: 0x10 (Inherited: 0x00)
struct FEventCompanyRankProgressUpdateNotification {
	struct FName Company; // 0x00(0x08)
	uint32_t Rank; // 0x08(0x04)
	uint32_t PreviousRank; // 0x0c(0x04)
};

// ScriptStruct Athena.PlayerCompanyProgressUpdatedEvent
// Size: 0x01 (Inherited: 0x00)
struct FPlayerCompanyProgressUpdatedEvent {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.EventCompanyProgressUpdateNotification
// Size: 0x60 (Inherited: 0x00)
struct FEventCompanyProgressUpdateNotification {
	struct FCompanyReputationProgressModel CurrentProgress; // 0x00(0x30)
	struct FCompanyReputationProgressModel PreviousProgress; // 0x30(0x30)
};

// ScriptStruct Athena.AssociatedCompanies
// Size: 0x10 (Inherited: 0x00)
struct FAssociatedCompanies {
	struct UClass* Company; // 0x00(0x08)
	struct FName FeatureToggle; // 0x08(0x08)
};

// ScriptStruct Athena.CompanyValidationAssetUnit
// Size: 0x10 (Inherited: 0x00)
struct FCompanyValidationAssetUnit {
	struct UClass* Company; // 0x00(0x08)
	bool ShouldHaveLevels; // 0x08(0x01)
	bool ShouldHaveEmblems; // 0x09(0x01)
	char UnknownData_A[0x6]; // 0x0a(0x06)
};

// ScriptStruct Athena.ConstellationAudioPair
// Size: 0x18 (Inherited: 0x00)
struct FConstellationAudioPair {
	struct UClass* ConstellationClass; // 0x00(0x08)
	struct UWwiseEvent* AudioStartEvent; // 0x08(0x08)
	struct UWwiseEvent* AudioStopEvent; // 0x10(0x08)
};

// ScriptStruct Athena.NPCPurchaseList
// Size: 0x18 (Inherited: 0x00)
struct FNPCPurchaseList {
	struct AActor* NPC; // 0x00(0x08)
	struct TArray<struct UClass*> Items; // 0x08(0x10)
};

// ScriptStruct Athena.RegisterCeremonyInterface
// Size: 0x10 (Inherited: 0x00)
struct FRegisterCeremonyInterface {
	char UnknownData_0[0x10]; // 0x00(0x10)
};

// ScriptStruct Athena.ContestCeremonyEvent
// Size: 0x98 (Inherited: 0x00)
struct FContestCeremonyEvent {
	struct TArray<struct UWwiseEvent*> AudioEvents; // 0x00(0x10)
	struct TArray<char> SpecialEvents; // 0x10(0x10)
	struct FText NPCName; // 0x20(0x38)
	struct FText NPCMessageToAllPlayers; // 0x58(0x38)
	float TimeToEvent; // 0x90(0x04)
	char UnknownData_94[0x4]; // 0x94(0x04)
};

// ScriptStruct Athena.ContestEventSet
// Size: 0x18 (Inherited: 0x00)
struct FContestEventSet {
	struct TArray<struct FContestCeremonyEvent> Events; // 0x00(0x10)
	char BelongingStage; // 0x10(0x01)
	char StageTimePivot; // 0x11(0x01)
	char UnknownData_12[0x6]; // 0x12(0x06)
};

// ScriptStruct Athena.ShipIdentityOwnership
// Size: 0x180 (Inherited: 0x00)
struct FShipIdentityOwnership {
	struct FGuid OwningCrewID; // 0x00(0x10)
	struct FShipLiveryCatalogueEntry Identity; // 0x10(0x170)
};

// ScriptStruct Athena.ShipLiveryCatalogueEntry
// Size: 0x170 (Inherited: 0x00)
struct FShipLiveryCatalogueEntry {
	struct FGuid Id; // 0x00(0x10)
	struct FStringAssetReference Desc; // 0x10(0x10)
	struct FStringAssetReference RowboatLiveryDesc; // 0x20(0x10)
	struct TArray<struct FText> Names; // 0x30(0x10)
	struct UClass* ShipSize; // 0x40(0x08)
	bool AvailableToGame; // 0x48(0x01)
	char UnknownData_49[0x3]; // 0x49(0x03)
	struct FName FeatureName; // 0x4c(0x08)
	char UnknownData_54[0x4]; // 0x54(0x04)
	struct FText ShipTeamName; // 0x58(0x38)
	struct FText ArenaCrewWelcomeMessage; // 0x90(0x38)
	struct FText ShipUINotificationTeamName; // 0xc8(0x38)
	struct UTexture* ShipScrollTeamIcon; // 0x100(0x08)
	struct FStringAssetReference ShipToastTeamIcon; // 0x108(0x10)
	struct FStringAssetReference ShipToastTeamBackgroundImage; // 0x118(0x10)
	struct FStringAssetReference ShipToastForegroundArtWork; // 0x128(0x10)
	struct FStringAssetReference ShipTeamBackgroundImage; // 0x138(0x10)
	struct FName AudioEventName; // 0x148(0x08)
	struct FStringAssetReference TeamTavernBannerTexture; // 0x150(0x10)
	struct UTexture* CrewLiveryOverlayIcon; // 0x160(0x08)
	bool AvailableWhenFeatureEnabled; // 0x168(0x01)
	bool AvailableWhenFeatureDisabled; // 0x169(0x01)
	char UnknownData_16A[0x6]; // 0x16a(0x06)
};

// ScriptStruct Athena.ShipLiveryCatalogue
// Size: 0x10 (Inherited: 0x00)
struct FShipLiveryCatalogue {
	struct TArray<struct FShipLiveryCatalogueEntry> Liveries; // 0x00(0x10)
};

// ScriptStruct Athena.OwnedCrewCostumes
// Size: 0x20 (Inherited: 0x00)
struct FOwnedCrewCostumes {
	struct FGuid CrewId; // 0x00(0x10)
	struct TArray<struct UClass*> Costumes; // 0x10(0x10)
};

// ScriptStruct Athena.CaptureChatPerformanceTelemetryFragment
// Size: 0x08 (Inherited: 0x00)
struct FCaptureChatPerformanceTelemetryFragment {
	uint32_t MaxTotalSizeOfArrayAndMessagesInBytes; // 0x00(0x04)
	uint32_t MaxNumberOfMessages; // 0x04(0x04)
};

// ScriptStruct Athena.TimedContestEventAction
// Size: 0xe8 (Inherited: 0x00)
struct FTimedContestEventAction {
	char UnknownData_0[0x8]; // 0x00(0x08)
	struct FText NPCName; // 0x08(0x38)
	struct FText NPCMessageToAllPlayers; // 0x40(0x38)
	float Duration; // 0x78(0x04)
	char UnknownData_7C[0x4]; // 0x7c(0x04)
	struct TArray<char> SpecialEvents; // 0x80(0x10)
	struct TArray<struct UWwiseEvent*> AudioEvents; // 0x90(0x10)
	char UnknownData_A0[0x48]; // 0xa0(0x48)
};

// ScriptStruct Athena.ContestMapLayoutScoreInfo
// Size: 0x70 (Inherited: 0x00)
struct FContestMapLayoutScoreInfo {
	struct FTreasureMapWidgetTexture ScoreInfoIcon; // 0x00(0x30)
	struct FTreasureMapWidgetText ScoreInfoText; // 0x30(0x3c)
	char ScoreReason; // 0x6c(0x01)
	char UnknownData_6D[0x3]; // 0x6d(0x03)
};

// ScriptStruct Athena.ContestMapLayoutCrew
// Size: 0x108 (Inherited: 0x00)
struct FContestMapLayoutCrew {
	struct FTreasureMapWidgetTexture CrewIcon; // 0x00(0x30)
	struct FTreasureMapWidgetTexture ScoreIcon; // 0x30(0x30)
	struct FTreasureMapWidgetTexture UnderlineIcon; // 0x60(0x30)
	struct FTreasureMapWidgetText CrewName; // 0x90(0x3c)
	struct FTreasureMapWidgetText Score; // 0xcc(0x3c)
};

// ScriptStruct Athena.MerchantSpawnData
// Size: 0x50 (Inherited: 0x00)
struct FMerchantSpawnData {
	struct UClass* MerchantReference; // 0x00(0x20)
	struct FTransform MerchantTransform; // 0x20(0x30)
};

// ScriptStruct Athena.QuestVariableContestIslandArchetype
// Size: 0x30 (Inherited: 0x30)
struct FQuestVariableContestIslandArchetype : FQuestVariable {
};

// ScriptStruct Athena.ContestCrewRequirementData
// Size: 0x28 (Inherited: 0x00)
struct FContestCrewRequirementData {
	int32_t CrewCount; // 0x00(0x04)
	char UnknownData_4[0x4]; // 0x04(0x04)
	struct FString CrewCountServicesConfigRetrievalString; // 0x08(0x10)
	struct TArray<struct FShipSizeRequirementData> OpenCrewRequirementData; // 0x18(0x10)
};

// ScriptStruct Athena.ShipSizeRequirementData
// Size: 0x20 (Inherited: 0x00)
struct FShipSizeRequirementData {
	struct UClass* ShipSize; // 0x00(0x08)
	int32_t OpenCrewMemberCount; // 0x08(0x04)
	char UnknownData_C[0x4]; // 0x0c(0x04)
	struct FString OpenCrewCountRetrivalString; // 0x10(0x10)
};

// ScriptStruct Athena.ContestUIDescriptions
// Size: 0x80 (Inherited: 0x00)
struct FContestUIDescriptions {
	struct UPopUpMessageDesc* NewMapDesc; // 0x00(0x08)
	struct UPopUpMessageDesc* ShipSunkDesc; // 0x08(0x08)
	struct FText ContestStartBlindText; // 0x10(0x38)
	struct FText ContestEndBlindText; // 0x48(0x38)
};

// ScriptStruct Athena.ShipLiveryTeamSet
// Size: 0x10 (Inherited: 0x00)
struct FShipLiveryTeamSet {
	struct TArray<struct FShipLiveryCatalogueEntry> ShipCatalogue; // 0x00(0x10)
};

// ScriptStruct Athena.ContestShipLiverySet
// Size: 0x60 (Inherited: 0x00)
struct FContestShipLiverySet {
	struct FGuid OwningCrewID; // 0x00(0x10)
	struct TMap<struct UClass*, struct FGuid> ShipLiveryTeamSet; // 0x10(0x50)
};

// ScriptStruct Athena.OtherCrewMuteStateResponse
// Size: 0x01 (Inherited: 0x00)
struct FOtherCrewMuteStateResponse {
	char MuteState; // 0x00(0x01)
};

// ScriptStruct Athena.OtherCrewMuteStateRequest
// Size: 0x01 (Inherited: 0x00)
struct FOtherCrewMuteStateRequest {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.CrewMuteOthersPhrasesEvent
// Size: 0x01 (Inherited: 0x00)
struct FCrewMuteOthersPhrasesEvent {
	bool IsMuted; // 0x00(0x01)
};

// ScriptStruct Athena.CrewMutePlayerPhrasesEvent
// Size: 0x18 (Inherited: 0x00)
struct FCrewMutePlayerPhrasesEvent {
	struct FString XUID; // 0x00(0x10)
	bool IsMuted; // 0x10(0x01)
	char UnknownData_11[0x7]; // 0x11(0x07)
};

// ScriptStruct Athena.CrewMuteOthersChatEvent
// Size: 0x01 (Inherited: 0x00)
struct FCrewMuteOthersChatEvent {
	bool IsMuted; // 0x00(0x01)
};

// ScriptStruct Athena.CrewMutePlayerChatEvent
// Size: 0x18 (Inherited: 0x00)
struct FCrewMutePlayerChatEvent {
	struct FString XUID; // 0x00(0x10)
	bool IsMuted; // 0x10(0x01)
	char UnknownData_11[0x7]; // 0x11(0x07)
};

// ScriptStruct Athena.CrewMuteOthersVoiceEvent
// Size: 0x01 (Inherited: 0x00)
struct FCrewMuteOthersVoiceEvent {
	bool IsMuted; // 0x00(0x01)
};

// ScriptStruct Athena.CrewMutePlayerVoiceEvent
// Size: 0x18 (Inherited: 0x00)
struct FCrewMutePlayerVoiceEvent {
	struct FString XUID; // 0x00(0x10)
	bool IsMuted; // 0x10(0x01)
	char UnknownData_11[0x7]; // 0x11(0x07)
};

// ScriptStruct Athena.ContestCrewManagementMemberDataEvent
// Size: 0x10 (Inherited: 0x00)
struct FContestCrewManagementMemberDataEvent {
	struct TArray<struct FContestCrewManagementMemberData> Members; // 0x00(0x10)
};

// ScriptStruct Athena.ContestCrewManagementMemberData
// Size: 0x38 (Inherited: 0x00)
struct FContestCrewManagementMemberData {
	struct FString XUID; // 0x00(0x10)
	struct FString GamerTag; // 0x10(0x10)
	char Muted; // 0x20(0x01)
	char UnknownData_21[0x7]; // 0x21(0x07)
	struct FString CrewIcon; // 0x28(0x10)
};

// ScriptStruct Athena.ContestStopCrewManagementEvent
// Size: 0x01 (Inherited: 0x00)
struct FContestStopCrewManagementEvent {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.ContestRequestCrewManagementEvent
// Size: 0x01 (Inherited: 0x00)
struct FContestRequestCrewManagementEvent {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.ContestUpdateScoreBoardTimer
// Size: 0x10 (Inherited: 0x00)
struct FContestUpdateScoreBoardTimer {
	struct FString TimeRemaining; // 0x00(0x10)
};

// ScriptStruct Athena.ContestLaunchStartBlinds
// Size: 0x28 (Inherited: 0x10)
struct FContestLaunchStartBlinds : FNetworkEventStruct {
	struct FGuid CrewId; // 0x10(0x10)
	float DisplayDuration; // 0x20(0x04)
	char UnknownData_24[0x4]; // 0x24(0x04)
};

// ScriptStruct Athena.StagingPlayerWelcomingPopup
// Size: 0x20 (Inherited: 0x10)
struct FStagingPlayerWelcomingPopup : FNetworkEventStruct {
	struct FGuid LiveryID; // 0x10(0x10)
};

// ScriptStruct Athena.ContestShipSinkNetworkEvent
// Size: 0x20 (Inherited: 0x10)
struct FContestShipSinkNetworkEvent : FNetworkEventStruct {
	struct FGuid CrewLiveryId; // 0x10(0x10)
};

// ScriptStruct Athena.ContestEndEvent
// Size: 0x30 (Inherited: 0x00)
struct FContestEndEvent {
	int32_t Position; // 0x00(0x04)
	char UnknownData_4[0x4]; // 0x04(0x04)
	struct FString Message; // 0x08(0x10)
	struct TArray<struct FScoreboardItems> Scores; // 0x18(0x10)
	float HoldDuration; // 0x28(0x04)
	char UnknownData_2C[0x4]; // 0x2c(0x04)
};

// ScriptStruct Athena.ScoreboardItems
// Size: 0x38 (Inherited: 0x00)
struct FScoreboardItems {
	struct FString Icon; // 0x00(0x10)
	struct FString CrewName; // 0x10(0x10)
	struct FString Score; // 0x20(0x10)
	bool IsMyCrew; // 0x30(0x01)
	char UnknownData_31[0x7]; // 0x31(0x07)
};

// ScriptStruct Athena.ContestStartEvent
// Size: 0x48 (Inherited: 0x00)
struct FContestStartEvent {
	struct FString Message; // 0x00(0x10)
	struct FString CrewIcon; // 0x10(0x10)
	struct FString CrewName; // 0x20(0x10)
	struct TArray<struct FString> CrewMembers; // 0x30(0x10)
	float HoldDuration; // 0x40(0x04)
	char UnknownData_44[0x4]; // 0x44(0x04)
};

// ScriptStruct Athena.ContestNotificationNetworkEvent
// Size: 0x18 (Inherited: 0x10)
struct FContestNotificationNetworkEvent : FNetworkEventStruct {
	struct UPopUpMessageDesc* PopUpDesc; // 0x10(0x08)
};

// ScriptStruct Athena.ContestRequestScoreBoardData
// Size: 0x10 (Inherited: 0x10)
struct FContestRequestScoreBoardData : FNetworkEventStruct {
};

// ScriptStruct Athena.RequestContestStateEvent
// Size: 0x10 (Inherited: 0x10)
struct FRequestContestStateEvent : FNetworkEventStruct {
};

// ScriptStruct Athena.ContestStateChangedEvent
// Size: 0x18 (Inherited: 0x10)
struct FContestStateChangedEvent : FNetworkEventStruct {
	char ContestState; // 0x10(0x01)
	char UnknownData_11[0x7]; // 0x11(0x07)
};

// ScriptStruct Athena.UpdateScoreBalanceHUDEvent
// Size: 0x20 (Inherited: 0x10)
struct FUpdateScoreBalanceHUDEvent : FNetworkEventStruct {
	struct TArray<struct FContestLeaderboardEntry> ContestLeaderboard; // 0x10(0x10)
};

// ScriptStruct Athena.ContestLeaderboardEntry
// Size: 0x38 (Inherited: 0x10)
struct FContestLeaderboardEntry : FNetworkEventStruct {
	struct FString CrewIconPath; // 0x10(0x10)
	bool IsMyCrew; // 0x20(0x01)
	char UnknownData_21[0x3]; // 0x21(0x03)
	int32_t Amount; // 0x24(0x04)
	struct FString DisplayAmount; // 0x28(0x10)
};

// ScriptStruct Athena.ScoreGrantedNotificationUIEvent
// Size: 0x30 (Inherited: 0x00)
struct FScoreGrantedNotificationUIEvent {
	char ScoreId; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct FString DisplayAmount; // 0x08(0x10)
	int32_t Amount; // 0x18(0x04)
	char UnknownData_1C[0x4]; // 0x1c(0x04)
	struct FString ScoringIconPath; // 0x20(0x10)
};

// ScriptStruct Athena.WeightedContestList
// Size: 0x28 (Inherited: 0x00)
struct FWeightedContestList {
	char UnknownData_0[0x8]; // 0x00(0x08)
	struct TArray<struct FWeightedEmergentContestVoyageRecipe> WeightedContests; // 0x08(0x10)
	struct TArray<struct FWeightedTallTaleContestRecipe> WeightedTallTaleContests; // 0x18(0x10)
};

// ScriptStruct Athena.WeightedTallTaleContestRecipe
// Size: 0x10 (Inherited: 0x00)
struct FWeightedTallTaleContestRecipe {
	struct UTallTaleContestRecipeDataAsset* TallTaleContest; // 0x00(0x08)
	int32_t WeightedChance; // 0x08(0x04)
	char UnknownData_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct Athena.WeightedEmergentContestVoyageRecipe
// Size: 0x10 (Inherited: 0x00)
struct FWeightedEmergentContestVoyageRecipe {
	struct UEmergentContestVoyageRecipeDataAsset* ContestVoyage; // 0x00(0x08)
	int32_t WeightedChance; // 0x08(0x04)
	char UnknownData_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct Athena.TallTaleContestInfo
// Size: 0x20 (Inherited: 0x00)
struct FTallTaleContestInfo {
	struct TArray<struct UClass*> ValidShipTypes; // 0x00(0x10)
	struct FWeightedTallTaleContestRecipe WeightedTallTaleContest; // 0x10(0x10)
};

// ScriptStruct Athena.ContestVoyageInfo
// Size: 0x20 (Inherited: 0x00)
struct FContestVoyageInfo {
	struct TArray<struct UClass*> ValidShipTypes; // 0x00(0x10)
	struct FWeightedEmergentContestVoyageRecipe WeightedContestVoyage; // 0x10(0x10)
};

// ScriptStruct Athena.ContestVoyagesSelectorUnit
// Size: 0x10 (Inherited: 0x00)
struct FContestVoyagesSelectorUnit {
	struct FName FeatureToggle; // 0x00(0x08)
	struct UContestVoyagesDataAsset* ContestVoyages; // 0x08(0x08)
};

// ScriptStruct Athena.CachedRespawnPoint
// Size: 0x50 (Inherited: 0x00)
struct FCachedRespawnPoint {
	struct FGuid CrewId; // 0x00(0x10)
	struct FTransform AllocatedRespawnPoint; // 0x10(0x30)
	struct AShipSpawnLocation* AllocatedSpawnLocation; // 0x40(0x08)
	char UnknownData_48[0x8]; // 0x48(0x08)
};

// ScriptStruct Athena.ContestZoneVendorShipData
// Size: 0x50 (Inherited: 0x00)
struct FContestZoneVendorShipData {
	struct UClass* VendorShipToSpawn; // 0x00(0x20)
	struct FTransform ContestZoneWorldLocation; // 0x20(0x30)
};

// ScriptStruct Athena.CoordinatedKrakenTentacleSpawnInfo
// Size: 0xc0 (Inherited: 0x00)
struct FCoordinatedKrakenTentacleSpawnInfo {
	struct FTransform SpawnTransform; // 0x00(0x30)
	struct FTransform FinalSpawnTransform; // 0x30(0x30)
	int32_t ClientCapsuleCullCount; // 0x60(0x04)
	bool ShouldDockToTargetActor; // 0x64(0x01)
	bool RequiresBoxCollider; // 0x65(0x01)
	bool RequiresKnockback; // 0x66(0x01)
	char UnknownData_67[0x1]; // 0x67(0x01)
	struct FVector BoxExtents; // 0x68(0x0c)
	char UnknownData_74[0xc]; // 0x74(0x0c)
	struct FTransform BoxOffset; // 0x80(0x30)
	struct AKrakenAnimatedTentacle* SpawnedTentacle; // 0xb0(0x08)
	char UnknownData_B8[0x8]; // 0xb8(0x08)
};

// ScriptStruct Athena.CrestPartDesc
// Size: 0x18 (Inherited: 0x00)
struct FCrestPartDesc {
	struct UStaticMesh* CrestMesh; // 0x00(0x08)
	struct TArray<struct UMaterialInterface*> CrestMaterials; // 0x08(0x10)
};

// ScriptStruct Athena.ProposedTaleEntry
// Size: 0x20 (Inherited: 0x00)
struct FProposedTaleEntry {
	struct UVoyageDescDataAsset* TaleData; // 0x00(0x08)
	struct UVoyageProposalDesc* TaleProposal; // 0x08(0x08)
	struct AActor* ProposingObject; // 0x10(0x08)
	bool CanStartTale; // 0x18(0x01)
	char UnknownData_19[0x7]; // 0x19(0x07)
};

// ScriptStruct Athena.ProposedVoyageEntry
// Size: 0x30 (Inherited: 0x00)
struct FProposedVoyageEntry {
	struct UVoyageProposalDesc* ProposalDesc; // 0x00(0x08)
	struct UVoyageProposalDesc* TemplateProposalDesc; // 0x08(0x08)
	struct UVoyageRecipeDataAsset* VoyageRecipe; // 0x10(0x08)
	int32_t Rank; // 0x18(0x04)
	char UnknownData_1C[0x4]; // 0x1c(0x04)
	struct AAthenaPlayerState* ProposingPlayerState; // 0x20(0x08)
	bool VoyageIsShipEntitlement; // 0x28(0x01)
	bool WantDiveToTunnel; // 0x29(0x01)
	char UnknownData_2A[0x6]; // 0x2a(0x06)
};

// ScriptStruct Athena.ShipCustomizationLoadoutPartCustomizations
// Size: 0x10 (Inherited: 0x00)
struct FShipCustomizationLoadoutPartCustomizations {
	struct TArray<struct FPartDesc> Parts; // 0x00(0x10)
};

// ScriptStruct Athena.PartDesc
// Size: 0x20 (Inherited: 0x00)
struct FPartDesc {
	struct FString Name; // 0x00(0x10)
	struct TArray<struct FPartCustomisation> Customisations; // 0x10(0x10)
};

// ScriptStruct Athena.PartCustomisation
// Size: 0x20 (Inherited: 0x00)
struct FPartCustomisation {
	struct FString Category; // 0x00(0x10)
	struct FStringAssetReference Customisation; // 0x10(0x10)
};

// ScriptStruct Athena.SinkShipGameServerRequestModel
// Size: 0x04 (Inherited: 0x00)
struct FSinkShipGameServerRequestModel {
	int32_t ShipNetGUID; // 0x00(0x04)
};

// ScriptStruct Athena.CustomTriggerData
// Size: 0xb8 (Inherited: 0x00)
struct FCustomTriggerData {
	struct ATriggerBase* TriggerObject; // 0x00(0x08)
	struct TMap<int32_t, char> EntitiesToTrigger; // 0x08(0x50)
	struct TMap<int32_t, struct FCustomItemDetectionData> ItemsToTrigger; // 0x58(0x50)
	bool DetectingPlayers; // 0xa8(0x01)
	bool DetectingShips; // 0xa9(0x01)
	bool DetectingEnemies; // 0xaa(0x01)
	char UnknownData_AB[0x5]; // 0xab(0x05)
	struct UTriggerCollisionHelper* CollisionHelper; // 0xb0(0x08)
};

// ScriptStruct Athena.CustomItemDetectionData
// Size: 0x10 (Inherited: 0x00)
struct FCustomItemDetectionData {
	char UnknownData_0[0x10]; // 0x00(0x10)
};

// ScriptStruct Athena.ObjectHitDetectedEvent
// Size: 0x40 (Inherited: 0x00)
struct FObjectHitDetectedEvent {
	char UnknownData_0[0x40]; // 0x00(0x40)
};

// ScriptStruct Athena.ProjectileLauncherMechanismSourceShipParams
// Size: 0x40 (Inherited: 0x00)
struct FProjectileLauncherMechanismSourceShipParams {
	struct UClass* ShipSize; // 0x00(0x08)
	struct FProjectileLauncherMechanismSourceWatercraftParams Params; // 0x08(0x38)
};

// ScriptStruct Athena.ProjectileLauncherMechanismSourceWatercraftParams
// Size: 0x38 (Inherited: 0x00)
struct FProjectileLauncherMechanismSourceWatercraftParams {
	float ShipBoundsMultiplier; // 0x00(0x04)
	float NearMissChance; // 0x04(0x04)
	struct FWeightedProbabilityRangeOfRanges NearMissShipOffsetInMetres; // 0x08(0x30)
};

// ScriptStruct Athena.LevelOfDamageProperties
// Size: 0x90 (Inherited: 0x00)
struct FLevelOfDamageProperties {
	float LeakAmount; // 0x00(0x04)
	float RepairTime; // 0x04(0x04)
	float UndoRepairTime; // 0x08(0x04)
	float NonOwningCrewUndoRepairTime; // 0x0c(0x04)
	struct UMaterialInterface* HoleDecalMaterial; // 0x10(0x08)
	char UnknownData_18[0x8]; // 0x18(0x08)
	struct FTransform HoleDecalComponentTransform; // 0x20(0x30)
	struct FVector ParticleSystemComponentLocation; // 0x50(0x0c)
	float InternalWaterSamplePositionTopOffset; // 0x5c(0x04)
	float InternalWaterSamplePositionBottomOffset; // 0x60(0x04)
	char UnknownData_64[0x4]; // 0x64(0x04)
	struct UParticleSystem* ParticleSystem_WaterLeakAboveWater; // 0x68(0x08)
	struct UParticleSystem* ParticleSystem_WaterLeakBelowWater; // 0x70(0x08)
	struct UParticleSystem* ParticleSystem_RepairLeakAboveWater; // 0x78(0x08)
	struct UParticleSystem* ParticleSystem_RepairLeakBelowWater; // 0x80(0x08)
	struct UParticleSystem* ParticleSystem_SplashOnInternalWaterSurface; // 0x88(0x08)
};

// ScriptStruct Athena.AuthorityRepairableState
// Size: 0x18 (Inherited: 0x00)
struct FAuthorityRepairableState {
	char RepairableState; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct TArray<struct AActor*> RepairingList; // 0x08(0x10)
};

// ScriptStruct Athena.DeferralReasonPopUpNotificationInfo
// Size: 0x18 (Inherited: 0x00)
struct FDeferralReasonPopUpNotificationInfo {
	struct FString DeferralReason; // 0x00(0x10)
	struct UPopUpMessageDesc* PopUp; // 0x10(0x08)
};

// ScriptStruct Athena.MultipleNPCCompaniesRedirectionData
// Size: 0x48 (Inherited: 0x00)
struct FMultipleNPCCompaniesRedirectionData {
	struct TArray<struct UClass*> Companies; // 0x00(0x10)
	struct FText VisitNPCTooltip; // 0x10(0x38)
};

// ScriptStruct Athena.SingleNPCCompanyRedirectionData
// Size: 0x40 (Inherited: 0x00)
struct FSingleNPCCompanyRedirectionData {
	struct UClass* Company; // 0x00(0x08)
	struct FText VisitNPCTooltip; // 0x08(0x38)
};

// ScriptStruct Athena.ItemDiggingAnimationOverride
// Size: 0x18 (Inherited: 0x00)
struct FItemDiggingAnimationOverride {
	struct TArray<struct UClass*> Classes; // 0x00(0x10)
	struct UItemDiggingAnimationConfig* DiggingAnimationConfig; // 0x10(0x08)
};

// ScriptStruct Athena.ItemDiggingAudioOverride
// Size: 0x18 (Inherited: 0x00)
struct FItemDiggingAudioOverride {
	struct TArray<struct UClass*> Classes; // 0x00(0x10)
	struct UItemDiggingAudioConfig* DiggingAudioConfig; // 0x10(0x08)
};

// ScriptStruct Athena.ItemDiggingBaseOverride
// Size: 0x18 (Inherited: 0x00)
struct FItemDiggingBaseOverride {
	struct TArray<struct UClass*> Classes; // 0x00(0x10)
	struct UItemDiggingBaseConfig* DiggingBaseConfig; // 0x10(0x08)
};

// ScriptStruct Athena.ItemBuryingBaseOverride
// Size: 0x18 (Inherited: 0x00)
struct FItemBuryingBaseOverride {
	struct TArray<struct UClass*> Classes; // 0x00(0x10)
	struct UItemDiggingBuryConfig* BuryingConfig; // 0x10(0x08)
};

// ScriptStruct Athena.ItemDiggingEffectsOverride
// Size: 0x18 (Inherited: 0x00)
struct FItemDiggingEffectsOverride {
	struct TArray<struct UClass*> Classes; // 0x00(0x10)
	struct UItemDiggingEffectsConfig* DiggingEffectsConfig; // 0x10(0x08)
};

// ScriptStruct Athena.DioramaDebugMenuEntry
// Size: 0x30 (Inherited: 0x00)
struct FDioramaDebugMenuEntry {
	struct UAISpawner* Spawner; // 0x00(0x08)
	struct UAIDioramaDesc* DioramaDesc; // 0x08(0x08)
	struct FString DioramaName; // 0x10(0x10)
	struct FString TaleId; // 0x20(0x10)
};

// ScriptStruct Athena.DrapesPartDesc
// Size: 0x08 (Inherited: 0x00)
struct FDrapesPartDesc {
	struct UMaterialInterface* DrapesMaterial; // 0x00(0x08)
};

// ScriptStruct Athena.DrunkennessSetupData
// Size: 0x14 (Inherited: 0x00)
struct FDrunkennessSetupData {
	char DrunkennessType; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	float MaxDrunkenness; // 0x04(0x04)
	float GettingDrunkDrunkennessChangePerSec; // 0x08(0x04)
	float SoberingUpDrunkennessChangePerSec; // 0x0c(0x04)
	bool AutoSoberUpWhenFullyDrunk; // 0x10(0x01)
	char UnknownData_11[0x3]; // 0x11(0x03)
};

// ScriptStruct Athena.EmissaryRewardMultiplierModel
// Size: 0x18 (Inherited: 0x00)
struct FEmissaryRewardMultiplierModel {
	struct FName EmissaryName; // 0x00(0x08)
	struct TArray<struct FEmissaryLevelMultiplierModel> Multipliers; // 0x08(0x10)
};

// ScriptStruct Athena.EmissaryLevelMultiplierModel
// Size: 0x08 (Inherited: 0x00)
struct FEmissaryLevelMultiplierModel {
	int32_t Level; // 0x00(0x04)
	float Multiplier; // 0x04(0x04)
};

// ScriptStruct Athena.EmissaryDisplayInformation
// Size: 0x90 (Inherited: 0x00)
struct FEmissaryDisplayInformation {
	struct FText Title; // 0x00(0x38)
	struct FText Description; // 0x38(0x38)
	struct FStringAssetReference KeyArt; // 0x70(0x10)
	struct FStringAssetReference Icon; // 0x80(0x10)
};

// ScriptStruct Athena.EmoteFlourishCategoryMapping
// Size: 0xc8 (Inherited: 0x00)
struct FEmoteFlourishCategoryMapping {
	struct UClass* ItemCategory; // 0x00(0x08)
	struct FStringAssetReference IconPath; // 0x08(0x10)
	struct FEmoteData EmoteData; // 0x18(0xa0)
	struct FString PairName; // 0xb8(0x10)
};

// ScriptStruct Athena.EntitlementsFailedEvent
// Size: 0x10 (Inherited: 0x00)
struct FEntitlementsFailedEvent {
	struct FString Id; // 0x00(0x10)
};

// ScriptStruct Athena.EntitlementsResponseEvent
// Size: 0x20 (Inherited: 0x00)
struct FEntitlementsResponseEvent {
	struct TArray<struct FEntitlementItem> Entitlements; // 0x00(0x10)
	struct FString Id; // 0x10(0x10)
};

// ScriptStruct Athena.EntitlementItem
// Size: 0xa8 (Inherited: 0x00)
struct FEntitlementItem {
	struct FText Description; // 0x00(0x38)
	bool Owned; // 0x38(0x01)
	char UnknownData_39[0x7]; // 0x39(0x07)
	struct FStringAssetReference PreviewImageUrl; // 0x40(0x10)
	struct FStringAssetReference ThumbnailImageUrl; // 0x50(0x10)
	struct FText DisplayName; // 0x60(0x38)
	struct FString Id; // 0x98(0x10)
};

// ScriptStruct Athena.EntitlementsRequestEvent
// Size: 0x20 (Inherited: 0x00)
struct FEntitlementsRequestEvent {
	struct TArray<struct FString> EntitlementIds; // 0x00(0x10)
	struct FString Id; // 0x10(0x10)
};

// ScriptStruct Athena.RequiredClothingData
// Size: 0x18 (Inherited: 0x00)
struct FRequiredClothingData {
	int32_t RequiredNumberToMatch; // 0x00(0x04)
	char UnknownData_4[0x4]; // 0x04(0x04)
	struct TArray<struct UClass*> RequiredClothing; // 0x08(0x10)
};

// ScriptStruct Athena.ItemRequirementData
// Size: 0x18 (Inherited: 0x00)
struct FItemRequirementData {
	int32_t RequiredNumberToMatch; // 0x00(0x04)
	char UnknownData_4[0x4]; // 0x04(0x04)
	struct TArray<struct UClass*> RequiredItemsInLoadout; // 0x08(0x10)
};

// ScriptStruct Athena.EventTaleQuestServiceEntry
// Size: 0x18 (Inherited: 0x00)
struct FEventTaleQuestServiceEntry {
	char UnknownData_0[0x18]; // 0x00(0x18)
};

// ScriptStruct Athena.EventObjectStateMigrationImpl
// Size: 0x10 (Inherited: 0x00)
struct FEventObjectStateMigrationImpl {
	char UnknownData_0[0x10]; // 0x00(0x10)
};

// ScriptStruct Athena.EventReceiveExplosiveComponentState
// Size: 0x08 (Inherited: 0x00)
struct FEventReceiveExplosiveComponentState {
	struct UExplosiveComponent* Source; // 0x00(0x08)
};

// ScriptStruct Athena.ShipHullDamageParams
// Size: 0x10 (Inherited: 0x00)
struct FShipHullDamageParams {
	struct TArray<struct FShipHullDamageLevel> DamageLevels; // 0x00(0x10)
};

// ScriptStruct Athena.ShipHullDamageLevel
// Size: 0x18 (Inherited: 0x00)
struct FShipHullDamageLevel {
	struct UClass* SpeedBand; // 0x00(0x08)
	struct TArray<struct FShipHullDamageTypeEntry> Params; // 0x08(0x10)
};

// ScriptStruct Athena.ShipHullDamageTypeEntry
// Size: 0x48 (Inherited: 0x00)
struct FShipHullDamageTypeEntry {
	char DamageType; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct FShipHullLandscapeDamageEntry LandscapeDamageParams; // 0x08(0x30)
	struct FShipHullRammingSpurDamageEntry RammingSpurDamageParams; // 0x38(0x10)
};

// ScriptStruct Athena.ShipHullRammingSpurDamageEntry
// Size: 0x10 (Inherited: 0x00)
struct FShipHullRammingSpurDamageEntry {
	struct TArray<struct FShipDamageEntry> DamageAppliedToSelf; // 0x00(0x10)
};

// ScriptStruct Athena.ShipDamageEntry
// Size: 0x50 (Inherited: 0x00)
struct FShipDamageEntry {
	struct UClass* OtherShipSize; // 0x00(0x08)
	struct UForceFeedbackEffect* ForceFeedbackEffect; // 0x08(0x08)
	struct FInt32Range NumZonesToDamageForInstigator; // 0x10(0x10)
	struct FInt32Range DamageLevelForInstigator; // 0x20(0x10)
	struct FInt32Range NumZonesToDamageForReceiver; // 0x30(0x10)
	struct FInt32Range DamageLevelForReceiver; // 0x40(0x10)
};

// ScriptStruct Athena.ShipHullLandscapeDamageEntry
// Size: 0x30 (Inherited: 0x00)
struct FShipHullLandscapeDamageEntry {
	char PhysicalSurface; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct UForceFeedbackEffect* ForceFeedbackEffect; // 0x08(0x08)
	struct FInt32Range NumZonesToDamage; // 0x10(0x10)
	struct FInt32Range DamageLevel; // 0x20(0x10)
};

// ScriptStruct Athena.RammableExplosiveEntry
// Size: 0x10 (Inherited: 0x00)
struct FRammableExplosiveEntry {
	struct UClass* RammerType; // 0x00(0x08)
	struct UClass* MinimumSpeedForExplosion; // 0x08(0x08)
};

// ScriptStruct Athena.ChargedAttackProjectileWeights
// Size: 0x08 (Inherited: 0x00)
struct FChargedAttackProjectileWeights {
	float ChargeTime; // 0x00(0x04)
	float Weight; // 0x04(0x04)
};

// ScriptStruct Athena.QuestVariablePlayerStat
// Size: 0x30 (Inherited: 0x30)
struct FQuestVariablePlayerStat : FQuestVariable {
};

// ScriptStruct Athena.ClassicFireworkDebugList
// Size: 0x70 (Inherited: 0x00)
struct FClassicFireworkDebugList {
	struct TArray<struct UItemDescSpawnData*> Peony; // 0x00(0x10)
	struct TArray<struct UItemDescSpawnData*> Crackle; // 0x10(0x10)
	struct TArray<struct UItemDescSpawnData*> Strobe; // 0x20(0x10)
	struct TArray<struct UItemDescSpawnData*> Brocade; // 0x30(0x10)
	struct TArray<struct UItemDescSpawnData*> Comet; // 0x40(0x10)
	struct TArray<struct UItemDescSpawnData*> HummingSnakes; // 0x50(0x10)
	struct TArray<struct UItemDescSpawnData*> Cakes; // 0x60(0x10)
};

// ScriptStruct Athena.FireworkDebugListByFireworkType
// Size: 0x20 (Inherited: 0x00)
struct FFireworkDebugListByFireworkType {
	struct TArray<struct UItemDescSpawnData*> Rockets; // 0x00(0x10)
	struct TArray<struct UItemDescSpawnData*> Cakes; // 0x10(0x10)
};

// ScriptStruct Athena.FlameOfFateEffectParams
// Size: 0x0c (Inherited: 0x00)
struct FFlameOfFateEffectParams {
	bool ShouldAffectShadowFormAI; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	float FlameOfFateEffectRadiusIdle; // 0x04(0x04)
	float FlameOfFateEffectRadiusActive; // 0x08(0x04)
};

// ScriptStruct Athena.CycleFlameOfFateParams
// Size: 0x78 (Inherited: 0x00)
struct FCycleFlameOfFateParams {
	bool IncludeCycleFlameOfFateOneShotResponse; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct UClass* OneShotResponseNotificationInputId; // 0x08(0x08)
	bool IncludeCycleFlameOfFateActionRule; // 0x10(0x01)
	char UnknownData_11[0x7]; // 0x11(0x07)
	struct UClass* ActionRuleNotificationInputId; // 0x18(0x08)
	char ActionRulePriority; // 0x20(0x01)
	char UnknownData_21[0x7]; // 0x21(0x07)
	struct FText CycleFlameOfFateActionRuleVerbiage; // 0x28(0x38)
	struct FCycleFlameOfFateSequence FlameOfFateSequence; // 0x60(0x18)
};

// ScriptStruct Athena.TakeFlameOfFateParams
// Size: 0xf8 (Inherited: 0x00)
struct FTakeFlameOfFateParams {
	bool IncludeTakeFlameOfFateActionRule; // 0x00(0x01)
	char UnknownData_1[0x7]; // 0x01(0x07)
	struct UClass* ActionRuleNotificationInputId; // 0x08(0x08)
	char ActionRulePriority; // 0x10(0x01)
	char UnknownData_11[0x7]; // 0x11(0x07)
	struct FText TakeFlameOfFateTooltipText; // 0x18(0x38)
	struct FText LanternNotRaisedToolTipText; // 0x50(0x38)
	struct FText NotWieldingFlameTooltipText; // 0x88(0x38)
	struct FText CannotSetFlameTooltipText; // 0xc0(0x38)
};

// ScriptStruct Athena.FlameOfFateAudioParams
// Size: 0x10 (Inherited: 0x00)
struct FFlameOfFateAudioParams {
	struct UWwiseObjectPoolWrapper* SfxPool; // 0x00(0x08)
	struct UWwiseEvent* FlameOfFateTypeChangedAudioEvent; // 0x08(0x08)
};

// ScriptStruct Athena.SailWithFlameOfFateColoursAboardStatData
// Size: 0x0c (Inherited: 0x00)
struct FSailWithFlameOfFateColoursAboardStatData {
	uint32_t NumberOfUniqueFlameColoursAboard; // 0x00(0x04)
	struct FPlayerStat DefaultStatToFire; // 0x04(0x04)
	struct FPlayerStat AllianceStatToFire; // 0x08(0x04)
};

// ScriptStruct Athena.FlamesOfFateShipInfo
// Size: 0x10 (Inherited: 0x00)
struct FFlamesOfFateShipInfo {
	struct UClass* ShipSize; // 0x00(0x08)
	uint32_t NumLanterns; // 0x08(0x04)
	char UnknownData_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct Athena.FlamesOfFateFlameInfo
// Size: 0x28 (Inherited: 0x00)
struct FFlamesOfFateFlameInfo {
	char FlameOfFateType; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	struct FColor LightColour; // 0x04(0x04)
	struct FColor FXColour; // 0x08(0x04)
	struct FColor GlowColour; // 0x0c(0x04)
	struct FColor FlameColour; // 0x10(0x04)
	char UnknownData_14[0x4]; // 0x14(0x04)
	struct UTexture* FlameTexture; // 0x18(0x08)
	struct FPlayerStat StatToFireWhenTaken; // 0x20(0x04)
	struct FPlayerStat StatToFireWhenTakenInAlliance; // 0x24(0x04)
};

// ScriptStruct Athena.FogBankStoryRelatedSettings
// Size: 0x24 (Inherited: 0x00)
struct FFogBankStoryRelatedSettings {
	struct FStoryFlag Story; // 0x00(0x08)
	float Density; // 0x08(0x04)
	struct FLinearColor FogColour; // 0x0c(0x10)
	float FadeInDuration; // 0x1c(0x04)
	float MaximumAudioFogIntensityRTPC; // 0x20(0x04)
};

// ScriptStruct Athena.FeatureToggledFogBankAsset
// Size: 0x18 (Inherited: 0x00)
struct FFeatureToggledFogBankAsset {
	struct FFeatureFlag FeatureToggle; // 0x00(0x0c)
	char UnknownData_C[0x4]; // 0x0c(0x04)
	struct UFogBankDataAsset* Asset; // 0x10(0x08)
};

// ScriptStruct Athena.FogBankSettings
// Size: 0x4c (Inherited: 0x00)
struct FFogBankSettings {
	char FogState; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	float Density; // 0x04(0x04)
	struct FVector Scale; // 0x08(0x0c)
	struct FLinearColor FogColour; // 0x14(0x10)
	float FadeInDuration; // 0x24(0x04)
	float ActiveDuration; // 0x28(0x04)
	float FadeOutDuration; // 0x2c(0x04)
	bool Persistent; // 0x30(0x01)
	char UnknownData_31[0x3]; // 0x31(0x03)
	float PreviousDensity; // 0x34(0x04)
	struct FLinearColor PreviousFogColour; // 0x38(0x10)
	float MaximumAudioFogIntensityRTPC; // 0x48(0x04)
};

// ScriptStruct Athena.FogColourForSea
// Size: 0x18 (Inherited: 0x00)
struct FFogColourForSea {
	struct UClass* Sea; // 0x00(0x08)
	struct FLinearColor Colour; // 0x08(0x10)
};

// ScriptStruct Athena.FogBankManagerIslandNamesToKeepAwayFrom
// Size: 0x0c (Inherited: 0x00)
struct FFogBankManagerIslandNamesToKeepAwayFrom {
	struct FName IslandName; // 0x00(0x08)
	float MinimumDistanceFromIslandInKm; // 0x08(0x04)
};

// ScriptStruct Athena.FogBankManagerIslandTypesToKeepAwayFrom
// Size: 0x08 (Inherited: 0x00)
struct FFogBankManagerIslandTypesToKeepAwayFrom {
	char IslandType; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	float MinimumDistanceFromIslandInKm; // 0x04(0x04)
};

// ScriptStruct Athena.FogBankManagerFogBankTemplate
// Size: 0x48 (Inherited: 0x00)
struct FFogBankManagerFogBankTemplate {
	float Weight; // 0x00(0x04)
	char UnknownData_4[0x4]; // 0x04(0x04)
	struct TArray<struct UClass*> FogBanks; // 0x08(0x10)
	struct FWeightedProbabilityRangeOfRanges DistanceFromIslandInKm; // 0x18(0x30)
};

// ScriptStruct Athena.FragileComponentHealthScalarEntry
// Size: 0x08 (Inherited: 0x00)
struct FFragileComponentHealthScalarEntry {
	char HealthChangedReason; // 0x00(0x01)
	char UnknownData_1[0x3]; // 0x01(0x03)
	float HealthChangeScalar; // 0x04(0x04)
};

// ScriptStruct Athena.FragileComponentShipDamageTypeEntry
// Size: 0x10 (Inherited: 0x00)
struct FFragileComponentShipDamageTypeEntry {
	struct UClass* ShipDamagerType; // 0x00(0x08)
	float HealthChangePropagated; // 0x08(0x04)
	char UnknownData_C[0x4]; // 0x0c(0x04)
};

// ScriptStruct Athena.FuseComponentMetaWrapper
// Size: 0x28 (Inherited: 0x18)
struct FFuseComponentMetaWrapper : FItemMetaBase {
	struct AActor* Instigator; // 0x18(0x08)
	bool FuseEnabled; // 0x20(0x01)
	char UnknownData_21[0x3]; // 0x21(0x03)
	float FuseTimeScale; // 0x24(0x04)
};

// ScriptStruct Athena.ItemMetaBase
// Size: 0x18 (Inherited: 0x00)
struct FItemMetaBase {
	char UnknownData_0[0x8]; // 0x00(0x08)
	struct FStringAssetReference StoredStructType; // 0x08(0x10)
};

// ScriptStruct Athena.ActivePlayerState
// Size: 0xe8 (Inherited: 0x00)
struct FActivePlayerState {
	char UnknownData_0[0xe8]; // 0x00(0xe8)
};

// ScriptStruct Athena.EventInactivityDetectionActionPerformed
// Size: 0x80 (Inherited: 0x00)
struct FEventInactivityDetectionActionPerformed {
	struct FPirateIdentity PirateIdentity; // 0x00(0x78)
	struct FName ActionName; // 0x78(0x08)
};

// ScriptStruct Athena.PirateIdentity
// Size: 0x78 (Inherited: 0x00)
struct FPirateIdentity {
	struct FUniqueNetIdRepl UserId; // 0x00(0x18)
	struct FString PirateId; // 0x18(0x10)
	struct TMap<struct FString, struct FString> Claims; // 0x28(0x50)
};

// ScriptStruct Athena.AnimationLODParameters
// Size: 0x10 (Inherited: 0x00)
struct FAnimationLODParameters {
	int32_t MaxIKEntities; // 0x00(0x04)
	float MaxIKDistance; // 0x04(0x04)
	float MinLODSolverDistance; // 0x08(0x04)
	float MinFootPlantingActiveDistance; // 0x0c(0x04)
};

// ScriptStruct Athena.GenericPartDesc
// Size: 0x18 (Inherited: 0x00)
struct FGenericPartDesc {
	struct FStringAssetReference Mesh; // 0x00(0x10)
	int64_t CachedMeshResourceSize; // 0x10(0x08)
};

// ScriptStruct Athena.TQStructGenParams
// Size: 0x78 (Inherited: 0x00)
struct FTQStructGenParams {
	int32_t GenerationIterations; // 0x00(0x04)
	bool FailIfNoLocationData; // 0x04(0x01)
	char UnknownData_5[0x3]; // 0x05(0x03)
	float PreferredDistance; // 0x08(0x04)
	float EventExclusionZoneRadius; // 0x0c(0x04)
	float TransientActorExclusionZoneRadius; // 0x10(0x04)
	int32_t ModuleCount; // 0x14(0x04)
	struct FTQStructGenEntry FinalModuleOverride; // 0x18(0x30)
	float CombatWeight; // 0x48(0x04)
	int32_t MaxCombatOccurrences; // 0x4c(0x04)
	struct TArray<struct FTQStructGenGroup> CombatGroups; // 0x50(0x10)
	int32_t MaxNonCombatOccurrences; // 0x60(0x04)
	char UnknownData_64[0x4]; // 0x64(0x04)
	struct TArray<struct FTQStructGenGroup> NonCombatGroups; // 0x68(0x10)
};

// ScriptStruct Athena.TQStructGenGroup
// Size: 0x28 (Inherited: 0x10)
struct FTQStructGenGroup : FTQStructGenWeightedContainer {
	struct FName FeatureName; // 0x10(0x08)
	struct TArray<struct FTQStructGenEntry> Entries; // 0x18(0x10)
};

// ScriptStruct Athena.TQStructGenWeightedContainer
// Size: 0x10 (Inherited: 0x00)
struct FTQStructGenWeightedContainer {
	struct FName Name; // 0x00(0x08)
	float Weight; // 0x08(0x04)
	int32_t MaxOccurrences; // 0x0c(0x04)
};

// ScriptStruct Athena.TQStructGenEntry
// Size: 0x30 (Inherited: 0x10)
struct FTQStructGenEntry : FTQStructGenWeightedContainer {
	struct UTaleQuestDescAsset* TaleQuestDesc; // 0x10(0x08)
	struct UPLQuestLocationDataBundle* LocationBundle; // 0x18(0x08)
	bool LocationFiltering; // 0x20(0x01)
	char UnknownData_21[0x3]; // 0x21(0x03)
	struct FVector2D AcceptableAreaLocation; // 0x24(0x08)
	float AcceptableAreaRadius; // 0x2c(0x04)
};

// ScriptStruct Athena.TQStructGenSelection
// Size: 0x10 (Inherited: 0x00)
struct FTQStructGenSelection {
	struct UTaleQuestDescAsset* TaleQuestDesc; // 0x00(0x08)
	struct UPLQuestLocationDataAsset* LocationData; // 0x08(0x08)
};

// ScriptStruct Athena.QuestVarLocationData
// Size: 0x30 (Inherited: 0x30)
struct FQuestVarLocationData : FQuestVariable {
};

// ScriptStruct Athena.QuestVarTaleQuest
// Size: 0x30 (Inherited: 0x30)
struct FQuestVarTaleQuest : FQuestVariable {
};

// ScriptStruct Athena.VoyageHandInEntry
// Size: 0x10 (Inherited: 0x00)
struct FVoyageHandInEntry {
	struct UVoyageRecipeDataAsset* VoyageRecipe; // 0x00(0x08)
	struct UClass* Item; // 0x08(0x08)
};

// ScriptStruct Athena.GlintVisibilityLock
// Size: 0x01 (Inherited: 0x00)
struct FGlintVisibilityLock {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.DirectorSettingEntry
// Size: 0x18 (Inherited: 0x00)
struct FDirectorSettingEntry {
	struct UVoyageDescDataAsset* VoyageDesc; // 0x00(0x08)
	struct FFeatureFlag Feature; // 0x08(0x0c)
	char UnknownData_14[0x4]; // 0x14(0x04)
};

// ScriptStruct Athena.QuestVariablePageBundle
// Size: 0x30 (Inherited: 0x30)
struct FQuestVariablePageBundle : FQuestVariable {
};

// ScriptStruct Athena.HarpoonItemSlot
// Size: 0x10 (Inherited: 0x00)
struct FHarpoonItemSlot {
	struct FVector Location; // 0x00(0x0c)
	int32_t ItemsInSlot; // 0x0c(0x04)
};

// ScriptStruct Athena.PlayerHideoutInfo
// Size: 0x18 (Inherited: 0x00)
struct FPlayerHideoutInfo {
	struct APlayerState* PlayerState; // 0x00(0x08)
	struct TArray<struct ASpawnLocation*> ExitPoints; // 0x08(0x10)
};

// ScriptStruct Athena.HoleItemToSpawn
// Size: 0x28 (Inherited: 0x00)
struct FHoleItemToSpawn {
	float Weight; // 0x00(0x04)
	char UnknownData_4[0x4]; // 0x04(0x04)
	struct UClass* ItemDesc; // 0x08(0x08)
	struct TArray<char> RestrictToSurface; // 0x10(0x10)
	struct FName FeatureFlag; // 0x20(0x08)
};

// ScriptStruct Athena.MaxHolePerIslandDataAsset
// Size: 0x0c (Inherited: 0x00)
struct FMaxHolePerIslandDataAsset {
	struct FName IslandName; // 0x00(0x08)
	int32_t MaxHoles; // 0x08(0x04)
};

// ScriptStruct Athena.HoleContainer
// Size: 0x18 (Inherited: 0x00)
struct FHoleContainer {
	struct TArray<struct AHole*> Holes; // 0x00(0x10)
	struct FName IslandName; // 0x10(0x08)
};

// ScriptStruct Athena.BuriedBuriable
// Size: 0x48 (Inherited: 0x00)
struct FBuriedBuriable {
	char UnknownData_0[0x18]; // 0x00(0x18)
	struct FVector Location; // 0x18(0x0c)
	float Radius; // 0x24(0x04)
	char UnknownData_28[0x20]; // 0x28(0x20)
};

// ScriptStruct Athena.Leak
// Size: 0x70 (Inherited: 0x00)
struct FLeak {
	char UnknownData_0[0x30]; // 0x00(0x30)
	struct FWwiseEmitter SFXEmitter; // 0x30(0x20)
	struct UParticleSystemComponent* WaterLeakParticleSystem; // 0x50(0x08)
	char UnknownData_58[0x18]; // 0x58(0x18)
};

// ScriptStruct Athena.ShipLeak
// Size: 0x58 (Inherited: 0x00)
struct FShipLeak {
	struct FShipLeakParams Params; // 0x00(0x1c)
	char UnknownData_1C[0x24]; // 0x1c(0x24)
	struct UParticleSystemComponent* SplashParticleSystem; // 0x40(0x08)
	char UnknownData_48[0x10]; // 0x48(0x10)
};

// ScriptStruct Athena.ShipLeakParams
// Size: 0x1c (Inherited: 0x00)
struct FShipLeakParams {
	float InternalWaterSamplePositionTopOffset; // 0x00(0x04)
	float InternalWaterSamplePositionBottomOffset; // 0x04(0x04)
	float WaterSplashDelayMin; // 0x08(0x04)
	float WaterSplashDelayMax; // 0x0c(0x04)
	float HullFloodedPercentageToShiftWaterSamplingPos; // 0x10(0x04)
	float WaterSampleOffsetBelowHullFloodThreshold; // 0x14(0x04)
	float WaterSampleOffsetAboveHullFloodThreshold; // 0x18(0x04)
};

// ScriptStruct Athena.HullDamageNamedParamSet
// Size: 0x70 (Inherited: 0x00)
struct FHullDamageNamedParamSet {
	struct FName Name; // 0x00(0x08)
	char UnknownData_8[0x8]; // 0x08(0x08)
	struct FHullDamageParamSet Params; // 0x10(0x60)
};

// ScriptStruct Athena.HullDamageParamSet
// Size: 0x60 (Inherited: 0x00)
struct FHullDamageParamSet {
	struct FShipLeakParams LeakParams; // 0x00(0x1c)
	float LeakAmount; // 0x1c(0x04)
	struct FTransform InternalHoleDecalOffset; // 0x20(0x30)
	char Deck; // 0x50(0x01)
	char UnknownData_51[0xf]; // 0x51(0x0f)
};

// ScriptStruct Athena.DebugSuperSailorActionStateParams
// Size: 0x10 (Inherited: 0x00)
struct FDebugSuperSailorActionStateParams {
	float BaseForwardSpeed; // 0x00(0x04)
	float YawSpeed; // 0x04(0x04)
	float RightTriggerHeldSpdAmp; // 0x08(0x04)
	float RightTriggerHeldYawAmp; // 0x0c(0x04)
};

// ScriptStruct Athena.DockableCutsceneActionStateParams
// Size: 0x34 (Inherited: 0x18)
struct FDockableCutsceneActionStateParams : FControlObjectActionStateParams {
	struct FLookAtOffsetParams LookAtOffsetParams; // 0x18(0x1c)
};

// ScriptStruct Athena.ControlObjectActionStateParams
// Size: 0x18 (Inherited: 0x10)
struct FControlObjectActionStateParams : FDockToObjectActionStateParams {
	bool UndockToLastKnownLocation; // 0x10(0x01)
	char UnknownData_11[0x3]; // 0x11(0x03)
	float UndockDuration; // 0x14(0x04)
};

// ScriptStruct Athena.DockToObjectActionStateParams
// Size: 0x10 (Inherited: 0x00)
struct FDockToObjectActionStateParams {
	float DockTime; // 0x00(0x04)
	float DelayAfterDockingTime; // 0x04(0x04)
	float ForcedFieldOfView; // 0x08(0x04)
	bool ForceStash; // 0x0c(0x01)
	char UnknownData_D[0x3]; // 0x0d(0x03)
};

// ScriptStruct Athena.LookAtOffsetParams
// Size: 0x1c (Inherited: 0x00)
struct FLookAtOffsetParams {
	bool UseLookAtPosition; // 0x00(0x01)
	bool UseSpring; // 0x01(0x01)
	char UnknownData_2[0x2]; // 0x02(0x02)
	float SpringAccel; // 0x04(0x04)
	float MinYaw; // 0x08(0x04)
	float MaxYaw; // 0x0c(0x04)
	float MinPitch; // 0x10(0x04)
	float MaxPitch; // 0x14(0x04)
	char CameraLookatAnimationType; // 0x18(0x01)
	char UnknownData_19[0x3]; // 0x19(0x03)
};

// ScriptStruct Athena.UseMountedWeaponActionStateParams
// Size: 0x58 (Inherited: 0x18)
struct FUseMountedWeaponActionStateParams : FControlObjectActionStateParams {
	float CameraDockTime; // 0x18(0x04)
	char UnknownData_1C[0x4]; // 0x1c(0x04)
	struct UForceFeedbackEffect* FireForceFeedbackEffect; // 0x20(0x08)
	struct UClass* FireCameraShake; // 0x28(0x08)
	struct UClass* FireInputId; // 0x30(0x08)
	struct TArray<struct UClass*> AimYawInputId; // 0x38(0x10)
	struct TArray<struct UClass*> AimPitchInputId; // 0x48(0x10)
};

// ScriptStruct Athena.UseCannonActionStateParams
// Size: 0x60 (Inherited: 0x00)
struct FUseCannonActionStateParams {
	struct FUseMountedWeaponActionStateParams MountedWeaponParams; // 0x00(0x58)
	float ReloadAttemptRepeatRate; // 0x58(0x04)
	char UnknownData_5C[0x4]; // 0x5c(0x04)
};

// ScriptStruct Athena.CapturedByKrakenActionStateParams
// Size: 0x40 (Inherited: 0x00)
struct FCapturedByKrakenActionStateParams {
	struct UCurveFloat* MovementAlphaXY; // 0x00(0x08)
	struct UCurveFloat* MovementAlphaZ; // 0x08(0x08)
	struct UCurveFloat* MovementRotation; // 0x10(0x08)
	float MovementTime; // 0x18(0x04)
	float DistanceFromTentacleToStartFade; // 0x1c(0x04)
	float FadeInDuration; // 0x20(0x04)
	float ClientConditionsCompleteTimeout; // 0x24(0x04)
	float MinCameraPitch; // 0x28(0x04)
	float MaxCameraPitch; // 0x2c(0x04)
	float MinCameraYaw; // 0x30(0x04)
	float MaxCameraYaw; // 0x34(0x04)
	float AnimationProgressionToStopCameraFade; // 0x38(0x04)
	float BlockInteractInputTime; // 0x3c(0x04)
};

// ScriptStruct Athena.ClamberActionStateParams
// Size: 0x30 (Inherited: 0x10)
struct FClamberActionStateParams : FDockToObjectActionStateParams {
	float InitialClamberPitch; // 0x10(0x04)
	struct FLookAtOffsetParams LookAtOffsetParams; // 0x14(0x1c)
};

// ScriptStruct Athena.ControlCapstanArmActionStateParams
// Size: 0x34 (Inherited: 0x18)
struct FControlCapstanArmActionStateParams : FControlObjectActionStateParams {
	struct FLookAtOffsetParams LookAtOffsetParams; // 0x18(0x1c)
};

// ScriptStruct Athena.ControlPulleyActionStateParams
// Size: 0x34 (Inherited: 0x18)
struct FControlPulleyActionStateParams : FControlObjectActionStateParams {
	struct FLookAtOffsetParams LookAtOffsetParams; // 0x18(0x1c)
};

// ScriptStruct Athena.ControlWheelActionStateParams
// Size: 0x34 (Inherited: 0x18)
struct FControlWheelActionStateParams : FControlObjectActionStateParams {
	struct FLookAtOffsetParams LookAtOffsetParams; // 0x18(0x1c)
};

// ScriptStruct Athena.FiredFromActorActionStateParams
// Size: 0x28 (Inherited: 0x00)
struct FFiredFromActorActionStateParams {
	float GravityScaleOverride; // 0x00(0x04)
	float MassOverride; // 0x04(0x04)
	float UnderwaterBrakingFactorOverride; // 0x08(0x04)
	float UnderwaterBrakingFactorOverrideDuration; // 0x0c(0x04)
	struct FVector2D MaskFiringLagScaleMinMax; // 0x10(0x08)
	struct FVector2D MaskFiringLagScalingTimeMinMax; // 0x18(0x08)
	float MaskFiringLagSpeedToleranceSquared; // 0x20(0x04)
	float TimeUntilRevertingIgnoredActors; // 0x24(0x04)
};

// ScriptStruct Athena.HideInObjectActionStateParams
// Size: 0x28 (Inherited: 0x18)
struct FHideInObjectActionStateParams : FControlObjectActionStateParams {
	struct TArray<char> PreventedHealthChanges; // 0x18(0x10)
};

// ScriptStruct Athena.IngestedByKrakenActionStateParams
// Size: 0x04 (Inherited: 0x00)
struct FIngestedByKrakenActionStateParams {
	float StowItemsProgressThreshold; // 0x00(0x04)
};

// ScriptStruct Athena.TransitionLadderActionStateParams
// Size: 0x10 (Inherited: 0x10)
struct FTransitionLadderActionStateParams : FDockToObjectActionStateParams {
};

// ScriptStruct Athena.LinearTransitionLadderActionStateParams
// Size: 0x14 (Inherited: 0x10)
struct FLinearTransitionLadderActionStateParams : FTransitionLadderActionStateParams {
	float Duration; // 0x10(0x04)
};

// ScriptStruct Athena.UseMapTableActionStateParams
// Size: 0x1c (Inherited: 0x18)
struct FUseMapTableActionStateParams : FControlObjectActionStateParams {
	float CameraDockTime; // 0x18(0x04)
};

// ScriptStruct Athena.MigrationActionStateParams
// Size: 0x04 (Inherited: 0x00)
struct FMigrationActionStateParams {
	float ClientSetupResponseTimeout; // 0x00(0x04)
};

// ScriptStruct Athena.RepairObjectActionStateParams
// Size: 0x04 (Inherited: 0x00)
struct FRepairObjectActionStateParams {
	float MountTime; // 0x00(0x04)
};

// ScriptStruct Athena.ShovelDigActionStateParams
// Size: 0x10 (Inherited: 0x00)
struct FShovelDigActionStateParams {
	struct UCurveFloat* SuccessfulPitchBlendCurve; // 0x00(0x08)
	struct UCurveFloat* DeflectedPitchBlendCurve; // 0x08(0x08)
};

// ScriptStruct Athena.SplineTransitionLadderActionStateParams
// Size: 0x10 (Inherited: 0x10)
struct FSplineTransitionLadderActionStateParams : FTransitionLadderActionStateParams {
};

// ScriptStruct Athena.SwallowedByKrakenActionStateParams
// Size: 0x08 (Inherited: 0x00)
struct FSwallowedByKrakenActionStateParams {
	float FadeToBlackDuration; // 0x00(0x04)
	float DeathDelayTime; // 0x04(0x04)
};

// ScriptStruct Athena.TeleportActionStateParams
// Size: 0x30 (Inherited: 0x00)
struct FTeleportActionStateParams {
	float FadeDuration; // 0x00(0x04)
	float FadeEventTimeout; // 0x04(0x04)
	float FadeServerTimeout; // 0x08(0x04)
	struct FLinearColor FadeColour; // 0x0c(0x10)
	bool FadeAudio; // 0x1c(0x01)
	char UnknownData_1D[0x3]; // 0x1d(0x03)
	float EndFadeInDuration; // 0x20(0x04)
	float CharacterFadeCompleteTimeout; // 0x24(0x04)
	float TeleportCompleteTimeout; // 0x28(0x04)
	float TeleportNetRelevancyTimeout; // 0x2c(0x04)
};

// ScriptStruct Athena.UseLadderActionStateParams
// Size: 0x4c (Inherited: 0x10)
struct FUseLadderActionStateParams : FDockToObjectActionStateParams {
	float ClimbUpSpeed; // 0x10(0x04)
	float ClimbDownSpeed; // 0x14(0x04)
	float LadderRungHeight; // 0x18(0x04)
	float SpeedToEnterSlidingAnimationMs; // 0x1c(0x04)
	float MaxLadderSlidingSpeedMs; // 0x20(0x04)
	float InitialDockBottomPitch; // 0x24(0x04)
	float InitialDockTopPitch; // 0x28(0x04)
	float TopBottomTolerance; // 0x2c(0x04)
	struct FLookAtOffsetParams LookAtOffsetParams; // 0x30(0x1c)
};

// ScriptStruct Athena.WaitForDemoResetActionStateParams
// Size: 0x01 (Inherited: 0x00)
struct FWaitForDemoResetActionStateParams {
	char UnknownData_0[0x1]; // 0x00(0x01)
};

// ScriptStruct Athena.WaitingToSpawnActionStateParams
// Size: 0x14 (Inherited: 0x00)
struct FWaitingToSpawnActionStateParams {
	float ClientStartedTimeout; // 0x00(0x04)
	float ClientConditionsCompleteTimeout; // 0x04(0x04)
	float ScreenFadeInTime; // 0x08(0x04)
	float TeleportCompleteTimeout; // 0x0c(0x04)
	float TeleportNetRelevancyTimeout; // 0x10(0x04)
};

// ScriptStruct Athena.WaterBarrelActionStateParams
// Size: 0x34 (Inherited: 0x18)
struct FWaterBarrelActionStateParams : FControlObjectActionStateParams {
	struct FLookAtOffsetParams LookAtOffsetParams; // 0x18(0x1c)
};

// ScriptStruct Athena.UndoRepairActionStateParams
// Size: 0x04 (Inherited: 0x00)
struct FUndoRepairActionStateParams {
	float MountTime; // 0x00(0x04)
};

// ScriptStruct Athena.VaultPuzzleSolutionEntry
// Size: 0x30 (Inherited: 0x00)
struct FVaultPuzzleSolutionEntry {
	struct FVaultPuzzleSolutionPositions SolutionPositions; // 0x00(0x10)
	struct FStringAssetReference MaterialSet; // 0x10(0x10)
	struct FStringAssetReference TreasureVaultTableMaterialSet; // 0x20(0x10)
};

// ScriptStruct Athena.VaultPuzzleSolutionPositions
// Size: 0x10 (Inherited: 0x00)
struct FVaultPuzzleSolutionPositions {
	struct TArray<int32_t> SolutionPositions; // 0x00(0x10)
};

// ScriptStruct Athena.InteractableLightParams
// Size: 0x110 (Inherited: 0x00)
struct FInteractableLightParams {
	bool DebugDraw; // 0x00(0x01)
	bool IsSpotlight; // 0x01(0x01)
	char UnknownData_2[0x2]; // 0x02(0x02)
	struct FName LightTag; // 0x04(0x08)
	char UnknownData_C[0x4]; // 0x0c(0x04)
	struct FInteractableLightState OnParameters; // 0x10(0x80)
	struct FInteractableLightState OffParameters; // 0x90(0x80)
};

// ScriptStruct Athena.InteractableLightState
// Size: 0x80 (Inherited: 0x00)
struct FInteractableLightState {
	bool Enabled; // 0x00(0x01)
	char UnknownData_1[0xf]; // 0x01(0x0f)
	struct FTransform Transform; // 0x10(0x30)
	float Intensity; // 0x40(0x04)
	float ConeAngleInner; // 0x44(0x04)
	float ConeAngleOuter; // 0x48(0x04)
	float AttenuationRadius; // 0x4c(0x04)
	struct FColor LightColour; // 0x50(0x04)
	char SimpleFunctionType; // 0x54(0x01)
	char UnknownData_55[0x3]; // 0x55(0x03)
	float ScaleOffset; // 0x58(0x04)
	float PulsePhase; // 0x5c(0x04)
	float FlickerFrequency; // 0x60(0x04)
	float IntensityScaleForWater; // 0x64(0x04)
	float MinDistanceToLightClamp; // 0x68(0x04)
	bool ApplyScaleForTranslucency; // 0x6c(0x01)
	char UnknownData_6D[0x3]; // 0x6d(0x03)
	float ScaleForTranslucency; // 0x70(0x04)
	bool ApplyCapForTranslucency; // 0x74(0x01)
	char UnknownData_75[0x3]; // 0x75(0x03)
	float CapForTranslucency; // 0x78(0x04)
	char UnknownData_7C[0x4]; // 0x7c(0x04)
};

// ScriptStruct Athena.LightData
// Size: 0x03 (Inherited: 0x00)
struct FLightData {
	char FlameOfFateType; // 0x00(0x01)
	bool LightIsOn_Server; // 0x01(0x01)
	bool LitWithLantern; // 0x02(0x01)
};

// ScriptStruct Athena.CategorySpec
// Size: 0x28 (Inherited: 0x00)
struct FCategorySpec {
	struct UClass* ItemCategory; // 0x00(0x08)
	struct TArray<struct UClass*> FallbackCategories; // 0x08(0x10)
	struct FString DefaultSlotIconURL; // 0x18(0x10)
};

// ScriptStruct Athena.InventoryManipulatorAutoEquipPolicyEntry
// Size: 0x10 (Inherited: 0x00)
struct FInventoryManipulatorAutoEquipPolicyEntry {
	struct UClass* Category; // 0x00(0x08)
	char Policy; // 0x08(0x01)
	char UnknownData_9[0x7]; // 0x09(0x07)
};

// ScriptStruct Athena.IslandFaunaPopulatedChance
