// Class Athena.MetalAIFormComponent
// Size: 0x208 (Inherited: 0x148)
struct UMetalAIFormComponent : UAthenaAIFormComponent {
	char UnknownData_148[0x28]; // 0x148(0x28)
	struct UParticleSystem* RustyParticlesTemplate; // 0x170(0x08)
	struct USkeletonAudioFootfallControllerParams* DefaultFootfallParams; // 0x178(0x08)
	struct USkeletonAudioFootfallControllerParams* RustyFootfallParams; // 0x180(0x08)
	struct UMaterial* MetalBaseMaterial; // 0x188(0x20)
	struct FName RustShaderParamName; // 0x1a8(0x08)
	float NotRustyShaderParamValue; // 0x1b0(0x04)
	float RustyShaderParamValue; // 0x1b4(0x04)
	float ShaderParamBlendSpeed; // 0x1b8(0x04)
	struct FName SeedShaderParamName; // 0x1bc(0x08)
	int32_t MaxSeedShaderValue; // 0x1c4(0x04)
	bool IsWet; // 0x1c8(0x01)
	char UnknownData_1C9[0x7]; // 0x1c9(0x07)
	struct UParticleSystemComponent* RustyParticleSystemComponent; // 0x1d0(0x08)
	char UnknownData_1D8[0x8]; // 0x1d8(0x08)
	struct UDamageableVulnerabilityLayer* DefaultVulnerabilityLayer; // 0x1e0(0x08)
	struct UDamageableVulnerabilityLayer* RustyVulnerabilityLayer; // 0x1e8(0x08)
	struct UCharacterHitReactionDamagerTypeToAnimTypeLayer* RustyHitReactionsLayer; // 0x1f0(0x08)
	struct UMaterialInstanceDynamic* MetalDynamicMaterialInstance; // 0x1f8(0x08)
	char UnknownData_200[0x8]; // 0x200(0x08)

	void OnRep_IsWet(); // Function Athena.MetalAIFormComponent.OnRep_IsWet // Final|Native|Private // @ game+0x10c8010
};

// Class Athena.PlantAIFormComponent
// Size: 0x1e8 (Inherited: 0x148)
struct UPlantAIFormComponent : UAthenaAIFormComponent {
	char UnknownData_148[0x28]; // 0x148(0x28)
	struct UParticleSystem* HealingParticlesTemplate; // 0x170(0x08)
	struct UWwiseEvent* StartHealingAudioLoopEvent; // 0x178(0x08)
	struct UWwiseEvent* StopHealingAudioLoopEvent; // 0x180(0x08)
	struct UParticleSystem* WeakParticlesTemplate; // 0x188(0x08)
	struct UMaterial* PlantBaseMaterial; // 0x190(0x20)
	struct FName HealingShaderParamName; // 0x1b0(0x08)
	float IsNotHealingShaderParamValue; // 0x1b8(0x04)
	float IsHealingShaderParamValue; // 0x1bc(0x04)
	float ShaderParamBlendSpeed; // 0x1c0(0x04)
	bool IsWet; // 0x1c4(0x01)
	bool IsWeak; // 0x1c5(0x01)
	char UnknownData_1C6[0x2]; // 0x1c6(0x02)
	struct UParticleSystemComponent* HealingParticleSystemComponent; // 0x1c8(0x08)
	struct UParticleSystemComponent* WeakParticleSystemComponent; // 0x1d0(0x08)
	struct UMaterialInstanceDynamic* PlantDynamicMaterialInstance; // 0x1d8(0x08)
	char UnknownData_1E0[0x8]; // 0x1e0(0x08)

	void OnRep_IsWet(); // Function Athena.PlantAIFormComponent.OnRep_IsWet // Final|Native|Private // @ game+0x10c8030
	void OnRep_IsWeak(); // Function Athena.PlantAIFormComponent.OnRep_IsWeak // Final|Native|Private // @ game+0x10c7ff0
};

// Class Athena.ShadowAIFormComponent
// Size: 0x2e0 (Inherited: 0x148)
struct UShadowAIFormComponent : UAthenaAIFormComponent {
	char FlameSpecificPhobia; // 0x148(0x01)
	char UnknownData_149[0x7]; // 0x149(0x07)
	struct UParticleSystem* LightStateConstantParticlesTemplate; // 0x150(0x08)
	struct UParticleSystem* DarkStateConstantParticlesTemplate; // 0x158(0x08)
	struct UParticleSystem* ToLightTransitionParticlesTemplate; // 0x160(0x08)
	struct UParticleSystem* ToDarkTransitionParticlesTemplate; // 0x168(0x08)
	struct UPhysicalMaterial* ClientLightStatePhysMaterialOverride; // 0x170(0x08)
	struct UPhysicalMaterial* ClientDarkStatePhysMaterialOverride; // 0x178(0x08)
	struct UWwiseEvent* StartDarkStateAudioLoopEvent; // 0x180(0x08)
	struct UWwiseEvent* StopDarkStateAudioLoopEvent; // 0x188(0x08)
	struct TArray<struct UMaterial*> ShadowBaseMaterials; // 0x190(0x10)
	struct FName ShadowShaderParamName; // 0x1a0(0x08)
	float LightStateShaderParamValue; // 0x1a8(0x04)
	float DarkStateShaderParamValue; // 0x1ac(0x04)
	float ShaderParamBlendSpeed; // 0x1b0(0x04)
	struct FName SeedShaderParamName; // 0x1b4(0x08)
	int32_t MaxSeedShaderValue; // 0x1bc(0x04)
	char CurrentState; // 0x1c0(0x01)
	char UnknownData_1C1[0x7]; // 0x1c1(0x07)
	struct UParticleSystemComponent* LightStateConstantParticleSystemComponent; // 0x1c8(0x08)
	struct UParticleSystemComponent* DarkStateConstantParticleSystemComponent; // 0x1d0(0x08)
	struct TArray<struct UMaterialInstanceDynamic*> ShadowDynamicMaterialInstances; // 0x1d8(0x10)
	char UnknownData_1E8[0x78]; // 0x1e8(0x78)
	struct TArray<struct FFlameSpecificDataEntry> FlameSpecificDataMap; // 0x260(0x10)
	char UnknownData_270[0x70]; // 0x270(0x70)

	void OnRep_FlameSpecificPhobia(char PreviousType); // Function Athena.ShadowAIFormComponent.OnRep_FlameSpecificPhobia // Final|RequiredAPI|Native|Private|HasOutParms // @ game+0x11c4450
	void OnRep_CurrentState(char PreviousState); // Function Athena.ShadowAIFormComponent.OnRep_CurrentState // Final|RequiredAPI|Native|Private|HasOutParms // @ game+0x11c42c0
	void Multicast_ChangedToState(char InState); // Function Athena.ShadowAIFormComponent.Multicast_ChangedToState // Final|Net|Native|Event|NetMulticast|Private // @ game+0x11c32d0
};

// Class Athena.EntitlementDesc
// Size: 0xc8 (Inherited: 0x28)
struct UEntitlementDesc : UDataAsset {
	struct FText Title; // 0x28(0x38)
	struct FText Description; // 0x60(0x38)
	struct FStringAssetReference IconInvPath; // 0x98(0x10)
	struct FStringAssetReference IconPrvPath; // 0xa8(0x10)
	struct UClass* Category; // 0xb8(0x08)
	struct UClass* Company; // 0xc0(0x08)
};

// Class Athena.ClothingDesc
// Size: 0xd0 (Inherited: 0xc8)
struct UClothingDesc : UEntitlementDesc {
	struct FName WardrobeKey; // 0xc8(0x08)
};

// Class Athena.ShipCustomizationDesc
// Size: 0xf8 (Inherited: 0xc8)
struct UShipCustomizationDesc : UEntitlementDesc {
	struct FStringAssetReference CustomizationInfo; // 0xc8(0x10)
	struct FString PreviousItem; // 0xd8(0x10)
	struct FString NextItem; // 0xe8(0x10)
};

// Class Athena.TaleRankDesc
// Size: 0xc8 (Inherited: 0xc8)
struct UTaleRankDesc : UEntitlementDesc {
};

// Class Athena.TitleDesc
// Size: 0xd0 (Inherited: 0xd0)
struct UTitleDesc : UClothingDesc {
};

// Class Athena.ShantyItemDesc
// Size: 0x108 (Inherited: 0xc8)
struct UShantyItemDesc : UEntitlementDesc {
	struct FShantyData ShantyData; // 0xc8(0x30)
	struct FStringAssetReference BackgroundPath; // 0xf8(0x10)
};

// Class Athena.SeasonPassEntitlementDesc
// Size: 0xc8 (Inherited: 0xc8)
struct USeasonPassEntitlementDesc : UEntitlementDesc {
};

// Class Athena.PrimaryItemUsePressedNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct UPrimaryItemUsePressedNotificationInputId : UNotificationInputId {
};

// Class Athena.SecondaryItemUsePressedNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct USecondaryItemUsePressedNotificationInputId : UNotificationInputId {
};

// Class Athena.InteractableBase
// Size: 0x400 (Inherited: 0x3c8)
struct AInteractableBase : AActor {
	char UnknownData_3C8[0x10]; // 0x3c8(0x10)
	bool RequiresFacingFront; // 0x3d8(0x01)
	bool RequiresNotBeingAirborne; // 0x3d9(0x01)
	bool RequiresNotSwimming; // 0x3da(0x01)
	bool InteractionsCanBeDisabled; // 0x3db(0x01)
	bool CanSetInteractionState; // 0x3dc(0x01)
	char UnknownData_3DD[0x3]; // 0x3dd(0x03)
	struct TArray<struct UInteractionPrerequisiteBase*> InteractionPrerequisites; // 0x3e0(0x10)
	struct UActionRulesComponent* ActionRulesComponent; // 0x3f0(0x08)
	char InteractableIdentifier; // 0x3f8(0x01)
	char UnknownData_3F9[0x1]; // 0x3f9(0x01)
	char CurrentInteractionState; // 0x3fa(0x01)
	char UnknownData_3FB[0x5]; // 0x3fb(0x05)
};

// Class Athena.ControllableObject
// Size: 0x510 (Inherited: 0x400)
struct AControllableObject : AInteractableBase {
	char UnknownData_400[0x30]; // 0x400(0x30)
	struct FControlObjectActionRuleParams ControlObjectActionRuleParams; // 0x430(0x10)
	struct UPhrasesRadialDataAsset* Phrases; // 0x440(0x08)
	bool AllowDisconnectWhenIdle; // 0x448(0x01)
	char UnknownData_449[0x3]; // 0x449(0x03)
	uint32_t IdleDisconnectSecondsThreshold; // 0x44c(0x04)
	char UnknownData_450[0xa0]; // 0x450(0xa0)
	struct AActor* ControllingActor; // 0x4f0(0x08)
	char UnknownData_4F8[0x18]; // 0x4f8(0x18)

	void TakenControlImpl(struct AActor* Controller); // Function Athena.ControllableObject.TakenControlImpl // Native|Event|Public|BlueprintEvent // @ game+0x38c73a0
	void RelinquishedControlImpl(struct AActor* Controller); // Function Athena.ControllableObject.RelinquishedControlImpl // Native|Event|Public|BlueprintEvent // @ game+0x38c7040
	struct AActor* GetControllingActor(); // Function Athena.ControllableObject.GetControllingActor // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x38c6bb0
	bool CanInteractImpl(struct AActor* InCharacter); // Function Athena.ControllableObject.CanInteractImpl // Native|Event|Protected|BlueprintCallable|BlueprintEvent|BlueprintPure|Const // @ game+0x38c6af0
};

// Class Athena.ControllablePulley
// Size: 0x520 (Inherited: 0x510)
struct AControllablePulley : AControllableObject {
	char UnknownData_510[0x8]; // 0x510(0x08)
	struct UControllableIntentComponent* IntentComponent; // 0x518(0x08)
};

// Class Athena.SailManipulator
// Size: 0x838 (Inherited: 0x520)
struct ASailManipulator : AControllablePulley {
	struct FRopeVisualParams RopeVisuals; // 0x520(0x0c)
	float RopeLength; // 0x52c(0x04)
	struct UStaticMeshComponent* BaseMeshComponent; // 0x530(0x08)
	struct UStaticMeshComponent* TopMeshComponent; // 0x538(0x08)
	struct UFixedIntentComponent* CurseIntentComponent; // 0x540(0x08)
	struct UWwiseObjectPoolWrapper* ManipulatorAudioPool; // 0x548(0x08)
	struct FSocketId MastSocketId; // 0x550(0x20)
	struct USailManipulatorAudioParams* AudioParams; // 0x570(0x08)
	struct USceneComponent* MastSocketSceneComponent; // 0x578(0x08)
	struct FWwiseEmitter AudioEmitter; // 0x580(0x20)
	char UnknownData_5A0[0x270]; // 0x5a0(0x270)
	struct AMast* BoundMast; // 0x810(0x08)
	struct AMast* PendingBoundMast; // 0x818(0x08)
	bool Locked; // 0x820(0x01)
	char UnknownData_821[0x7]; // 0x821(0x07)
	struct UMobileInstancedStaticMeshComponent* TopMeshInstanceComponent; // 0x828(0x08)
	char UnknownData_830[0x8]; // 0x830(0x08)

	void SetMastSocketId(struct FSocketId InMastSocketId); // Function Athena.SailManipulator.SetMastSocketId // Final|Native|Public|BlueprintCallable // @ game+0xef7fb0
	void SetMast(struct AMast* InMast); // Function Athena.SailManipulator.SetMast // Final|Native|Public|BlueprintCallable // @ game+0xef7f30
	void SetLocked(bool IsLocked); // Function Athena.SailManipulator.SetLocked // Final|Native|Public|BlueprintCallable // @ game+0xef7ea0
	void RotateTowardsLocation(struct FVector TargetLocation); // Function Athena.SailManipulator.RotateTowardsLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xef7000
	void OnRep_PendingBoundMast(); // Function Athena.SailManipulator.OnRep_PendingBoundMast // Final|Native|Private // @ game+0xef56f0
	bool IsLocked(); // Function Athena.SailManipulator.IsLocked // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xef44a0
	void HandleBoundMastEndPlay(char EndPlayReason); // Function Athena.SailManipulator.HandleBoundMastEndPlay // Final|Native|Private // @ game+0xef3f20
	void HandleBoundMastDestroyed(); // Function Athena.SailManipulator.HandleBoundMastDestroyed // Final|Native|Private // @ game+0xef3f00
	float GetRopeUVOffset(); // Function Athena.SailManipulator.GetRopeUVOffset // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xef3940
	struct AMast* GetMast(); // Function Athena.SailManipulator.GetMast // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xef35c0
};

// Class Athena.SailHoist
// Size: 0x860 (Inherited: 0x838)
struct ASailHoist : ASailManipulator {
	char UnknownData_838[0x8]; // 0x838(0x08)
	float RopeUVSpeed; // 0x840(0x04)
	char UnknownData_844[0x4]; // 0x844(0x04)
	struct URiggingSystemComponent* Rigging; // 0x848(0x08)
	int32_t RiggingRopeIndex; // 0x850(0x04)
	bool PlayAudio; // 0x854(0x01)
	char UnknownData_855[0xb]; // 0x855(0x0b)
};

// Class Athena.Mast
// Size: 0x9c8 (Inherited: 0x3c8)
struct AMast : AActor {
	char UnknownData_3C8[0x40]; // 0x3c8(0x40)
	char MastType; // 0x408(0x01)
	char UnknownData_409[0x7]; // 0x409(0x07)
	struct UMastAudioParams* MastAudioParams; // 0x410(0x08)
	struct USceneComponent* SceneRootComponent; // 0x418(0x08)
	struct UIntentCombinerComponent* AngleCombinerComponent; // 0x420(0x08)
	struct UIntentCombinerComponent* SailHoistIntentCombinerComponent; // 0x428(0x08)
	struct UIntentCombinerComponent* MastHoistIntentCombinerComponent; // 0x430(0x08)
	struct USceneComponent* MastMovingAttachComponent; // 0x438(0x08)
	struct USceneComponent* SailAnglePivotComponent; // 0x440(0x08)
	struct UReplicatedShipPartCustomizationComponent* CustomizationComponent; // 0x448(0x08)
	struct URepairableComponent* RepairableComponentFirst; // 0x450(0x08)
	struct URepairableComponent* RepairableComponentSecond; // 0x458(0x08)
	struct URepairableComponent* RepairableComponentThird; // 0x460(0x08)
	struct UShipDamageableComponent* DamageableComponent; // 0x468(0x08)
	struct UMastFlammableComponent* MastFlammableComponent; // 0x470(0x08)
	float AngleBlend; // 0x478(0x04)
	float LoweredBlend; // 0x47c(0x04)
	float LoweringSpeed; // 0x480(0x04)
	float RaisingSpeed; // 0x484(0x04)
	float TurnSpeed; // 0x488(0x04)
	float MaxTurnAngle; // 0x48c(0x04)
	float SailOffsetFromMast; // 0x490(0x04)
	float SailWidth; // 0x494(0x04)
	float SailHeight; // 0x498(0x04)
	float SailStartOffset; // 0x49c(0x04)
	struct FVector LookAtPosLow; // 0x4a0(0x0c)
	struct FVector LookAtPosHigh; // 0x4ac(0x0c)
	struct UWwiseObjectPoolWrapper* SailAudioPool; // 0x4b8(0x08)
	struct UWwiseEvent* AmbientSailFlapsSfx; // 0x4c0(0x08)
	struct UWwiseEvent* AmbientSailFlapsStopSfx; // 0x4c8(0x08)
	struct UWwiseEvent* PerfectSailInflationOneShot; // 0x4d0(0x08)
	struct UWwiseEvent* SailLostPerfectWindOneShot; // 0x4d8(0x08)
	struct FName InflationRTPC; // 0x4e0(0x08)
	struct FName SailLengthRTPC; // 0x4e8(0x08)
	float ClientSailBlendSpeed; // 0x4f0(0x04)
	char UnknownData_4F4[0x4]; // 0x4f4(0x04)
	struct TArray<struct UStaticMeshComponent*> YardArms; // 0x4f8(0x10)
	struct FName TelemetryIdentifier; // 0x508(0x08)
	bool MastShouldBeFractured; // 0x510(0x01)
	char UnknownData_511[0x3]; // 0x511(0x03)
	struct FMastCollisionProfiles MastCollisionProfiles; // 0x514(0x28)
	char UnknownData_53C[0x4]; // 0x53c(0x04)
	struct FMastPhysicsComponents MastPhysicsComponents; // 0x540(0x38)
	struct UStaticMesh* MastIntactMesh; // 0x578(0x08)
	struct UStaticMesh* MastFractureMeshBottom; // 0x580(0x08)
	float MastFractureMeshBottomScale; // 0x588(0x04)
	float MastFractureMeshOriginalScale; // 0x58c(0x04)
	struct UStaticMesh* MastFractureMeshTop; // 0x590(0x08)
	struct UParticleSystem* DamageParticleSystem; // 0x598(0x08)
	float HingeHeight; // 0x5a0(0x04)
	float HingeDistanceFromCentre; // 0x5a4(0x04)
	float HingeDirectionAngle; // 0x5a8(0x04)
	float MaxFallAngle; // 0x5ac(0x04)
	float MastLiftingSpeed; // 0x5b0(0x04)
	bool OverrideSailLengthWhenFalling; // 0x5b4(0x01)
	char UnknownData_5B5[0x3]; // 0x5b5(0x03)
	float MaxFallenSailLength; // 0x5b8(0x04)
	float SailFoldingSpeed; // 0x5bc(0x04)
	bool OverrideSailAngleWhenFalling; // 0x5c0(0x01)
	char UnknownData_5C1[0x3]; // 0x5c1(0x03)
	float DesiredFallingSailAngle; // 0x5c4(0x04)
	float SailTwistingSpeed; // 0x5c8(0x04)
	char UnknownData_5CC[0x4]; // 0x5cc(0x04)
	struct UMastHinge* Hinge; // 0x5d0(0x08)
	struct FWeightedProbabilityRangeOfRanges MastImpactForceToApplyToShip; // 0x5d8(0x30)
	float MastImpactForceModifierToApplyToKrakenWrappedShip; // 0x608(0x04)
	float MastImpactHeightLocation; // 0x60c(0x04)
	struct UClass* CameraShake; // 0x610(0x08)
	float CameraShakeInnerRadius; // 0x618(0x04)
	float CameraShakeOuterRadius; // 0x61c(0x04)
	bool PreviewMastFallenPosition; // 0x620(0x01)
	char UnknownData_621[0x7]; // 0x621(0x07)
	struct TArray<struct URepairableComponent*> RepairableComponents; // 0x628(0x10)
	struct FMastDamageAudioParams DamageAudioParameters; // 0x638(0xb0)
	char UnknownData_6E8[0x8]; // 0x6e8(0x08)
	struct UTetherCustomisationComponent* TetherCustomisationComponent; // 0x6f0(0x08)
	char UnknownData_6F8[0xa0]; // 0x6f8(0xa0)
	struct TArray<struct UChildActorComponent*> LinkedSails; // 0x798(0x10)
	struct FIntentPredictor LengthIntentPredictor; // 0x7a8(0x1c)
	struct FIntentPredictor AngleIntentPredictor; // 0x7c4(0x1c)
	struct FIntentPredictor MastHoistIntentPredictor; // 0x7e0(0x1c)
	bool MastHoistingControlSchemeActive; // 0x7fc(0x01)
	char UnknownData_7FD[0x3]; // 0x7fd(0x03)
	struct FObjectMessagingHandle SailGotPerfectWindEventHandle; // 0x800(0x58)
	struct FObjectMessagingHandle SailLostPerfectWindEventHandle; // 0x858(0x58)
	struct FObjectMessagingHandle MastRepairStoppedHandle; // 0x8b0(0x58)
	char UnknownData_908[0x10]; // 0x908(0x10)
	struct FWwiseEmitter SailsAudioEmitter; // 0x918(0x20)
	float ServerAngleRatio; // 0x938(0x04)
	float ServerLoweredProportion; // 0x93c(0x04)
	char ForceBillowingState; // 0x940(0x01)
	char UnknownData_941[0x3]; // 0x941(0x03)
	float ServerMastFallingProportion; // 0x944(0x04)
	char UnknownData_948[0x1c]; // 0x948(0x1c)
	bool AllowedToFall; // 0x964(0x01)
	bool PlayAudio; // 0x965(0x01)
	char UnknownData_966[0x3a]; // 0x966(0x3a)
	bool IsCursed; // 0x9a0(0x01)
	char UnknownData_9A1[0x27]; // 0x9a1(0x27)

	void UpdateSailsLoweredBasedOnIntent(float LoweredIntent); // Function Athena.Mast.UpdateSailsLoweredBasedOnIntent // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x10ce1a0
	void UpdateSailsBasedOnIntent(float AngleIntent, float LoweredIntent); // Function Athena.Mast.UpdateSailsBasedOnIntent // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x10ce0e0
	void UpdateSailsAngleBasedOnIntent(float AngleIntent); // Function Athena.Mast.UpdateSailsAngleBasedOnIntent // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x10ce060
	void UpdateHingeTransform(); // Function Athena.Mast.UpdateHingeTransform // Final|Native|Public|BlueprintCallable // @ game+0x10ce040
	void ToggleRepairPlankVisibility(struct URepairableComponent* InRepairableComponent, bool ShouldBeVisible); // Function Athena.Mast.ToggleRepairPlankVisibility // Final|Native|Protected|BlueprintCallable // @ game+0x10cd880
	void SetMastPhysicsFromDamageState(char MastDamageState); // Function Athena.Mast.SetMastPhysicsFromDamageState // Final|Native|Protected|BlueprintCallable // @ game+0x10cc980
	void SetMastFallingProportion(float InProportion); // Function Athena.Mast.SetMastFallingProportion // Final|Native|Public|BlueprintCallable // @ game+0x10cc900
	void SetFullyRepaired(struct AActor* InRepairer); // Function Athena.Mast.SetFullyRepaired // Final|Native|Public|BlueprintCallable // @ game+0x10cc350
	void SetFullyDamaged(); // Function Athena.Mast.SetFullyDamaged // Final|Native|Public|BlueprintCallable // @ game+0x10cc330
	void ResetDamage(bool OnlyRepaired); // Function Athena.Mast.ResetDamage // Final|Native|Public // @ game+0x10c9c70
	void RepairDamage(); // Function Athena.Mast.RepairDamage // Final|Native|Public // @ game+0x10c9ba0
	void ReactToRepairableStateChanged(char RepairableState, char InPreviousRepairableState, struct URepairableComponent* InRepairableComponent); // Function Athena.Mast.ReactToRepairableStateChanged // Final|Native|Private // @ game+0x10c99a0
	void ReactToDamageLevelChangedThird(int32_t DamageLevel); // Function Athena.Mast.ReactToDamageLevelChangedThird // Final|Native|Private // @ game+0x10c9920
	void ReactToDamageLevelChangedSecond(int32_t DamageLevel); // Function Athena.Mast.ReactToDamageLevelChangedSecond // Final|Native|Private // @ game+0x10c98a0
	void ReactToDamageLevelChangedFirst(int32_t DamageLevel); // Function Athena.Mast.ReactToDamageLevelChangedFirst // Final|Native|Private // @ game+0x10c9820
	void ReactToDamage(struct FImpactDamageEvent ImpactDamageEvent); // Function Athena.Mast.ReactToDamage // Final|Native|Private|HasOutParms // @ game+0x10c9720
	void OnRep_MastShouldBeFractured(); // Function Athena.Mast.OnRep_MastShouldBeFractured // Final|Native|Private // @ game+0x10c80f0
	void OnRep_IsCursed(); // Function Athena.Mast.OnRep_IsCursed // Final|Native|Private // @ game+0x10c7f90
	void OnRep_ForceBillowingState(); // Function Athena.Mast.OnRep_ForceBillowingState // Final|Native|Private // @ game+0x10c7f10
	void OnMastMeshSwapRequested(struct UStaticMesh* NewMeshBottom, struct UStaticMesh* NewMeshTop); // Function Athena.Mast.OnMastMeshSwapRequested // Native|Event|Protected|BlueprintEvent // @ game+0x10c75a0
	void OnMastDescLoaded(struct UMastDescAsset* MastDesc); // Function Athena.Mast.OnMastDescLoaded // Native|Event|Public|BlueprintEvent // @ game+0x10c7520
	void OnLoweredProportionChange(float LoweredProportion, float DeltaTime); // Function Athena.Mast.OnLoweredProportionChange // Native|Event|Protected|BlueprintEvent // @ game+0x10c7450
	void OnAngleChanged(float Angle, float DeltaTime); // Function Athena.Mast.OnAngleChanged // Native|Event|Protected|BlueprintEvent // @ game+0x10c6cd0
	void Multicast_PlayMastDamageEffectsRPC(struct TArray<int32_t> RepairableComponentIndices, int32_t NewDamageLevel); // Function Athena.Mast.Multicast_PlayMastDamageEffectsRPC // Final|Net|Native|Event|NetMulticast|Private // @ game+0x10c6790
	bool IsMastVisuallyFractured(); // Function Athena.Mast.IsMastVisuallyFractured // Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const // @ game+0x10c60d0
	bool IsMastFullyDamaged(); // Function Athena.Mast.IsMastFullyDamaged // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x10c60a0
	void HingeTransformChanged(struct FTransform NewTransform); // Function Athena.Mast.HingeTransformChanged // Final|Native|Public|HasDefaults // @ game+0x10c5c60
	float GetSailTurnRate(); // Function Athena.Mast.GetSailTurnRate // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x10c5350
	struct TArray<struct ASail*> GetSails(); // Function Athena.Mast.GetSails // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x10c5380
	float GetSailMovementRate(); // Function Athena.Mast.GetSailMovementRate // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x10c5320
	float GetSailLoweredProportion(); // Function Athena.Mast.GetSailLoweredProportion // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x10c52f0
	float GetSailAngleRatio(); // Function Athena.Mast.GetSailAngleRatio // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x10c52c0
	int32_t GetMaxDamageLevel(); // Function Athena.Mast.GetMaxDamageLevel // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x10c4ce0
	float GetMastHeight(); // Function Athena.Mast.GetMastHeight // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x10c4cb0
	char GetMastDamageState(); // Function Athena.Mast.GetMastDamageState // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x10c4c90
	struct FTransform GetMastAngleBoneTransform(); // Function Athena.Mast.GetMastAngleBoneTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x10c4c30
	struct FVector GetLookAtPos(); // Function Athena.Mast.GetLookAtPos // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x10c4bf0
	struct FTransform GetHingeWorldTransform(); // Function Athena.Mast.GetHingeWorldTransform // Final|Native|Public|HasDefaults|Const // @ game+0x10c49c0
	struct FVector GetFallingImpactLocation(); // Function Athena.Mast.GetFallingImpactLocation // Final|Native|Protected|HasDefaults|BlueprintCallable // @ game+0x10c4830
	int32_t GetDamageLevel(); // Function Athena.Mast.GetDamageLevel // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x10c4600
	void FinaliseSails(struct TArray<struct UChildActorComponent*> InSails); // Function Athena.Mast.FinaliseSails // Final|Native|Public|BlueprintCallable // @ game+0x10c3fb0
	void ApplyMastFallingAngle(float InAngle); // Function Athena.Mast.ApplyMastFallingAngle // Final|Native|Protected|BlueprintCallable // @ game+0x10c2fc0
	void ApplyDamage(struct FImpactDamageEvent ImpactDamageEvent); // Function Athena.Mast.ApplyDamage // Final|Native|Private|HasOutParms // @ game+0x10c2ec0
};

// Class Athena.SailAngle
// Size: 0x868 (Inherited: 0x838)
struct ASailAngle : ASailManipulator {
	char UnknownData_838[0x8]; // 0x838(0x08)
	float RopeUVSpeed; // 0x840(0x04)
	char UnknownData_844[0x4]; // 0x844(0x04)
	struct URiggingSystemComponent* Rigging; // 0x848(0x08)
	int32_t RiggingLeftRopeIndex; // 0x850(0x04)
	int32_t RiggingRightRopeIndex; // 0x854(0x04)
	bool PlayAudio; // 0x858(0x01)
	char UnknownData_859[0xf]; // 0x859(0x0f)
};

// Class Athena.PrimaryInteractNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct UPrimaryInteractNotificationInputId : UNotificationInputId {
};

// Class Athena.InteractOrDisengageNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct UInteractOrDisengageNotificationInputId : UNotificationInputId {
};

// Class Athena.SecondaryInteractNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct USecondaryInteractNotificationInputId : UNotificationInputId {
};

// Class Athena.CompositeQuickSwitchWeaponSecondaryInteractNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct UCompositeQuickSwitchWeaponSecondaryInteractNotificationInputId : UNotificationInputId {
};

// Class Athena.PrimaryItemUseReleasedNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct UPrimaryItemUseReleasedNotificationInputId : UPrimaryItemUsePressedNotificationInputId {
};

// Class Athena.SecondaryItemUseReleasedNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct USecondaryItemUseReleasedNotificationInputId : USecondaryItemUsePressedNotificationInputId {
};

// Class Athena.GameEventType
// Size: 0x28 (Inherited: 0x28)
struct UGameEventType : UObject {
};

// Class Athena.SkellyFortGameEventTypeBase
// Size: 0x28 (Inherited: 0x28)
struct USkellyFortGameEventTypeBase : UGameEventType {
};

// Class Athena.SkellyFortGameEventType
// Size: 0x28 (Inherited: 0x28)
struct USkellyFortGameEventType : USkellyFortGameEventTypeBase {
};

// Class Athena.SkellyFort2022GameEventType
// Size: 0x28 (Inherited: 0x28)
struct USkellyFort2022GameEventType : USkellyFortGameEventType {
};

// Class Athena.KrakenGameEventType
// Size: 0x28 (Inherited: 0x28)
struct UKrakenGameEventType : UGameEventType {
};

// Class Athena.TinySharkGameEventType
// Size: 0x28 (Inherited: 0x28)
struct UTinySharkGameEventType : UGameEventType {
};

// Class Athena.SecondaryInteractReleasedNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct USecondaryInteractReleasedNotificationInputId : UNotificationInputId {
};

// Class Athena.PrimaryInteractReleasedNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct UPrimaryInteractReleasedNotificationInputId : UNotificationInputId {
};

// Class Athena.AbsorbsLiquidInterface
// Size: 0x28 (Inherited: 0x28)
struct UAbsorbsLiquidInterface : UInterface {
};

// Class Athena.AbsorbsLiquidComponent
// Size: 0xd8 (Inherited: 0xc8)
struct UAbsorbsLiquidComponent : UActorComponent {
	char UnknownData_C8[0x10]; // 0xc8(0x10)
};

// Class Athena.AchievementDefinitionDataAsset
// Size: 0x38 (Inherited: 0x28)
struct UAchievementDefinitionDataAsset : UDataAsset {
	struct TArray<struct FAchievementDefinition> AchievementDefintions; // 0x28(0x10)
};

// Class Athena.ActionRulesBlueprintFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UActionRulesBlueprintFunctionLibrary : UBlueprintFunctionLibrary {

	void ExecuteActionRule(struct UClass* InInputId, struct UActionRulesComponent* InActionRulesComponent, struct AActor* InInstigator); // Function Athena.ActionRulesBlueprintFunctionLibrary.ExecuteActionRule // Final|Native|Static|Public|BlueprintCallable // @ game+0xd064a0
	void AddTakeLockKeyActionRule(TScriptInterface<struct UInteractableInterface> InInteractable, struct UClass* InInputId, TScriptInterface<struct ULockableInterface> InLockableInterface, struct UActionRulesComponent* InActionRulesComponent); // Function Athena.ActionRulesBlueprintFunctionLibrary.AddTakeLockKeyActionRule // Final|Native|Static|Public|BlueprintCallable // @ game+0xd05500
};

// Class Athena.ActionRuleTestActor
// Size: 0x3c8 (Inherited: 0x3c8)
struct AActionRuleTestActor : AActor {
};

// Class Athena.RadialContextBase
// Size: 0x28 (Inherited: 0x28)
struct URadialContextBase : UObject {
};

// Class Athena.ActionStateRadialContext
// Size: 0x40 (Inherited: 0x28)
struct UActionStateRadialContext : URadialContextBase {
	struct TArray<struct UClass*> TargetActionStates; // 0x28(0x10)
	bool AreDockablePhrasesRequired; // 0x38(0x01)
	char UnknownData_39[0x7]; // 0x39(0x07)
};

// Class Athena.ActorCoherentViewComponent
// Size: 0x3f0 (Inherited: 0x348)
struct UActorCoherentViewComponent : UCoherentUIGTComponent {
	char UnknownData_348[0xa0]; // 0x348(0xa0)
	struct FName TargetPrimitiveName; // 0x3e8(0x08)

	void ReadyForBindingsEventReceived(); // Function Athena.ActorCoherentViewComponent.ReadyForBindingsEventReceived // Final|Native|Private // @ game+0xd0cdc0
};

// Class Athena.ActorRelevancyTestFunctions
// Size: 0x28 (Inherited: 0x28)
struct UActorRelevancyTestFunctions : UBlueprintFunctionLibrary {

	void WaitForActorToBeAckedForPlayerId(struct UObject* WorldContextObject, struct FLatentActionInfo LatentInfo, struct AActor* Actor, int32_t ClientId, int32_t SplitScreenIndex); // Function Athena.ActorRelevancyTestFunctions.WaitForActorToBeAckedForPlayerId // Final|Native|Static|Public|BlueprintCallable // @ game+0xd105e0
	void WaitForActorToBeAckedForPlayerController(struct UObject* WorldContextObject, struct FLatentActionInfo LatentInfo, struct AActor* Actor, struct APlayerController* PlayerController); // Function Athena.ActorRelevancyTestFunctions.WaitForActorToBeAckedForPlayerController // Final|Native|Static|Public|BlueprintCallable // @ game+0xd10490
	bool IsActorAckedForPlayer(struct APlayerController* PlayerController, struct AActor* Actor); // Function Athena.ActorRelevancyTestFunctions.IsActorAckedForPlayer // Final|Native|Static|Public|BlueprintCallable // @ game+0xd0ab10
};

// Class Athena.AddFogBankAvoidanceAreaStep
// Size: 0x98 (Inherited: 0x98)
struct UAddFogBankAvoidanceAreaStep : UTaleQuestStep {
};

// Class Athena.FogBankManager
// Size: 0x3e8 (Inherited: 0x3c8)
struct AFogBankManager : AActor {
	struct TArray<struct FFeatureToggledFogBankManagerAsset> FeatureToggledManagerAssetsArray; // 0x3c8(0x10)
	struct UFogBankManagerDataAsset* DefaultFogBankManagerDataAsset; // 0x3d8(0x08)
	struct UFogBankManagerDataAsset* ActiveFogBankManagerDataAsset; // 0x3e0(0x08)
};

// Class Athena.FogBankTaleService
// Size: 0x78 (Inherited: 0x60)
struct UFogBankTaleService : UTaleQuestService {
	struct UFogBankTaleServiceDesc* Desc; // 0x60(0x08)
	struct TArray<struct FFogBankManagerFogAvoidanceArea> FogBankAvoidanceAreas; // 0x68(0x10)
};

// Class Athena.FogBankTaleServiceDesc
// Size: 0x28 (Inherited: 0x28)
struct UFogBankTaleServiceDesc : UTaleQuestServiceDesc {
};

// Class Athena.AddFogBankAvoidanceAreaStepDesc
// Size: 0xe0 (Inherited: 0x80)
struct UAddFogBankAvoidanceAreaStepDesc : UTaleQuestStepDesc {
	struct FQuestVariableVector Location; // 0x80(0x30)
	struct FQuestVariableFloat Radius; // 0xb0(0x30)
};

// Class Athena.AddMechanismTriggerStep
// Size: 0xa0 (Inherited: 0x98)
struct UAddMechanismTriggerStep : UTaleQuestStep {
	struct UAddMechanismTriggerStepDesc* Desc; // 0x98(0x08)
};

// Class Athena.AddMechanismTriggerStepDesc
// Size: 0xe0 (Inherited: 0x80)
struct UAddMechanismTriggerStepDesc : UTaleQuestStepDesc {
	struct FQuestVariableActor Action; // 0x80(0x30)
	struct FQuestVariableActor Trigger; // 0xb0(0x30)
};

// Class Athena.AddOpenContainerActionRuleComponent
// Size: 0xd8 (Inherited: 0xc8)
struct UAddOpenContainerActionRuleComponent : UActorComponent {
	struct UClass* NotificationInputId; // 0xc8(0x08)
	char DisplayPriority; // 0xd0(0x01)
	char UnknownData_D1[0x7]; // 0xd1(0x07)
};

// Class Athena.AddReloadAmmoActionRuleComponent
// Size: 0xd8 (Inherited: 0xc8)
struct UAddReloadAmmoActionRuleComponent : UActorComponent {
	struct UClass* NotificationInputId; // 0xc8(0x08)
	char DisplayPriority; // 0xd0(0x01)
	char UnknownData_D1[0x7]; // 0xd1(0x07)
};

// Class Athena.AdjustableWaterLevelPuzzle
// Size: 0x4c8 (Inherited: 0x3c8)
struct AAdjustableWaterLevelPuzzle : AActor {
	char UnknownData_3C8[0x8]; // 0x3c8(0x08)
	struct USceneComponent* RootComp; // 0x3d0(0x08)
	struct UChildActorComponent* WaterVolumeComponent; // 0x3d8(0x08)
	struct AVariableFillRateWaterVolume* WaterVolumeActor; // 0x3e0(0x08)
	struct TArray<struct FWaterPuzzleWaterLevel> WaterLevels; // 0x3e8(0x10)
	int32_t DefaultWaterLevelIndex; // 0x3f8(0x04)
	char UnknownData_3FC[0x4]; // 0x3fc(0x04)
	struct UCurveFloat* FillCurve; // 0x400(0x08)
	struct UCurveFloat* DrainCurve; // 0x408(0x08)
	struct UCurveFloat* ResetCurve; // 0x410(0x08)
	float PuzzleResetTimeout; // 0x418(0x04)
	struct FWaterPuzzleRepData ReppedData; // 0x41c(0x08)
	char UnknownData_424[0xa4]; // 0x424(0xa4)

	void OnRep_ReppedData(); // Function Athena.AdjustableWaterLevelPuzzle.OnRep_ReppedData // Final|Native|Protected // @ game+0xd0c830
	char GetWaterLevelState(); // Function Athena.AdjustableWaterLevelPuzzle.GetWaterLevelState // Final|Native|Public|BlueprintCallable // @ game+0xd0a500
};

// Class Athena.AdjustableWaterLevelPuzzleAudioParams
// Size: 0x50 (Inherited: 0x28)
struct UAdjustableWaterLevelPuzzleAudioParams : UDataAsset {
	struct UWwiseObjectPoolWrapper* WaterLevelPuzzlePool; // 0x28(0x08)
	struct UWwiseEvent* PuzzleWaterRiseStartEvent; // 0x30(0x08)
	struct UWwiseEvent* PuzzleWaterRiseEndEvent; // 0x38(0x08)
	struct UWwiseEvent* PuzzleWaterFallStartEvent; // 0x40(0x08)
	struct UWwiseEvent* PuzzleWaterFallEndEvent; // 0x48(0x08)
};

// Class Athena.QuestBookPageBundle
// Size: 0x38 (Inherited: 0x28)
struct UQuestBookPageBundle : UDataAsset {
	struct TArray<struct FStringAssetReference> Pages; // 0x28(0x10)
};

// Class Athena.AdventuresActorBundleAsset
// Size: 0x38 (Inherited: 0x28)
struct UAdventuresActorBundleAsset : UDataAsset {
	struct TArray<struct FAdventuresActorBundleInfo> Contents; // 0x28(0x10)
};

// Class Athena.AdventuresBundleListingAsset
// Size: 0x38 (Inherited: 0x28)
struct UAdventuresBundleListingAsset : UDataAsset {
	struct TArray<struct FStringAssetReference> Pages; // 0x28(0x10)
};

// Class Athena.AdventuresActorBundleTaleFunctionLibrary
// Size: 0x180 (Inherited: 0x180)
struct UAdventuresActorBundleTaleFunctionLibrary : UTaleQuestFunctionStepLibrary {

	void RetrieveActorsAndBundles(struct UAdventuresActorBundleAsset* Asset, struct TArray<struct AActor*> Actors, struct TArray<struct UQuestBookPageBundle*> Bundles); // Function Athena.AdventuresActorBundleTaleFunctionLibrary.RetrieveActorsAndBundles // Final|Native|Static|Public|HasOutParms // @ game+0xd0d0c0
};

// Class Athena.AdventureSettings
// Size: 0x38 (Inherited: 0x38)
struct UAdventureSettings : UDeveloperSettings {
};

// Class Athena.AgitatedAIStrategyId
// Size: 0x28 (Inherited: 0x28)
struct UAgitatedAIStrategyId : UAIStrategyId {
};

// Class Athena.AIBuffStatus
// Size: 0x30 (Inherited: 0x30)
struct UAIBuffStatus : UStatusBase {
};

// Class Athena.AIDockableObject
// Size: 0x528 (Inherited: 0x510)
struct AAIDockableObject : AControllableObject {
	char UnknownData_510[0x8]; // 0x510(0x08)
	struct UClass* InteractableType; // 0x518(0x08)
	float InteractableOffset; // 0x520(0x04)
	char UnknownData_524[0x4]; // 0x524(0x04)
};

// Class Athena.AIDockableWheel
// Size: 0x528 (Inherited: 0x528)
struct AAIDockableWheel : AAIDockableObject {
};

// Class Athena.AIEmergentCaptainSpawner
// Size: 0x5a8 (Inherited: 0x598)
struct UAIEmergentCaptainSpawner : UAIPerCrewSpawner {
	char UnknownData_598[0x8]; // 0x598(0x08)
	struct UNamedAIDataAsset* NamedAIDataAsset; // 0x5a0(0x08)
};

// Class Athena.AIFormWithVFXComponent
// Size: 0x160 (Inherited: 0x148)
struct UAIFormWithVFXComponent : UAthenaAIFormComponent {
	struct UParticleSystem* ParticlesTemplate; // 0x148(0x08)
	struct UParticleSystemComponent* ParticleSystemComponent; // 0x150(0x08)
	float ParticleActivationDelay; // 0x158(0x04)
	struct FTimerHandle ActivationTimerHandle; // 0x15c(0x04)
};

// Class Athena.AIFormWithVFXDataAsset
// Size: 0xa0 (Inherited: 0x90)
struct UAIFormWithVFXDataAsset : UAthenaAIFormDataAsset {
	struct UParticleSystem* ParticlesTemplate; // 0x90(0x08)
	float ParticleActivationDelay; // 0x98(0x04)
	char UnknownData_9C[0x4]; // 0x9c(0x04)
};

// Class Athena.AIKnockbackActionStateId
// Size: 0x28 (Inherited: 0x28)
struct UAIKnockbackActionStateId : UActionStateId {
};

// Class Athena.LoadoutAsset
// Size: 0x50 (Inherited: 0x28)
struct ULoadoutAsset : UDataAsset {
	struct FItemLoadout ItemLoadout; // 0x28(0x20)
	struct FName FeatureName; // 0x48(0x08)
};

// Class Athena.AILoadoutWithNonStoreableAsset
// Size: 0x60 (Inherited: 0x50)
struct UAILoadoutWithNonStoreableAsset : ULoadoutAsset {
	char UnknownData_50[0x8]; // 0x50(0x08)
	struct UClass* NonStoreableItem; // 0x58(0x08)
};

// Class Athena.AimSensitivityComponent
// Size: 0x108 (Inherited: 0xc8)
struct UAimSensitivityComponent : UActorComponent {
	char UnknownData_C8[0x40]; // 0xc8(0x40)
};

// Class Athena.AimWeaponPressedNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct UAimWeaponPressedNotificationInputId : UNotificationInputId {
};

// Class Athena.AimWeaponReleasedNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct UAimWeaponReleasedNotificationInputId : UAimWeaponPressedNotificationInputId {
};

// Class Athena.AIOnShipManagerComponent
// Size: 0xe8 (Inherited: 0xc8)
struct UAIOnShipManagerComponent : UActorComponent {
	char UnknownData_C8[0x8]; // 0xc8(0x08)
	struct UAIProximityPlayerTracker* AIProximityPlayerTracker; // 0xd0(0x08)
	struct TArray<struct UAIFixedWavesSpawner*> AIOnShipAIFixedWavesSpawners; // 0xd8(0x10)
};

// Class Athena.ProjectileWeaponFiringIntentionInterface
// Size: 0x28 (Inherited: 0x28)
struct UProjectileWeaponFiringIntentionInterface : UInterface {
};

// Class Athena.AIProjectileWeaponFiringIntentionComponent
// Size: 0x100 (Inherited: 0xc8)
struct UAIProjectileWeaponFiringIntentionComponent : UActorComponent {
	char UnknownData_C8[0x8]; // 0xc8(0x08)
	struct APawn* PawnOwner; // 0xd0(0x08)
	struct AAthenaAIControllerBase* AIController; // 0xd8(0x08)
	char UnknownData_E0[0x1c]; // 0xe0(0x1c)
	float DefaultHitChance; // 0xfc(0x04)
};

// Class Athena.AIQuickDeathInterface
// Size: 0x28 (Inherited: 0x28)
struct UAIQuickDeathInterface : UInterface {
};

// Class Athena.AIShipCaptainActionStateId
// Size: 0x28 (Inherited: 0x28)
struct UAIShipCaptainActionStateId : UActionStateId {

	void PushCharacterIntoAIShipCaptainActionState(char TrackId, TScriptInterface<struct UDockableInterface> DockableInterface, TScriptInterface<struct UControllableInterface> ControllableInterface, struct AActor* Character); // Function Athena.AIShipCaptainActionStateId.PushCharacterIntoAIShipCaptainActionState // Final|Native|Static|Public|BlueprintCallable // @ game+0xd0cc50
};

// Class Athena.ItemSpawnComponent
// Size: 0x440 (Inherited: 0x2e0)
struct UItemSpawnComponent : USceneComponent {
	bool SpawnOnStart; // 0x2e0(0x01)
	char UnknownData_2E1[0x7]; // 0x2e1(0x07)
	struct FItemSpawnParams SpawnParams; // 0x2e8(0x28)
	struct UWeightedItemDescSpawnDataAsset* ReferencedSpawnDistributionAsset; // 0x310(0x08)
	struct TArray<struct FItemSpawnTransform> SpawnTransforms; // 0x318(0x10)
	struct TArray<struct FItemSpawnTransformWithRandomQuantity> SpawnTransformsWithRandomQuantities; // 0x328(0x10)
	struct FName FeatureToggle; // 0x338(0x08)
	char SpawnSource; // 0x340(0x01)
	char UnknownData_341[0x3]; // 0x341(0x03)
	float SpawnRate; // 0x344(0x04)
	bool DestroyProxiesOnEndPlay; // 0x348(0x01)
	bool SpawnWithPhysicsEnabled; // 0x349(0x01)
	bool DoNotAttachToOwnerWhenSpawned; // 0x34a(0x01)
	bool DropItemsOnSpawn; // 0x34b(0x01)
	bool DropItemsUsingPriorityAIDropParams; // 0x34c(0x01)
	char UnknownData_34D[0x3]; // 0x34d(0x03)
	struct TArray<struct FSpawnInstance> SpawnList; // 0x350(0x10)
	struct TArray<struct FSpawnInstance> SingleItemInstances; // 0x360(0x10)
	struct TArray<struct FSpawnedItem> SpawnedItems; // 0x370(0x10)
	char UnknownData_380[0xc0]; // 0x380(0xc0)
};

// Class Athena.AIShipItemSpawnComponent
// Size: 0x4a0 (Inherited: 0x440)
struct UAIShipItemSpawnComponent : UItemSpawnComponent {
	bool SpawnAlways; // 0x440(0x01)
	bool SpawnForBattleFinalShip; // 0x441(0x01)
	bool SpawnForPassiveShip; // 0x442(0x01)
	bool SpawnForAggressiveShip; // 0x443(0x01)
	char UnknownData_444[0x5c]; // 0x444(0x5c)
};

// Class Athena.EmotesInterface
// Size: 0x28 (Inherited: 0x28)
struct UEmotesInterface : UInterface {
};

// Class Athena.LookAtOffsetComponent
// Size: 0x180 (Inherited: 0xc8)
struct ULookAtOffsetComponent : UActorComponent {
	char UnknownData_C8[0xb8]; // 0xc8(0xb8)

	struct FLookAtOffset GetLookAtOffset(); // Function Athena.LookAtOffsetComponent.GetLookAtOffset // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0xd09690
	void DisableRotation(); // Function Athena.LookAtOffsetComponent.DisableRotation // Final|Native|Public|BlueprintCallable // @ game+0xd063b0
};

// Class Athena.CharacterMeshInterface
// Size: 0x28 (Inherited: 0x28)
struct UCharacterMeshInterface : UInterface {
};

// Class Athena.CharacterInterface
// Size: 0x28 (Inherited: 0x28)
struct UCharacterInterface : UCharacterMeshInterface {

	struct FVector GetMouthPosition(); // Function Athena.CharacterInterface.GetMouthPosition // Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const // @ game+0xd098c0
};

// Class Athena.FireSettingsDataAsset
// Size: 0x70 (Inherited: 0x28)
struct UFireSettingsDataAsset : UDataAsset {
	float CharacterOnFireEffectRadius; // 0x28(0x04)
	char TraceChannel; // 0x2c(0x01)
	char UnknownData_2D[0x3]; // 0x2d(0x03)
	float CharacterToCharacterPropagationInterval; // 0x30(0x04)
	float MaxInitialPropagationOffset; // 0x34(0x04)
	struct FStatus BurnStatus; // 0x38(0x18)
	struct FStatus FirePropagationStatus; // 0x50(0x18)
	uint32_t MaxComponentsToTickPerFrame; // 0x68(0x04)
	char UnknownData_6C[0x4]; // 0x6c(0x04)
};

// Class Athena.CharacterFlammableComponent
// Size: 0x270 (Inherited: 0x110)
struct UCharacterFlammableComponent : UActorFlammableComponent {
	char UnknownData_110[0x30]; // 0x110(0x30)
	float FireFalloffDuration; // 0x140(0x04)
	float FireRateOfFalloffInRain; // 0x144(0x04)
	float FireFalloffMultiplier; // 0x148(0x04)
	struct FName VfxSocketName; // 0x14c(0x08)
	char UnknownData_154[0xc]; // 0x154(0x0c)
	struct FTransform SocketRelativeOffset; // 0x160(0x30)
	char UnknownData_190[0x88]; // 0x190(0x88)
	struct UWorld* CachedWorld; // 0x218(0x08)
	char UnknownData_220[0x8]; // 0x220(0x08)
	struct UFireSettingsDataAsset* FireSettingsAsset; // 0x228(0x08)
	char UnknownData_230[0x40]; // 0x230(0x40)
};

// Class Athena.CharacterFootImpactMeshInterface
// Size: 0x28 (Inherited: 0x28)
struct UCharacterFootImpactMeshInterface : UInterface {

	struct USkeletalMeshComponent* GetFootImpactSkeletonMeshComponent(); // Function Athena.CharacterFootImpactMeshInterface.GetFootImpactSkeletonMeshComponent // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0xd079f0
};

// Class Athena.ObscuredVisionInterface
// Size: 0x28 (Inherited: 0x28)
struct UObscuredVisionInterface : UInterface {
};

// Class Athena.PlayerPrivilegeInterface
// Size: 0x28 (Inherited: 0x28)
struct UPlayerPrivilegeInterface : UInterface {
};

// Class Athena.PirateDescInterface
// Size: 0x28 (Inherited: 0x28)
struct UPirateDescInterface : UInterface {
};

// Class Athena.CloudDomeInterface
// Size: 0x28 (Inherited: 0x28)
struct UCloudDomeInterface : UInterface {

	void UpdateCloudMeshes(struct FCloudVisualParameters CloudVisualParametersIn, struct TArray<struct FTiledCloudProperties> CloudTileIn, struct TArray<struct FRenderedCloudProperties> RenderedCloudsIn, struct TArray<struct FCloudTypeDefinition> CloudMeshesIn, struct TArray<struct FCloudTypeNormalizedWeight> NormalizedCloudWeightsIn); // Function Athena.CloudDomeInterface.UpdateCloudMeshes // Native|Public|HasOutParms|BlueprintCallable // @ game+0xd0fbe0
	struct FVector GetCloudDomePosition(); // Function Athena.CloudDomeInterface.GetCloudDomePosition // Native|Public|HasDefaults|BlueprintCallable // @ game+0xd07510
};

// Class Athena.CloudDome
// Size: 0x6b0 (Inherited: 0x3c8)
struct ACloudDome : AActor {
	char UnknownData_3C8[0xb8]; // 0x3c8(0xb8)
	struct ULocalPlayer* LocalPlayer; // 0x480(0x08)
	char UnknownData_488[0x228]; // 0x488(0x228)
};

// Class Athena.AthenaCharacter
// Size: 0xc00 (Inherited: 0x5e0)
struct AAthenaCharacter : ACharacter {
	char UnknownData_5E0[0x120]; // 0x5e0(0x120)
	struct ULookAtOffsetComponent* LookAtOffsetComponent; // 0x700(0x08)
	struct UAnimationDataStoreAsset* AnimationDataStoreAsset; // 0x708(0x08)
	struct UAthenaAnimationSittingDataAsset* SittingAnimationDataAssets; // 0x710(0x08)
	struct UAthenaCharacterMovementComponent* AthenaCharacterMovementComponent; // 0x718(0x08)
	struct FDocker Docker; // 0x720(0x90)
	struct UActionStateMachineComponent* ActionStateMachineComponent; // 0x7b0(0x08)
	struct UActionStatePriorityTableData* ActionStatePriorityTableData; // 0x7b8(0x08)
	struct UClass* ActionStateCreatorDefinition; // 0x7c0(0x08)
	struct FObjectMessagingDispatcher ObjectMessageDispatcher; // 0x7c8(0xa0)
	struct UWieldableItemSetComponent* WieldableItemSetComponent; // 0x868(0x08)
	struct UWieldedItemComponent* WieldedItemComponent; // 0x870(0x08)
	struct USceneComponent* MeshAdjustmentComponent; // 0x878(0x08)
	struct UInventoryManipulatorComponent* InventoryManipulatorComponent; // 0x880(0x08)
	struct ULoadoutComponent* LoadoutComponent; // 0x888(0x08)
	struct UItemLoadoutComponent* ItemLoadoutComponent; // 0x890(0x08)
	struct UHealthComponent* HealthComponent; // 0x898(0x08)
	struct UAthenaCharacterStateManagerComponent* StateManagerComponent; // 0x8a0(0x08)
	struct URewindComponent* RewindComponent; // 0x8a8(0x08)
	struct UActorDamageableComponent* ActorDamageableComponent; // 0x8b0(0x08)
	struct UCharacterHitReactionComponent* CharacterHitReactionComponent; // 0x8b8(0x08)
	struct UAnimNotifyWwiseEmitterComponent* AnimNotifyWwiseEmitterComponent; // 0x8c0(0x08)
	struct UMeleeAttackProcessorComponent* MeleeAttackProcessor; // 0x8c8(0x08)
	struct UHitDetectionComponent* HitDetectionComponent; // 0x8d0(0x08)
	struct UAthenaCharacterKnockbackComponent* KnockBackComponent; // 0x8d8(0x08)
	struct UAthenaCharacterDodgeComponent* DodgeComponent; // 0x8e0(0x08)
	struct UCharacterAINoiseEventComponent* CharacterAINoiseEventComponent; // 0x8e8(0x08)
	struct UActionRulesComponent* PrivateActionRulesComponent; // 0x8f0(0x08)
	struct UShipTrackerComponent* ShipTrackerComponent; // 0x8f8(0x08)
	struct UWatercraftTrackerComponent* WatercraftTrackerComponent; // 0x900(0x08)
	struct UItemLoaderComponent* ItemLoaderComponent; // 0x908(0x08)
	struct URetractableCharacterComponent* RetractableCharacterComponent; // 0x910(0x08)
	struct UResourceProviderComponent* ResourceProviderComponent; // 0x918(0x08)
	struct UCharacterFlammableComponent* CharacterFlammableComponent; // 0x920(0x08)
	struct USoakableComponent* SoakableComponent; // 0x928(0x08)
	struct UWaterExposureComponent* WaterExposureComponent; // 0x930(0x08)
	struct UShelteredComponent* ShelteredComponent; // 0x938(0x08)
	struct UBoxedRpcDispatcherComponent* BoxedRpcDispatcherComponent; // 0x940(0x08)
	struct UCosmeticItemAnimationComponent* CosmeticItemAnimationComponent; // 0x948(0x08)
	struct UInteractionPreventionComponent* InteractionPreventionComponent; // 0x950(0x08)
	struct FMulticastDelegate OnJumpedDelegate; // 0x958(0x10)
	char UnknownData_968[0x10]; // 0x968(0x10)
	struct UMovementInterferenceComponent* InterferenceComponent; // 0x978(0x08)
	struct UWaterInteractionComponent* WaterInteractionComponent; // 0x980(0x08)
	struct UClass* ThirdPersonAnimSetDataId; // 0x988(0x08)
	bool OverrideEncroachesBlockingGeometry; // 0x990(0x01)
	char OverrideEncroachesBlockingGeometryChannel; // 0x991(0x01)
	char UnknownData_992[0x2]; // 0x992(0x02)
	struct FName OverrideFloorSweepCollisionProfileName; // 0x994(0x08)
	char UnknownData_99C[0x20]; // 0x99c(0x20)
	float MovementThresholdToRecordRewindTransform; // 0x9bc(0x04)
	char UnknownData_9C0[0xc]; // 0x9c0(0x0c)
	int32_t SpawnAnimIndex; // 0x9cc(0x04)
	char UnknownData_9D0[0x70]; // 0x9d0(0x70)
	struct UAnimationDataStore* AnimationDataStore; // 0xa40(0x08)
	char UnknownData_A48[0x40]; // 0xa48(0x40)
	struct APlayerState* OldPlayerState; // 0xa88(0x08)
	char UnknownData_A90[0x3c]; // 0xa90(0x3c)
	float RelativeTargetYawOnMovingBase; // 0xacc(0x04)
	char UnknownData_AD0[0x30]; // 0xad0(0x30)
	float SmoothYawOnMovingBaseTime; // 0xb00(0x04)
	int32_t RandomAnimationSeed; // 0xb04(0x04)
	char UnknownData_B08[0x8]; // 0xb08(0x08)
	bool RandomBool; // 0xb10(0x01)
	char UnknownData_B11[0x27]; // 0xb11(0x27)
	struct USkeletalMeshSocket* CameraSocket; // 0xb38(0x08)
	char UnknownData_B40[0x48]; // 0xb40(0x48)
	struct TArray<struct UInputComponent*> RegisteredInputComponents; // 0xb88(0x10)
	char UnknownData_B98[0x68]; // 0xb98(0x68)

	char WieldItem(TScriptInterface<struct UWieldableInterface> Item, bool Fast); // Function Athena.AthenaCharacter.WieldItem // RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd10de0
	bool UseItem(struct UClass* NotificationInputId); // Function Athena.AthenaCharacter.UseItem // RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd10350
	void UpdateWaterServiceInterface(); // Function Athena.AthenaCharacter.UpdateWaterServiceInterface // Final|Native|Public|BlueprintCallable // @ game+0xd10270
	void UnforceWaterHeight(); // Function Athena.AthenaCharacter.UnforceWaterHeight // Final|Native|Public|BlueprintCallable // @ game+0xd0f7e0
	void SetIgnoreReplicationRotationOnly(bool InIgnoreReplicationRotationOnly); // Function Athena.AthenaCharacter.SetIgnoreReplicationRotationOnly // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd0def0
	void ReceiveRestart(); // Function Athena.AthenaCharacter.ReceiveRestart // Event|Protected|BlueprintEvent // @ game+0x1848130
	void PickUpItem(struct AItemInfo* ItemInfo, bool AndWield); // Function Athena.AthenaCharacter.PickUpItem // RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd0ca40
	void OnRep_RandomAnimationSeed(); // Function Athena.AthenaCharacter.OnRep_RandomAnimationSeed // Final|Native|Private // @ game+0xd0c470
	void Multicast_DebugSetInertFromServer(bool IsInert); // Function Athena.AthenaCharacter.Multicast_DebugSetInertFromServer // RequiredAPI|Net|NetReliableNative|Event|NetMulticast|Public // @ game+0xd0b820
	void Kill(char DeathType); // Function Athena.AthenaCharacter.Kill // RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd0b180
	bool IsInWater(); // Function Athena.AthenaCharacter.IsInWater // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0acf0
	bool IsInteractionValid(struct UObject* InInteractable); // Function Athena.AthenaCharacter.IsInteractionValid // RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd0ad20
	bool IsDead(); // Function Athena.AthenaCharacter.IsDead // RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0acb0
	void InteractWith(struct UObject* InInteractable, struct UClass* NotificationInputId); // Function Athena.AthenaCharacter.InteractWith // RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd0a9c0
	void Interact(struct UObject* InInteractable); // Function Athena.AthenaCharacter.Interact // Final|Native|Public|BlueprintCallable // @ game+0xd0a940
	bool HasValidWaterHeight(); // Function Athena.AthenaCharacter.HasValidWaterHeight // RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0a7d0
	bool HasMovementBase(); // Function Athena.AthenaCharacter.HasMovementBase // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0a770
	void HandleCharacterMovementUpdated(float DeltaSeconds, struct FVector OldLocation, struct FVector OldVelocity); // Function Athena.AthenaCharacter.HandleCharacterMovementUpdated // Final|Native|Private|HasDefaults // @ game+0xd0a560
	float GetYawOnMovingBase(); // Function Athena.AthenaCharacter.GetYawOnMovingBase // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0a530
	float GetWaterLevelRelativeToCharacterBasePosition(); // Function Athena.AthenaCharacter.GetWaterLevelRelativeToCharacterBasePosition // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0a4d0
	float GetWaterHeight(); // Function Athena.AthenaCharacter.GetWaterHeight // RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0a490
	float GetViewPitch(); // Function Athena.AthenaCharacter.GetViewPitch // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0a390
	bool GetValidWaterHeightAtomic(float OutWaterHeight); // Function Athena.AthenaCharacter.GetValidWaterHeightAtomic // RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0xd0a230
	struct USkeletalMeshComponent* GetThirdPersonMeshComponent(); // Function Athena.AthenaCharacter.GetThirdPersonMeshComponent // RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09f20
	bool GetIgnoreReplicationRotationOnly(); // Function Athena.AthenaCharacter.GetIgnoreReplicationRotationOnly // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd07ac0
	struct UObject* GetFocusedInteractable(); // Function Athena.AthenaCharacter.GetFocusedInteractable // RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd07970
	struct FCollisionResponseContainer GetFloorSweepCollisionResponseContainer(); // Function Athena.AthenaCharacter.GetFloorSweepCollisionResponseContainer // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd07930
	struct USkeletalMeshComponent* GetFirstPersonMeshComponent(); // Function Athena.AthenaCharacter.GetFirstPersonMeshComponent // RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd078b0
	struct AActor* GetCurrentShip(); // Function Athena.AthenaCharacter.GetCurrentShip // RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd07700
	struct FTransform GetCharacterTransform(); // Function Athena.AthenaCharacter.GetCharacterTransform // RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xd071e0
	struct FRotator GetCharacterRotation(); // Function Athena.AthenaCharacter.GetCharacterRotation // RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xd07190
	void GenerateNewRandomBool(); // Function Athena.AthenaCharacter.GenerateNewRandomBool // Final|Native|Public|BlueprintCallable // @ game+0xd06a00
	void GenerateNewRandomAnimationSeed(); // Function Athena.AthenaCharacter.GenerateNewRandomAnimationSeed // RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd069e0
	void ForceWaterHeight(float WaterHeight, struct UClass* WaterId); // Function Athena.AthenaCharacter.ForceWaterHeight // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd06910
	void CureAllAilings(); // Function Athena.AthenaCharacter.CureAllAilings // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd06290
	void CreateProjectileTraceHitVolume(); // Function Athena.AthenaCharacter.CreateProjectileTraceHitVolume // RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd06270
	bool CanInteractWith(struct UObject* InInteractable, struct UClass* NotificationInputId); // Function Athena.AthenaCharacter.CanInteractWith // RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd05d20
	void CalculateWaterHeight(); // Function Athena.AthenaCharacter.CalculateWaterHeight // RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd05cf0
	bool AllAnimationsLoaded(); // Function Athena.AthenaCharacter.AllAnimationsLoaded // RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd05690
};

// Class Athena.BriggableInterface
// Size: 0x28 (Inherited: 0x28)
struct UBriggableInterface : UInterface {
};

// Class Athena.SwimAttackableInterface
// Size: 0x28 (Inherited: 0x28)
struct USwimAttackableInterface : UInterface {
};

// Class Athena.PlayerManagerServiceInterface
// Size: 0x28 (Inherited: 0x28)
struct UPlayerManagerServiceInterface : UInterface {

	struct APlayerState* GetPlayerStateFromPlayerGameId(struct FGuid InPlayerGameId); // Function Athena.PlayerManagerServiceInterface.GetPlayerStateFromPlayerGameId // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xd09bf0
	struct AAthenaPlayerCharacter* GetPlayerCharacterFromPlayerState(struct APlayerState* PlayerState); // Function Athena.PlayerManagerServiceInterface.GetPlayerCharacterFromPlayerState // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09b50
	int32_t GetNumPlayers(); // Function Athena.PlayerManagerServiceInterface.GetNumPlayers // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09970
	int32_t GetNumActiveLocalPlayers(); // Function Athena.PlayerManagerServiceInterface.GetNumActiveLocalPlayers // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09940
	struct APlayerController* GetFirstLocalPlayerController(); // Function Athena.PlayerManagerServiceInterface.GetFirstLocalPlayerController // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd07880
	struct ACharacter* GetFirstLocalPlayer(); // Function Athena.PlayerManagerServiceInterface.GetFirstLocalPlayer // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd07850
	struct TArray<struct FWeakActorHandle> GetAllPlayerControllersWeakActorHandle(); // Function Athena.PlayerManagerServiceInterface.GetAllPlayerControllersWeakActorHandle // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd06e20
	struct TArray<struct AAthenaPlayerCharacter*> GetAllActivePlayers(); // Function Athena.PlayerManagerServiceInterface.GetAllActivePlayers // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd06d80
	struct TArray<struct AAthenaPlayerCharacter*> GetActiveLocalPlayers(); // Function Athena.PlayerManagerServiceInterface.GetActiveLocalPlayers // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd06b60
};

// Class Athena.CloudDomeServiceInterface
// Size: 0x28 (Inherited: 0x28)
struct UCloudDomeServiceInterface : UInterface {

	void UnregisterCloudDomeFromService(TScriptInterface<struct UCloudDomeInterface> CloudDome); // Function Athena.CloudDomeServiceInterface.UnregisterCloudDomeFromService // Native|Public|BlueprintCallable // @ game+0xd0f890
	void RegisterCloudDomeWithService(TScriptInterface<struct UCloudDomeInterface> CloudDome); // Function Athena.CloudDomeServiceInterface.RegisterCloudDomeWithService // Native|Public|BlueprintCallable // @ game+0xd0cde0
	int32_t GetNumberOfCloudDomes(); // Function Athena.CloudDomeServiceInterface.GetNumberOfCloudDomes // Native|Public|BlueprintCallable // @ game+0xd099a0
	TScriptInterface<struct UCloudDomeInterface> GetCloudDome(int32_t CloudDomeIndex); // Function Athena.CloudDomeServiceInterface.GetCloudDome // Native|Public|BlueprintCallable // @ game+0xd07460
	struct ACloudDome* GetActualCloudDome(int32_t CloudDomeIndex); // Function Athena.CloudDomeServiceInterface.GetActualCloudDome // Native|Public|BlueprintCallable // @ game+0xd06ce0
};

// Class Athena.AthenaPlayerCharacter
// Size: 0x1f20 (Inherited: 0xc00)
struct AAthenaPlayerCharacter : AAthenaCharacter {
	char UnknownData_C00[0x150]; // 0xc00(0x150)
	struct USceneComponent* FirstPersonMeshOffsetComponent; // 0xd50(0x08)
	struct USkeletalMeshComponent* FirstPersonMesh; // 0xd58(0x08)
	struct UAthenaCameraComponent* FirstPersonCamera; // 0xd60(0x08)
	struct TArray<struct UParticleSystemComponent*> FirstPersonParticleComponents; // 0xd68(0x10)
	struct UAthenaCameraComponent* ThirdPersonCamera; // 0xd78(0x08)
	struct TArray<struct UParticleSystemComponent*> ThirdPersonParticleComponents; // 0xd80(0x10)
	struct UAthenaCameraComponent* SpringArmCamera; // 0xd90(0x08)
	struct ULookAtEmoteCameraComponent* LookAtEmoteCameraComponent; // 0xd98(0x08)
	struct UAthenaSpringArmComponent* SpringArm; // 0xda0(0x08)
	struct UChildActorComponent* LocalCloudDome; // 0xda8(0x08)
	struct UCharacterInteractionComponent* InteractionComponent; // 0xdb0(0x08)
	struct UClimbingComponent* ClimbingComponent; // 0xdb8(0x08)
	struct UDrunkennessComponent* DrunkennessComponent; // 0xdc0(0x08)
	struct UStaggerComponent* StaggerComponent; // 0xdc8(0x08)
	struct UDrowningComponent* DrowningComponent; // 0xdd0(0x08)
	struct URumbleHandlerComponent* RumbleHandlerComponent; // 0xdd8(0x08)
	struct UScreenSpaceVfxComponent* ScreenSpaceVfxComponent; // 0xde0(0x08)
	struct UTreasureMapCollectionComponent* TreasureMapCollectionComponent; // 0xde8(0x08)
	struct UPhrasesRadialComponent* PhrasesRadialComponent; // 0xdf0(0x08)
	struct UQuickInventoryComponent* QuickInventoryComponent; // 0xdf8(0x08)
	struct UPointOfInterestTrackerComponent* PointOfInterestTrackerComponent; // 0xe00(0x08)
	struct ULimpingComponent* LimpingComponent; // 0xe08(0x08)
	struct UPacingComponent* PacingComponent; // 0xe10(0x08)
	struct UBurpComponent* BurpComponent; // 0xe18(0x08)
	struct UMeleeAttackLockOnComponent* MeleeLockOnComponent; // 0xe20(0x08)
	struct UDeathSelfInteractionComponent* DeathSelfInteractionComponent; // 0xe28(0x08)
	struct URidePlayerComponent* RidePlayerComponent; // 0xe30(0x08)
	struct UReviveDebugComponent* ReviveDebugComponent; // 0xe38(0x08)
	struct UFlashbangEffectComponent* FlashbangEffectComponent; // 0xe40(0x08)
	struct UWorldLocationVisitorComponent* WorldLocationVisitorComponent; // 0xe48(0x08)
	struct UMeleeAttackLockOnComponentSettings* MeleeAttackLockOnSettings; // 0xe50(0x08)
	struct UStatusEffectManagerComponent* StatusEffectManagerComponent; // 0xe58(0x08)
	struct UStatusEffectPersistenceComponent* StatusEffectPersistenceComponent; // 0xe60(0x08)
	struct UPlayerCurseComponent* PlayerCurseComponent; // 0xe68(0x08)
	struct UMaterialStatusSusceptibilityComponent* MaterialStatusSusceptibilityComponent; // 0xe70(0x08)
	struct UHealthRegenerationPoolComponent* HealthRegenerationPoolComponent; // 0xe78(0x08)
	struct USicknessComponent* SicknessComponent; // 0xe80(0x08)
	struct URewindComponent* PlayerViewRewindComponent; // 0xe88(0x08)
	struct UCapsuleComponent* ProjectileTraceHitVolume; // 0xe90(0x08)
	struct UPlayerMerchantContractsComponent* PlayerMerchantContractsComponent; // 0xe98(0x08)
	struct UPlayerShroudBreakerTrackerComponent* PlayerShroudBreakerTrackerComponent; // 0xea0(0x08)
	struct UPetOwnerComponent* PetOwnerComponent; // 0xea8(0x08)
	struct UAISpawnContextContainerComponent* SpawnContextContainerComponent; // 0xeb0(0x08)
	struct URadialManagerComponent* RadialManager; // 0xeb8(0x08)
	struct UStreamingLocationComponent* StreamingLocationComponent; // 0xec0(0x08)
	struct UEquipClothingComponent* EquipClothingComponent; // 0xec8(0x08)
	float CameraFOVWhenSprinting; // 0xed0(0x04)
	char UnknownData_ED4[0x4]; // 0xed4(0x04)
	struct UCurveVector* ApproximateCamPitchToLocalCamOffsetCurve; // 0xed8(0x08)
	struct FWalkConditionsParams WalkConditionParams; // 0xee0(0x08)
	struct FSprintConditionsParams ServerSprintConditionParams; // 0xee8(0x0c)
	struct FSprintConditionsParams ClientSprintConditionParams; // 0xef4(0x0c)
	float SprintingServerTimeTolerance; // 0xf00(0x04)
	float PostSprintResetTime; // 0xf04(0x04)
	struct UAthenaSpringArmComponentParams* EmoteSpringArmParameters; // 0xf08(0x08)
	struct UAthenaSpringArmComponentParams* DeathSpringArmParameters; // 0xf10(0x08)
	struct UEmotesRadialDataAsset* EmotesRadialDataAsset; // 0xf18(0x08)
	bool AllowAnimationTickAggregation; // 0xf20(0x01)
	char UnknownData_F21[0x3]; // 0xf21(0x03)
	struct FAchievementKillOpponentFromBehindWithBlunderbuss AchievementKillOpponentFromBehindWithBlunderbuss; // 0xf24(0x04)
	struct FAchievementHeavyAttackRivalOffTheirShip AchievementHeavyAttackRivalOffTheirShip; // 0xf28(0x10)
	struct FAchievementBlockThenHitAndGetBlockedThenTakeHit AchievementBlockThenHitAndGetBlockedThenTakeHit; // 0xf38(0x10)
	struct FAchievementHaveADrinkWithAnotherCrewAtAnOutpost AchievementHaveADrinkWithAnotherCrewAtAnOutpost; // 0xf48(0x20)
	struct FAchievementKillOpponentInContest AchievementKillOpponentInContest; // 0xf68(0x08)
	struct UClass* ConditionalStatsTriggerForKillingAnotherPlayer; // 0xf70(0x08)
	struct UAICreatureMovementModifierParamsDataAsset* PirateLegendHideoutPetMovementData; // 0xf78(0x08)
	struct UAICreatureMovementModifierParamsDataAsset* OnShipPetMovementData; // 0xf80(0x08)
	struct UAsyncLoadoutRepairComponent* RepairComponent; // 0xf88(0x08)
	struct USeasonProgressionUIComponent* SeasonUIComponent; // 0xf90(0x08)
	struct UAimAssistComponent* AimAssistComponent; // 0xf98(0x08)
	struct UAimAssistTargetComponent* AimAssistTargetComponent; // 0xfa0(0x08)
	struct USequencerCameraDockingComponent* SequencerCameraDockingComponent; // 0xfa8(0x08)
	struct UEmotePropData* EmotePropData; // 0xfb0(0x08)
	char UnknownData_FB8[0xb0]; // 0xfb8(0xb0)
	struct UClass* FirstPersonAnimSetDataId; // 0x1068(0x08)
	struct UAnimationDataStoreWeakReferenceAsset* FirstPersonAnimationDataStoreWeakReferencesAsset; // 0x1070(0x08)
	char CharacterType; // 0x1078(0x01)
	char UnknownData_1079[0x20]; // 0x1079(0x20)
	bool IsWearingSkeletonCurseCached; // 0x1099(0x01)
	bool IsWearingGhostCurseCached; // 0x109a(0x01)
	char UnknownData_109B[0xc2d]; // 0x109b(0xc2d)
	struct UClothingLoadoutComponent* ClothingLoadoutComponent; // 0x1cc8(0x08)
	struct UPetLoadoutComponent* PetLoadoutComponent; // 0x1cd0(0x08)
	struct UVoyageParticipantComponent* PrimaryVoyageParticipantComponent; // 0x1cd8(0x08)
	struct UVoyageParticipantComponent* TaleVoyageParticipantComponent; // 0x1ce0(0x08)
	struct UVoyageParticipantComponent* EmergentVoyageParticipantComponent; // 0x1ce8(0x08)
	struct UPlayerWorldLocationComponent* PlayerWorldLocationComponent; // 0x1cf0(0x08)
	struct UChainLightningReceiverComponent* ChainLightningReceiverComponent; // 0x1cf8(0x08)
	struct UPlayerGuildComponent* PlayerGuildComponent; // 0x1d00(0x08)
	struct UGuildSignUpComponent* GuildSignUpComponent; // 0x1d08(0x08)
	struct UInteractableComponentWithTooltipDetailedEventProvider* EmoteInteractableComponent; // 0x1d10(0x08)
	struct FAthenaPlayerCharacterModelSwap PendingModelSwap; // 0x1d18(0x68)
	char UnknownData_1D80[0x20]; // 0x1d80(0x20)
	struct FName ReplicatedOverrideAnimationEntry; // 0x1da0(0x08)
	char UnknownData_1DA8[0x9]; // 0x1da8(0x09)
	bool ReplicatedEmoteExitAllowed; // 0x1db1(0x01)
	char UnknownData_1DB2[0x7e]; // 0x1db2(0x7e)
	bool FinishedWaitingForSpawn; // 0x1e30(0x01)
	char UnknownData_1E31[0x31]; // 0x1e31(0x31)
	bool AutoFloatInWater; // 0x1e62(0x01)
	char UnknownData_1E63[0x1]; // 0x1e63(0x01)
	bool ReplicatedIsSprinting; // 0x1e64(0x01)
	char UnknownData_1E65[0x1b]; // 0x1e65(0x1b)
	float AutoMoveCancelThreshold; // 0x1e80(0x04)
	int32_t ReplicatedOverridePirateDescSeed; // 0x1e84(0x04)
	bool PreventJumping; // 0x1e88(0x01)
	bool StopMovementAndPreventSwimming; // 0x1e89(0x01)
	char UnknownData_1E8A[0x96]; // 0x1e8a(0x96)

	void WalkActivate(); // Function Athena.AthenaPlayerCharacter.WalkActivate // RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd10db0
	bool UseItem(struct UClass* NotificationInputId); // Function Athena.AthenaPlayerCharacter.UseItem // RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd103f0
	void TriggerTattooGlow(); // Function Athena.AthenaPlayerCharacter.TriggerTattooGlow // Event|Public|BlueprintEvent // @ game+0x1848130
	void TattooGlowClient(); // Function Athena.AthenaPlayerCharacter.TattooGlowClient // RequiredAPI|Net|Native|Event|NetMulticast|Public|NetClient // @ game+0xd0f3a0
	void TattooGlow(); // Function Athena.AthenaPlayerCharacter.TattooGlow // Final|Native|Public|BlueprintCallable // @ game+0xd0f380
	void SprintActivate(); // Function Athena.AthenaPlayerCharacter.SprintActivate // RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd0ef50
	void ServerWantsSprint(bool WantsSprint); // Function Athena.AthenaPlayerCharacter.ServerWantsSprint // Final|RequiredAPI|Net|NetReliableNative|Event|Private|NetServer|NetValidate // @ game+0xd0d410
	void ServerSetAutoFloatInWater(bool AutoFloatInWater); // Function Athena.AthenaPlayerCharacter.ServerSetAutoFloatInWater // Final|RequiredAPI|Net|NetReliableNative|Event|Private|NetServer|NetValidate // @ game+0xd0d360
	void Server_IPGLoadStatus(struct TArray<uint32_t> InData); // Function Athena.AthenaPlayerCharacter.Server_IPGLoadStatus // Net|Native|Event|Public|NetServer|NetValidate // @ game+0xd0d4c0
	void SendPirateDesc(struct FPirateDescription PirateDesc); // Function Athena.AthenaPlayerCharacter.SendPirateDesc // Final|RequiredAPI|Net|NetReliableNative|Event|NetMulticast|Private // @ game+0xd0d250
	void OnWieldedItem(); // Function Athena.AthenaPlayerCharacter.OnWieldedItem // RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd0c9b0
	void OnRep_StopMovementAndPreventSwimming(); // Function Athena.AthenaPlayerCharacter.OnRep_StopMovementAndPreventSwimming // Final|Native|Public // @ game+0xd0c8d0
	void OnRep_ReplicatedIsSprinting(); // Function Athena.AthenaPlayerCharacter.OnRep_ReplicatedIsSprinting // Final|Native|Private // @ game+0xd0c5f0
	void OnRep_OverridePirateDescSeed(); // Function Athena.AthenaPlayerCharacter.OnRep_OverridePirateDescSeed // Final|Native|Public // @ game+0xd0c3f0
	void OnRep_OverrideAnimationEntry(); // Function Athena.AthenaPlayerCharacter.OnRep_OverrideAnimationEntry // Final|Native|Private // @ game+0xd0c3d0
	void OnRep_AutoFloatInWater(); // Function Athena.AthenaPlayerCharacter.OnRep_AutoFloatInWater // Final|Native|Private // @ game+0xd0bf70
	void OnMeshSet(); // Function Athena.AthenaPlayerCharacter.OnMeshSet // Event|Public|BlueprintEvent // @ game+0x1848130
	void OnImpactDamageEventReceived(struct FImpactDamageEvent InImpactEvent); // Function Athena.AthenaPlayerCharacter.OnImpactDamageEventReceived // Final|Native|Protected|HasOutParms // @ game+0xd0bdf0
	void Multicast_OnKrakenTentacleDeath(int32_t RemainingTentacles); // Function Athena.AthenaPlayerCharacter.Multicast_OnKrakenTentacleDeath // RequiredAPI|Net|Native|Event|NetMulticast|Public // @ game+0xd0b8b0
	bool IsSprintEnabled(); // Function Athena.AthenaPlayerCharacter.IsSprintEnabled // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0af20
	bool IsInteractionValid(struct UObject* InInteractable); // Function Athena.AthenaPlayerCharacter.IsInteractionValid // RequiredAPI|Native|Public|BlueprintCallable // @ game+0xd0adc0
	bool HasMeshSet(); // Function Athena.AthenaPlayerCharacter.HasMeshSet // RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0a740
	bool HasFinishedSpawning(); // Function Athena.AthenaPlayerCharacter.HasFinishedSpawning // RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0a700
	struct UVoyageParticipantComponent* GetTaleVoyageParticipantComponent(); // Function Athena.AthenaPlayerCharacter.GetTaleVoyageParticipantComponent // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09db0
	struct UVoyageParticipantComponent* GetPrimaryVoyageParticipantComponent(); // Function Athena.AthenaPlayerCharacter.GetPrimaryVoyageParticipantComponent // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09ca0
	struct UPetLoadoutComponent* GetPetLoadoutComponent(); // Function Athena.AthenaPlayerCharacter.GetPetLoadoutComponent // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09a50
	struct FVector GetPawnViewLocation(); // Function Athena.AthenaPlayerCharacter.GetPawnViewLocation // RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xd09a10
	struct FName GetLocalPlayerWorldRegionName(); // Function Athena.AthenaPlayerCharacter.GetLocalPlayerWorldRegionName // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd095e0
	bool GetIsSprinting(); // Function Athena.AthenaPlayerCharacter.GetIsSprinting // RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd081a0
	bool GetIsDigitallyWalking(); // Function Athena.AthenaPlayerCharacter.GetIsDigitallyWalking // RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd080d0
	struct UObject* GetFocusedInteractable(); // Function Athena.AthenaPlayerCharacter.GetFocusedInteractable // RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd079b0
	struct FVector GetFirstPersonMeshOffset(); // Function Athena.AthenaPlayerCharacter.GetFirstPersonMeshOffset // Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xd078f0
	struct UVoyageParticipantComponent* GetEmergentVoyageParticipantComponent(); // Function Athena.AthenaPlayerCharacter.GetEmergentVoyageParticipantComponent // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd07820
	char GetCurrentShipRegion(); // Function Athena.AthenaPlayerCharacter.GetCurrentShipRegion // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd07740
	struct UClothingLoadoutComponent* GetClothingLoadoutComponent(); // Function Athena.AthenaPlayerCharacter.GetClothingLoadoutComponent // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd07430
	char GetCharacterGender(); // Function Athena.AthenaPlayerCharacter.GetCharacterGender // Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd07090
	void ClientAddPlayerAsFriend(struct AAthenaPlayerCharacter* PlayerToAddAsFriend); // Function Athena.AthenaPlayerCharacter.ClientAddPlayerAsFriend // RequiredAPI|Net|NetReliableNative|Event|Public|NetClient|Const // @ game+0xd05f50
	bool BPIsWearingSkeletonCurse(); // Function Athena.AthenaPlayerCharacter.BPIsWearingSkeletonCurse // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd05b40
	bool BPIsWearingGhostCurse(); // Function Athena.AthenaPlayerCharacter.BPIsWearingGhostCurse // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd05b10
	bool AllAnimationsLoaded(); // Function Athena.AthenaPlayerCharacter.AllAnimationsLoaded // RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd056c0
};

// Class Athena.AIShipPlayerTracker
// Size: 0x130 (Inherited: 0x48)
struct UAIShipPlayerTracker : UAISpawnerPlayerTracker {
	char UnknownData_48[0xe8]; // 0x48(0xe8)
};

// Class Athena.AIShipRegionPlayerTracker
// Size: 0x78 (Inherited: 0x48)
struct UAIShipRegionPlayerTracker : UAISpawnerPlayerTracker {
	char UnknownData_48[0x30]; // 0x48(0x30)
};

// Class Athena.AIShipWheelAIInteractableType
// Size: 0x28 (Inherited: 0x28)
struct UAIShipWheelAIInteractableType : UAIInteractableType {
};

// Class Athena.AISignalTargetWaveSpawner
// Size: 0x590 (Inherited: 0x570)
struct UAISignalTargetWaveSpawner : UAIWaveSpawner {
	struct TArray<struct FStringAssetReference> SignalMechanismAssetRefs; // 0x570(0x10)
	char UnknownData_580[0x10]; // 0x580(0x10)
};

// Class Athena.AISpawnContextTaleQuestService
// Size: 0x90 (Inherited: 0x60)
struct UAISpawnContextTaleQuestService : UTaleQuestService {
	struct UAISpawnContextTaleQuestServiceDesc* Desc; // 0x60(0x08)
	char UnknownData_68[0x28]; // 0x68(0x28)
};

// Class Athena.AISpawnContextTaleQuestServiceDesc
// Size: 0x68 (Inherited: 0x28)
struct UAISpawnContextTaleQuestServiceDesc : UTaleQuestServiceDesc {
	struct FName AISpawnContextName; // 0x28(0x08)
	bool SpecificToIsland; // 0x30(0x01)
	char UnknownData_31[0x7]; // 0x31(0x07)
	struct FQuestVariableAsset ActorLocatedOnIsland; // 0x38(0x30)
};

// Class Athena.AIWieldableUseInputComponent
// Size: 0x2b8 (Inherited: 0x298)
struct UAIWieldableUseInputComponent : UAthenaCharacterBaseInputComponent {
	char UnknownData_298[0x20]; // 0x298(0x20)
};

// Class Athena.AlcoholStatus
// Size: 0x30 (Inherited: 0x30)
struct UAlcoholStatus : UStatusBase {
};

// Class Athena.AllianceBlueprintLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAllianceBlueprintLibrary : UBlueprintFunctionLibrary {

	bool IsCrewInAlliance(struct UObject* WorldContext, struct FGuid CrewId); // Function Athena.AllianceBlueprintLibrary.IsCrewInAlliance // Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xd0abd0
	bool AreCrewsInSameAlliance(struct UObject* WorldContext, struct FGuid CrewId1, struct FGuid CrewId2); // Function Athena.AllianceBlueprintLibrary.AreCrewsInSameAlliance // Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xd05950
};

// Class Athena.AllianceService
// Size: 0x4a8 (Inherited: 0x3c8)
struct AAllianceService : AActor {
	char UnknownData_3C8[0x8]; // 0x3c8(0x08)
	struct UAllianceSettingsAsset* Settings; // 0x3d0(0x08)
	struct TArray<struct FAlliance> Alliances; // 0x3d8(0x10)
	struct UAllianceServiceTelemetryComponent* TelemetryComponent; // 0x3e8(0x08)
	struct TArray<struct FCrewAllianceJoinStatus> CrewAllianceJoinStatuses; // 0x3f0(0x10)
	char UnknownData_400[0x28]; // 0x400(0x28)
	struct FMulticastDelegate OnCrewJoinedAlliance; // 0x428(0x10)
	char UnknownData_438[0x70]; // 0x438(0x70)

	void OnRep_CrewAllianceJoinStatuses(); // Function Athena.AllianceService.OnRep_CrewAllianceJoinStatuses // Final|Native|Public // @ game+0xd0c010
};

// Class Athena.AllianceServiceTelemetryComponent
// Size: 0x108 (Inherited: 0xc8)
struct UAllianceServiceTelemetryComponent : UActorComponent {
	char UnknownData_C8[0x40]; // 0xc8(0x40)
};

// Class Athena.AllianceSettingsAsset
// Size: 0x50 (Inherited: 0x28)
struct UAllianceSettingsAsset : UDataAsset {
	float MaximumAllianceDistance; // 0x28(0x04)
	float PollDelay; // 0x2c(0x04)
	struct UClass* OfferFlag; // 0x30(0x08)
	struct UClass* AcceptFlag; // 0x38(0x08)
	struct UClass* LeaveFlag; // 0x40(0x08)
	struct UAlliancePennantAsset* AlliancePennantAsset; // 0x48(0x08)
};

// Class Athena.AlwaysRelevantLightweightActor
// Size: 0x3d0 (Inherited: 0x3c8)
struct AAlwaysRelevantLightweightActor : AActor {
	struct AActor* OwningActor; // 0x3c8(0x08)

	void OnRep_OwningActor(); // Function Athena.AlwaysRelevantLightweightActor.OnRep_OwningActor // Final|Native|Private // @ game+0xd0c410
	void OnOwningActorDestroyed(); // Function Athena.AlwaysRelevantLightweightActor.OnOwningActorDestroyed // Native|Protected // @ game+0xd0bef0
};

// Class Athena.NameplateComponent
// Size: 0x310 (Inherited: 0x2e0)
struct UNameplateComponent : USceneComponent {
	float FadeTime; // 0x2e0(0x04)
	char UnknownData_2E4[0x4]; // 0x2e4(0x04)
	struct USkeletalMeshSocket* NameplateSocket; // 0x2e8(0x08)
	char UnknownData_2F0[0x20]; // 0x2f0(0x20)

	struct FVector GetWorldPosition(); // Function Athena.NameplateComponent.GetWorldPosition // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x3b75120
};

// Class Athena.PlayerNameplateComponent
// Size: 0x3b0 (Inherited: 0x310)
struct UPlayerNameplateComponent : UNameplateComponent {
	char UnknownData_310[0x8]; // 0x310(0x08)
	float VisibleFromWorldDistance; // 0x318(0x04)
	float VisibleUntilWorldDistanceCrew; // 0x31c(0x04)
	float VisibleUntilWorldDistanceNonCrew; // 0x320(0x04)
	float EmoteForcedRevealTime; // 0x324(0x04)
	char UnknownData_328[0x8]; // 0x328(0x08)
	struct AAthenaPlayerCharacter* PlayerCharacter; // 0x330(0x08)
	char UnknownData_338[0x78]; // 0x338(0x78)
};

// Class Athena.AlwaysRelevantPlayerNameplateComponent
// Size: 0x3d0 (Inherited: 0x3b0)
struct UAlwaysRelevantPlayerNameplateComponent : UPlayerNameplateComponent {
	struct AAthenaPlayerState* PlayerStatePtr; // 0x3a8(0x08)
	char UnknownData_3B8[0x18]; // 0x3b8(0x18)
};

// Class Athena.AlwaysRelevantLightweightPlayerNameplate
// Size: 0x440 (Inherited: 0x3d0)
struct AAlwaysRelevantLightweightPlayerNameplate : AAlwaysRelevantLightweightActor {
	char UnknownData_3D0[0x20]; // 0x3d0(0x20)
	struct UAlwaysRelevantPlayerNameplateComponent* PlayerNameplateComponent; // 0x3f0(0x08)
	struct FGuid OwnedActorsCrewId; // 0x3f8(0x10)
	char UnknownData_408[0x28]; // 0x408(0x28)
	struct AAthenaPlayerState* PlayerStatePtr; // 0x430(0x08)
	bool IsOwnerInert; // 0x438(0x01)
	char UnknownData_439[0x7]; // 0x439(0x07)

	void OnRep_PlayerStatePtr(); // Function Athena.AlwaysRelevantLightweightPlayerNameplate.OnRep_PlayerStatePtr // Final|Native|Private // @ game+0xd0c450
	void OnRep_IsOwnerInert(); // Function Athena.AlwaysRelevantLightweightPlayerNameplate.OnRep_IsOwnerInert // Final|RequiredAPI|Native|Private // @ game+0xd0c310
	void OnOwningActorDestroyed(); // Function Athena.AlwaysRelevantLightweightPlayerNameplate.OnOwningActorDestroyed // Native|Protected // @ game+0xd0bf10
};

// Class Athena.Anchor
// Size: 0x400 (Inherited: 0x3c8)
struct AAnchor : AActor {
	char UnknownData_3C8[0x8]; // 0x3c8(0x08)
	struct FVector PositionForAnchorDynamicsRelativeToAnchorActor; // 0x3d0(0x0c)
	char UnknownData_3DC[0x4]; // 0x3dc(0x04)
	struct UBaseAnchorDynamicsDesc* AnchorDynamicsDesc; // 0x3e0(0x08)
	char UnknownData_3E8[0x18]; // 0x3e8(0x18)

	void SetAnchorLoweredProportion(float InLoweredProportion); // Function Athena.Anchor.SetAnchorLoweredProportion // Final|Native|Public|BlueprintCallable // @ game+0xd0d8f0
};

// Class Athena.AncientAIFormComponent
// Size: 0x170 (Inherited: 0x148)
struct UAncientAIFormComponent : UAthenaAIFormComponent {
	char UnknownData_148[0x28]; // 0x148(0x28)
};

// Class Athena.AncientAIFormDataAsset
// Size: 0xa0 (Inherited: 0x90)
struct UAncientAIFormDataAsset : UAthenaAIFormDataAsset {
	struct UClass* AwardableComponentType; // 0x90(0x08)
	float TimeBeforeDespawn; // 0x98(0x04)
	char UnknownData_9C[0x4]; // 0x9c(0x04)
};

// Class Athena.NPCHeldObjectData
// Size: 0x98 (Inherited: 0x28)
struct UNPCHeldObjectData : UDataAsset {
	struct FName LeftHandWieldSocket; // 0x28(0x08)
	struct FName RightHandWieldSocket; // 0x30(0x08)
	struct FName DetachSocketA; // 0x38(0x08)
	struct FName DetachSocketB; // 0x40(0x08)
	struct UClass* Object1; // 0x48(0x08)
	struct UClass* Object2; // 0x50(0x08)
	struct UClass* Object3; // 0x58(0x08)
	struct UClass* Object4; // 0x60(0x08)
	struct UClass* Object5; // 0x68(0x08)
	struct UClass* Object6; // 0x70(0x08)
	struct UClass* Object7; // 0x78(0x08)
	struct UClass* Object8; // 0x80(0x08)
	struct UClass* Object9; // 0x88(0x08)
	struct UClass* Object10; // 0x90(0x08)
};

// Class Athena.AnimatedCosmeticItemInterface
// Size: 0x28 (Inherited: 0x28)
struct UAnimatedCosmeticItemInterface : UInterface {
};

// Class Athena.AnimatedCosmeticItemAnimationInstance
// Size: 0x4b0 (Inherited: 0x440)
struct UAnimatedCosmeticItemAnimationInstance : UAnimInstance {
	char UnknownData_440[0x8]; // 0x440(0x08)
	struct TArray<struct FNPCOneShotAnimationElement> OneShotSequences; // 0x448(0x10)
	struct TArray<struct FNPCContinuousAnimationElement> ContinuousSequences; // 0x458(0x10)
	struct UAnimInstance* ParentCharacterAnimationInstance; // 0x468(0x08)
	struct UAnimMontage* CurrentPlayingMontage; // 0x470(0x08)
	struct UAnimSequenceBase* OneShot; // 0x478(0x08)
	struct UAnimSequenceBase* ContinuousIn; // 0x480(0x08)
	struct UAnimSequenceBase* ContinuousLoopA; // 0x488(0x08)
	struct UAnimSequenceBase* ContinuousLoopB; // 0x490(0x08)
	struct UAnimSequenceBase* ContinuousOut; // 0x498(0x08)
	char UnknownData_4A0[0x10]; // 0x4a0(0x10)
};

// Class Athena.AnimatedStepsComponent
// Size: 0xf0 (Inherited: 0xc8)
struct UAnimatedStepsComponent : UActorComponent {
	struct UPoseableSkeletalMeshComponent* Mesh; // 0xc8(0x08)
	struct TArray<struct UBoxComponent*> Boxes; // 0xd0(0x10)
	struct TArray<struct FVector> BoxOrigins; // 0xe0(0x10)

	void StartOpening(); // Function Athena.AnimatedStepsComponent.StartOpening // Event|Public|BlueprintEvent // @ game+0x1848130
	void OpenImmediate(); // Function Athena.AnimatedStepsComponent.OpenImmediate // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void Close(); // Function Athena.AnimatedStepsComponent.Close // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

// Class Athena.AnimationDataOverriderComponent
// Size: 0x100 (Inherited: 0xc8)
struct UAnimationDataOverriderComponent : UActorComponent {
	char UnknownData_C8[0x8]; // 0xc8(0x08)
	struct FStringAssetReference AnimationDataStoreAssetReference; // 0xd0(0x10)
	struct UAnimationDataStoreAsset* AnimationDataStoreAsset; // 0xe0(0x08)
	char UnknownData_E8[0x18]; // 0xe8(0x18)

	void OnRep_AnimationDataStoreAssetReference(); // Function Athena.AnimationDataOverriderComponent.OnRep_AnimationDataStoreAssetReference // Final|Native|Private // @ game+0xd0bf50
};

// Class Athena.AnimNotify_AthenaPlayParticleEffect
// Size: 0x88 (Inherited: 0x38)
struct UAnimNotify_AthenaPlayParticleEffect : UAnimNotify {
	struct UObject* PSTemplate; // 0x38(0x08)
	struct FName SocketName; // 0x40(0x08)
	struct FVector LocationOffset; // 0x48(0x0c)
	struct FRotator RotationOffset; // 0x54(0x0c)
	struct FVector RelativeScale; // 0x60(0x0c)
	struct FLinearColor ColorTint; // 0x6c(0x10)
	float CustomParameter; // 0x7c(0x04)
	char Attached : 1; // 0x80(0x01)
	char KeepWorldScale : 1; // 0x80(0x01)
	char OwnerOnlySee : 1; // 0x80(0x01)
	char OwnerNoSee : 1; // 0x80(0x01)
	char OwnedByWorld : 1; // 0x80(0x01)
	char UnknownData_80_5 : 3; // 0x80(0x01)
	char UnknownData_81[0x3]; // 0x81(0x03)
	char UnderwaterMode; // 0x84(0x01)
	char CustomLocalSpaceMode; // 0x85(0x01)
	char UnknownData_86[0x2]; // 0x86(0x02)
};

// Class Athena.AnimNotify_AthenaPlayParticleEffectWithOwnerCustomisation
// Size: 0x90 (Inherited: 0x88)
struct UAnimNotify_AthenaPlayParticleEffectWithOwnerCustomisation : UAnimNotify_AthenaPlayParticleEffect {
	struct UClass* VfxCustomisationType; // 0x88(0x08)
};

// Class Athena.AnimNotify_CutSceneSubtitle
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_CutSceneSubtitle : UAnimNotify {
	char UnknownData_38[0x8]; // 0x38(0x08)
};

// Class Athena.AnimNotify_DockableCutscene
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_DockableCutscene : UAnimNotify {
};

// Class Athena.AnimNotify_RumbleController
// Size: 0x50 (Inherited: 0x38)
struct UAnimNotify_RumbleController : UAnimNotify {
	struct UForceFeedbackEffect* ForceFeedbackEffect; // 0x38(0x08)
	struct FName ForceFeedbackTag; // 0x40(0x08)
	struct UForceFeedbackCondition* ForceFeedbackCondition; // 0x48(0x08)
};

// Class Athena.AnimNotifyAdditionalEventsWwiseEmitterComponent
// Size: 0x320 (Inherited: 0x310)
struct UAnimNotifyAdditionalEventsWwiseEmitterComponent : UAnimNotifyWwiseEmitterComponent {
	struct TArray<struct FAnimNotifyWwiseObserver> AnimNotifyObservers; // 0x310(0x10)
};

// Class Athena.AnimNotifyQuestBookForcePageRedraw
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotifyQuestBookForcePageRedraw : UAnimNotify {
};

// Class Athena.AnimNotifyState_AthenaTimedParticleEffect
// Size: 0x88 (Inherited: 0x60)
struct UAnimNotifyState_AthenaTimedParticleEffect : UAnimNotifyState_TimedParticleEffect {
	struct FVector RelativeScale; // 0x60(0x0c)
	struct FLinearColor ColorTint; // 0x6c(0x10)
	float CustomParameter; // 0x7c(0x04)
	char Attached : 1; // 0x80(0x01)
	char KeepWorldScale : 1; // 0x80(0x01)
	char UnknownData_80_2 : 6; // 0x80(0x01)
	char UnknownData_81[0x3]; // 0x81(0x03)
	char UnderwaterMode; // 0x84(0x01)
	char CustomLocalSpaceMode; // 0x85(0x01)
	char UnknownData_86[0x2]; // 0x86(0x02)
};

// Class Athena.AnimNotifyStateQuestBookRenderingModeRequest
// Size: 0x80 (Inherited: 0x30)
struct UAnimNotifyStateQuestBookRenderingModeRequest : UAnimNotifyState {
	char UnknownData_30[0x50]; // 0x30(0x50)
};

// Class Athena.AnimNotifyStateQuestBookLeftSpreadCurrentRightSpreadNext
// Size: 0x80 (Inherited: 0x80)
struct UAnimNotifyStateQuestBookLeftSpreadCurrentRightSpreadNext : UAnimNotifyStateQuestBookRenderingModeRequest {
};

// Class Athena.AnimNotifyStateQuestBookLeftSpreadPreviousRightSpreadCurrent
// Size: 0x80 (Inherited: 0x80)
struct UAnimNotifyStateQuestBookLeftSpreadPreviousRightSpreadCurrent : UAnimNotifyStateQuestBookRenderingModeRequest {
};

// Class Athena.AnimNotifyTriggerPlaceableReaction
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotifyTriggerPlaceableReaction : UAnimNotify {
	struct FStringAssetReference PlaceableReactionToTrigger; // 0x38(0x10)
};

// Class Athena.ApplicationSettings
// Size: 0x30 (Inherited: 0x28)
struct UApplicationSettings : UObject {
	int32_t GameLanguage; // 0x28(0x04)
	char UnknownData_2C[0x4]; // 0x2c(0x04)
};

// Class Athena.ArenaVendorShip
// Size: 0x3f0 (Inherited: 0x3c8)
struct AArenaVendorShip : AActor {
	struct USceneComponent* ArenaVendorShipRootComponent; // 0x3c8(0x08)
	struct UContestMerchantSpawnerComponent* ContestMerchantSpawnerComponent; // 0x3d0(0x08)
	struct UGenericWorldMapMarker* VendorShipWorldMarkerComponent; // 0x3d8(0x08)
	struct USphereComponent* VendorDeadZoneComponent; // 0x3e0(0x08)
	float VendorShipDeadZoneRadius; // 0x3e8(0x04)
	char UnknownData_3EC[0x4]; // 0x3ec(0x04)
};

// Class Athena.ViewModelComponentBase
// Size: 0x128 (Inherited: 0xc8)
struct UViewModelComponentBase : UActorComponent {
	char UnknownData_C8[0x60]; // 0xc8(0x60)
};

// Class Athena.PossessionsChestViewModel
// Size: 0x170 (Inherited: 0x128)
struct UPossessionsChestViewModel : UViewModelComponentBase {
	struct FText AllTabLabel; // 0x128(0x38)
	struct FStringAssetReference AllTabIcon; // 0x160(0x10)
};

// Class Athena.ArmoryChestViewModelComponent
// Size: 0x198 (Inherited: 0x170)
struct UArmoryChestViewModelComponent : UPossessionsChestViewModel {
	char UnknownData_170[0x10]; // 0x170(0x10)
	struct TArray<struct UClass*> Categories; // 0x180(0x10)
	bool IncludeAllCategory; // 0x190(0x01)
	char UnknownData_191[0x7]; // 0x191(0x07)
};

// Class Athena.AshCloudAIAbilityType
// Size: 0x28 (Inherited: 0x28)
struct UAshCloudAIAbilityType : UAthenaAIAbilityType {
};

// Class Athena.AshCloudAbilityStageParams
// Size: 0x40 (Inherited: 0x40)
struct UAshCloudAbilityStageParams : UAthenaAIAbilityStageParams {
};

// Class Athena.AshCloudAIAbility
// Size: 0x90 (Inherited: 0x78)
struct UAshCloudAIAbility : UAthenaAIAbility {
	struct APawn* Owner; // 0x78(0x08)
	struct UAshCloudAIAbilityParams* SetupAbilityParams; // 0x80(0x08)
	struct AAshenLordAshCloud* AshCloudInstance; // 0x88(0x08)
};

// Class Athena.AshCloudAIAbilityParams
// Size: 0xd0 (Inherited: 0xc8)
struct UAshCloudAIAbilityParams : UAthenaAIAbilityParams {
	struct UClass* AshCloudClass; // 0xc8(0x08)
};

// Class Athena.AshenLordAIFormComponent
// Size: 0x1b0 (Inherited: 0x148)
struct UAshenLordAIFormComponent : UAthenaAIFormComponent {
	struct UWwiseEvent* AshenLordVulnerabilityDamageAudioEvent; // 0x148(0x08)
	struct FName AshenLordHeartBeatShaderParamName; // 0x150(0x08)
	struct UMaterial* AshenLordBaseMaterial; // 0x158(0x20)
	struct UClass* CameraShake; // 0x178(0x08)
	float ShakeInnerRadius; // 0x180(0x04)
	float ShakeOuterRadius; // 0x184(0x04)
	struct UMaterialInstanceDynamic* AshenLordDynamicMaterialInstance; // 0x188(0x08)
	float CachedNormalisedHealthScalar; // 0x190(0x04)
	bool IsInVulnerability; // 0x194(0x01)
	char UnknownData_195[0x1b]; // 0x195(0x1b)

	void OnRep_CachedNormalisedHealthScalar(); // Function Athena.AshenLordAIFormComponent.OnRep_CachedNormalisedHealthScalar // Final|Native|Private // @ game+0xd0bf90
};

// Class Athena.AssetListDataAsset
// Size: 0x38 (Inherited: 0x28)
struct UAssetListDataAsset : UDataAsset {
	struct TArray<struct FStringAssetReference> AssetList; // 0x28(0x10)
};

// Class Athena.AssignItemStep
// Size: 0xa0 (Inherited: 0x98)
struct UAssignItemStep : UTaleQuestStep {
	struct UAssignItemStepDesc* StepDesc; // 0x98(0x08)
};

// Class Athena.AssignItemStepDesc
// Size: 0xb8 (Inherited: 0x80)
struct UAssignItemStepDesc : UTaleQuestStepDesc {
	struct FQuestVariableClass TypeVar; // 0x80(0x30)
	struct UClass* TypeValue; // 0xb0(0x08)
};

// Class Athena.AssociateActorToCrewTaskStep
// Size: 0xd0 (Inherited: 0x98)
struct UAssociateActorToCrewTaskStep : UTaleQuestStep {
	struct UAssociateActorToCrewTaskStepDesc* Desc; // 0x98(0x08)
	TScriptInterface<struct UTaleQuestStepInterface> TaskStep; // 0xa0(0x10)
	char UnknownData_B0[0x20]; // 0xb0(0x20)
};

// Class Athena.AssociateActorToCrewTaskStepDesc
// Size: 0xb8 (Inherited: 0x80)
struct UAssociateActorToCrewTaskStepDesc : UTaleQuestStepDesc {
	struct UTaleQuestStepDesc* TaskDesc; // 0x80(0x08)
	struct FQuestVariableActor ActorToAssociate; // 0x88(0x30)
};

// Class Athena.LoadoutRepairerInterface
// Size: 0x28 (Inherited: 0x28)
struct ULoadoutRepairerInterface : UInterface {
};

// Class Athena.AsyncLoadoutRepairComponent
// Size: 0x120 (Inherited: 0xc8)
struct UAsyncLoadoutRepairComponent : UActorComponent {
	char UnknownData_C8[0x58]; // 0xc8(0x58)
};

// Class Athena.AthenaAIInteractableComponent
// Size: 0x230 (Inherited: 0x100)
struct UAthenaAIInteractableComponent : UAIInteractableComponent {
	char UnknownData_100[0x8]; // 0x100(0x08)
	bool Moveable; // 0x108(0x01)
	char UnknownData_109[0x3]; // 0x109(0x03)
	struct FVector InteractableRelativeVectorToSpawnPos; // 0x10c(0x0c)
	struct FVector TriggerSphereCentreOffset; // 0x118(0x0c)
	float TriggerSphereRadiusOffset; // 0x124(0x04)
	float TimeToCacheLastBestTargetResult; // 0x128(0x04)
	char OwnerAITeam; // 0x12c(0x01)
	char UnknownData_12D[0x103]; // 0x12d(0x103)

	void SetOwnerAITeam(char InOwner); // Function Athena.AthenaAIInteractableComponent.SetOwnerAITeam // Final|Native|Public|BlueprintCallable // @ game+0xd0e5b0
	float GetTriggerRegionRadius(); // Function Athena.AthenaAIInteractableComponent.GetTriggerRegionRadius // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0a010
	struct FVector GetTriggerRegionCenterPoint(); // Function Athena.AthenaAIInteractableComponent.GetTriggerRegionCenterPoint // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xd09fc0
	char GetOwnerAITeam(); // Function Athena.AthenaAIInteractableComponent.GetOwnerAITeam // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd099d0
};

// Class Athena.AthenaAITeamsServiceInterface
// Size: 0x28 (Inherited: 0x28)
struct UAthenaAITeamsServiceInterface : UInterface {

	void SetAITeamAttitude(struct FGenericTeamId A, struct FGenericTeamId B, char Attitude); // Function Athena.AthenaAITeamsServiceInterface.SetAITeamAttitude // Native|Public|BlueprintCallable // @ game+0xd0d7f0
	void ResetAITeamAttitudes(); // Function Athena.AthenaAITeamsServiceInterface.ResetAITeamAttitudes // Native|Public|BlueprintCallable // @ game+0xd0cf70
};

// Class Athena.AthenaAITeamsService
// Size: 0x5e0 (Inherited: 0x28)
struct UAthenaAITeamsService : UObject {
	char UnknownData_28[0x5b8]; // 0x28(0x5b8)
};

// Class Athena.AthenaAnimationCustomSkeletonAnimationData
// Size: 0x60 (Inherited: 0x28)
struct UAthenaAnimationCustomSkeletonAnimationData : UDataAsset {
	struct FSkeletonCustomAnimationDataStructure SkeletonCustomAnimData; // 0x28(0x38)
};

// Class Athena.CharacterAnimationInterface
// Size: 0x28 (Inherited: 0x28)
struct UCharacterAnimationInterface : UInterface {

	void UnbindFromCharacter(struct AAthenaCharacter* Character); // Function Athena.CharacterAnimationInterface.UnbindFromCharacter // Native|Event|Public|BlueprintEvent // @ game+0xd0f730
	void OnImpact(struct FVector ImpactLocation, struct FVector ImpactNormal, struct FVector ImpactVelocity, char HitReactionAnimType); // Function Athena.CharacterAnimationInterface.OnImpact // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0xd0bc60
	void LoadCharacterAnimations(struct UClass* AnimDataId); // Function Athena.CharacterAnimationInterface.LoadCharacterAnimations // Native|Event|Public|BlueprintCallable|BlueprintEvent // @ game+0xd0b580
	void BindThirdPersonToCharacter(struct AAthenaCharacter* Character, struct UClass* AnimDataId); // Function Athena.CharacterAnimationInterface.BindThirdPersonToCharacter // Native|Event|Public|BlueprintEvent // @ game+0xd05c30
	void BindFirstPersonToCharacter(struct AAthenaCharacter* Character, struct UClass* AnimDataId); // Function Athena.CharacterAnimationInterface.BindFirstPersonToCharacter // Native|Event|Public|BlueprintEvent // @ game+0xd05b70
};

// Class Athena.AthenaAnimationLocomotionComponentFunctions
// Size: 0x28 (Inherited: 0x28)
struct UAthenaAnimationLocomotionComponentFunctions : UBlueprintFunctionLibrary {

	void MarkRunStopComplete(struct FAthenaAnimationLocomotion Locomotion); // Function Athena.AthenaAnimationLocomotionComponentFunctions.MarkRunStopComplete // Final|Native|Static|Public|HasOutParms|BlueprintCallable // @ game+0xd0b710
	float GetWantedMovementSpeed(struct FAthenaAnimationLocomotion Locomotion); // Function Athena.AthenaAnimationLocomotionComponentFunctions.GetWantedMovementSpeed // Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure // @ game+0xd0a3c0
	struct FVector GetVelocity(struct FAthenaAnimationLocomotion Locomotion); // Function Athena.AthenaAnimationLocomotionComponentFunctions.GetVelocity // Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0xd0a2e0
	bool GetTurningLeft(struct FAthenaAnimationLocomotion Locomotion); // Function Athena.AthenaAnimationLocomotionComponentFunctions.GetTurningLeft // Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure // @ game+0xd0a0f0
	bool GetTurningActive(struct FAthenaAnimationLocomotion Locomotion); // Function Athena.AthenaAnimationLocomotionComponentFunctions.GetTurningActive // Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure // @ game+0xd0a050
	bool GetRunStopWanted(struct FAthenaAnimationLocomotion Locomotion); // Function Athena.AthenaAnimationLocomotionComponentFunctions.GetRunStopWanted // Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure // @ game+0xd09d10
	bool GetIsUnderwaterSwimming(struct FAthenaAnimationLocomotion Locomotion); // Function Athena.AthenaAnimationLocomotionComponentFunctions.GetIsUnderwaterSwimming // Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure // @ game+0xd082b0
	bool GetIsSwimming(struct FAthenaAnimationLocomotion Locomotion); // Function Athena.AthenaAnimationLocomotionComponentFunctions.GetIsSwimming // Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure // @ game+0xd081e0
	bool GetIsInAITurn(struct FAthenaAnimationLocomotion Locomotion); // Function Athena.AthenaAnimationLocomotionComponentFunctions.GetIsInAITurn // Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure // @ game+0xd08100
	float GetCurrentYaw(struct FAthenaAnimationLocomotion Locomotion); // Function Athena.AthenaAnimationLocomotionComponentFunctions.GetCurrentYaw // Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure // @ game+0xd07780
	float GetCurrentDirection(struct FAthenaAnimationLocomotion Locomotion); // Function Athena.AthenaAnimationLocomotionComponentFunctions.GetCurrentDirection // Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure // @ game+0xd075d0
	bool GetCharacterMoving(struct FAthenaAnimationLocomotion Locomotion); // Function Athena.AthenaAnimationLocomotionComponentFunctions.GetCharacterMoving // Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure // @ game+0xd070c0
	float GetBlendedTurnRate(struct FAthenaAnimationLocomotion Locomotion); // Function Athena.AthenaAnimationLocomotionComponentFunctions.GetBlendedTurnRate // Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure // @ game+0xd06ff0
};

// Class Athena.AthenaAnimationInstance
// Size: 0x31e0 (Inherited: 0x660)
struct UAthenaAnimationInstance : UCharacterAnimationInstance {
	char UnknownData_660[0x38]; // 0x660(0x38)
	char ControllableObjectType; // 0x698(0x01)
	char UnknownData_699[0x7]; // 0x699(0x07)
	struct TArray<struct FAthenaAnimationLoadObjectsWrapper> AllLoadedItemData; // 0x6a0(0x10)
	struct FAthenaAnimationHandHeldItemParams HandHeldItemParams; // 0x6b0(0x20)
	struct FAthenaAnimationIdleVariantChange IdleVariantParams; // 0x6d0(0x10)
	struct FAthenaAnimationWheel WheelAnimationParams; // 0x6e0(0x1f0)
	struct FAthenaAnimationCapstan CapstanAnimationParams; // 0x8d0(0x178)
	struct FAthenaAnimationFacialAnimData FacialParams; // 0xa48(0x90)
	struct FAthenaAnimationFire Fire; // 0xad8(0x20)
	char MeleeSpecialState; // 0xaf8(0x01)
	char UnknownData_AF9[0x3]; // 0xaf9(0x03)
	float DodgeDirection; // 0xafc(0x04)
	struct FAthenaAnimationRowboatParams RowboatParams; // 0xb00(0xc8)
	struct FAthenaAnimationRowing Rowing; // 0xbc8(0xe0)
	struct FAthenaAnimationWaterPumpAnimData WaterPumpAnimations; // 0xca8(0x28)
	struct FAthenaAnimationWaterPumpParams WaterPumpAnimationParams; // 0xcd0(0x0c)
	struct FAthenaAnimationFishingParams FishingParams; // 0xcdc(0x34)
	struct FAthenaAnimationFishing Fishing; // 0xd10(0x3f0)
	struct FAthenaAnimationWaterSlideControlAnimData WaterSlideControlAnimData; // 0x1100(0x20)
	struct FAthenaAnimationZiplineControlAnimData ZiplineControlAnimData; // 0x1120(0x60)
	struct AAthenaCharacter* AthenaCharacter; // 0x1180(0x08)
	struct FAthenaAnimationJumping JumpingAnimationParams; // 0x1188(0xf0)
	float SpineBlendAlpha; // 0x1278(0x04)
	float DockingTransitionAlpha; // 0x127c(0x04)
	struct FAthenaAnimationWaterPump AthenaAnimationWaterPump; // 0x1280(0x30)
	struct FAthenaAnimationLODSettings AnimationLODSettings; // 0x12b0(0x03)
	char UnknownData_12B3[0x5]; // 0x12b3(0x05)
	struct FAthenaAnimationLocomotion Locomotion; // 0x12b8(0x68)
	struct FAthenaAnimationWieldedItemStateMachine WieldedItemStateMachine; // 0x1320(0x5f0)
	struct FAthenaAnimationLoadObjectByID ItemLoading; // 0x1910(0x930)
	struct UClass* CurrentWieldedItemALK; // 0x2240(0x08)
	struct FAthenaAnimationObjectActionContinuousStruct ItemPrimaryContinousUseAnims; // 0x2248(0xa8)
	struct FAthenaAnimationObjectActionContinuousStruct ItemSecondaryContinousUseAnims; // 0x22f0(0xa8)
	struct FAthenaAnimationObjectActionContinuousStruct ItemPrimaryContinousUseAlternateAnims; // 0x2398(0xa8)
	struct FAthenaAnimationObjectActionContinuousStruct ItemSecondaryContinousUseAlternateAnims; // 0x2440(0xa8)
	struct FAthenaAnimationObjectActionContinuousSwimming ItemPrimaryContinousUseSwimmingAnims; // 0x24e8(0x20)
	struct FAthenaAnimationObjectActionContinuousSwimming ItemSecondaryContinousUseSwimmingAnims; // 0x2508(0x20)
	struct FAthenaAnimationObjectActionContinuousSwimming ItemPrimaryContinousUseSwimmingAlternateAnims; // 0x2528(0x20)
	struct FAthenaAnimationObjectActionContinuousSwimming ItemSecondaryContinousUseSwimmingAlternateAnims; // 0x2548(0x20)
	struct FAthenaAnimationObjectJumpingAnimations ItemPrimaryContinousUseJumpingAnims; // 0x2568(0x20)
	struct FAthenaAnimationObjectJumpingAnimations ItemSecondaryContinousUseJumpingAnims; // 0x2588(0x20)
	struct FAthenaAnimationObjectJumpingAnimations ItemPrimaryContinousUseJumpingAlternateAnims; // 0x25a8(0x20)
	struct FAthenaAnimationObjectJumpingAnimations ItemSecondaryContinousUseJumpingAlternateAnims; // 0x25c8(0x20)
	struct FAthenaAnimationActiveOneShotAnimationStruct ActiveOneShotAnimations; // 0x25e8(0x20)
	struct FAthenaAnimationActiveOneShotAnimationStruct DuplicateActiveOneShotAnimations; // 0x2608(0x20)
	struct FAthenaAnimationObjectActionOneShotPlayingStruct ItemPrimaryOneShotAnims; // 0x2628(0x28)
	struct FAthenaAnimationObjectActionOneShotPlayingStruct ItemSecondaryOneShotAnims; // 0x2650(0x28)
	struct FAthenaAnimationObjectActionOneShotPlayingStruct ItemPrimaryOneShotAlternateAnims; // 0x2678(0x28)
	struct FAthenaAnimationObjectActionOneShotPlayingStruct ItemSecondaryOneShotAlternateAnims; // 0x26a0(0x28)
	struct FAthenaAnimationActiveItemComplexAnimData CurrentComplexOneShotData; // 0x26c8(0x38)
	struct FAthenaAnimationObjectComplexOneShotPlaySpeeds CurrentMeleeAttackSequencePlaySpeeds; // 0x2700(0x14)
	char UnknownData_2714[0x4]; // 0x2714(0x04)
	struct FAthenaAnimationObjectMeleeBlocking ItemCombatBlockingAnims; // 0x2718(0x60)
	struct UClass* FishingRodAnimStoreID; // 0x2778(0x08)
	struct UClass* QuestBookAnimStoreID; // 0x2780(0x08)
	struct UClass* WoodenPlankAnimStoreID; // 0x2788(0x08)
	float UnequipPlayRate; // 0x2790(0x04)
	char UnknownData_2794[0x4]; // 0x2794(0x04)
	struct FAthenaAnimationLoadOnDemandItemsAnimgraphStructure LoadOnDemandItemParams; // 0x2798(0x760)
	char ControllableSocketGroup; // 0x2ef8(0x01)
	char ControllableSocketGroupCharacterSize; // 0x2ef9(0x01)
	char LocomotionState; // 0x2efa(0x01)
	struct FAthenaAnimationDebugTrackingParams DebugTrackingParams; // 0x2efb(0x04)
	char UnknownData_2EFF[0x1]; // 0x2eff(0x01)
	struct FAthenaAnimationDeath Death; // 0x2f00(0x100)
	struct FAthenaAnimationUndoRepair UndoRepair; // 0x3000(0x70)
	struct FAthenaAnimationSitting Sitting; // 0x3070(0x70)
	char PropWieldLocation; // 0x30e0(0x01)
	char UnknownData_30E1[0x3]; // 0x30e1(0x03)
	struct FVector PropOffsetLocation; // 0x30e4(0x0c)
	struct FRotator PropOffsetRotation; // 0x30f0(0x0c)
	struct FVector PropOffsetScale; // 0x30fc(0x0c)
	char FaunaAddedToCrate : 1; // 0x3108(0x01)
	char InDockingTransition : 1; // 0x3108(0x01)
	char WieldedItemIsMeleeWeapon : 1; // 0x3108(0x01)
	char InMeleeCombat : 1; // 0x3108(0x01)
	char IsBlockingLeft : 1; // 0x3108(0x01)
	char IsFishingWithWieldedRod : 1; // 0x3108(0x01)
	char UsePropOffset : 1; // 0x3108(0x01)
	char IsOnLadder : 1; // 0x3108(0x01)
	char IsUsingAdditiveHandOverlayPose : 1; // 0x3109(0x01)
	char IgnoreIdleBlendTransition : 1; // 0x3109(0x01)
	char UseDuplicateOneShotState : 1; // 0x3109(0x01)
	char UnknownData_3109_3 : 5; // 0x3109(0x01)
	char UnknownData_310A[0xd6]; // 0x310a(0xd6)

	void UpdateLoadedAnimations(); // Function Athena.AthenaAnimationInstance.UpdateLoadedAnimations // Native|Public|BlueprintCallable // @ game+0xd0ffb0
	void UpdateItemComplexOneShotStructurePlaySpeeds(); // Function Athena.AthenaAnimationInstance.UpdateItemComplexOneShotStructurePlaySpeeds // Final|Native|Public|BlueprintCallable // @ game+0xd0ff90
	void UnloadDynamicallyAllocatedItemAnimations(struct UClass* UnequippedItemID); // Function Athena.AthenaAnimationInstance.UnloadDynamicallyAllocatedItemAnimations // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0xd0f800
	void SetWieldedItemContinuousIsAlternate(bool IsAlternate); // Function Athena.AthenaAnimationInstance.SetWieldedItemContinuousIsAlternate // Final|Native|Public|BlueprintCallable // @ game+0xd0e980
	void SetUsePrimaryOneShotAnimationsFlag(bool InUsePrimary); // Function Athena.AthenaAnimationInstance.SetUsePrimaryOneShotAnimationsFlag // Final|Native|Public // @ game+0xd0e8f0
	void SetUsePrimaryContinuousAnimationsFlag(bool InUsePrimary); // Function Athena.AthenaAnimationInstance.SetUsePrimaryContinuousAnimationsFlag // Final|Native|Public // @ game+0xd0e860
	void SetLoadedItemAllAnimations(struct FAthenaAnimationCoreObjectAnimations AllAnimationSet); // Function Athena.AthenaAnimationInstance.SetLoadedItemAllAnimations // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0xd0e080
	void SetControllableSocketGroupCharacterSize(char InGroup); // Function Athena.AthenaAnimationInstance.SetControllableSocketGroupCharacterSize // Final|Native|Public|BlueprintCallable // @ game+0xd0dab0
	void SetControllableSocketGroup(char InGroup); // Function Athena.AthenaAnimationInstance.SetControllableSocketGroup // Final|Native|Public|BlueprintCallable // @ game+0xd0da30
	struct UBlendSpace1D* PickItemOneShotSequencePitchOverride(); // Function Athena.AthenaAnimationInstance.PickItemOneShotSequencePitchOverride // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0xd0ca10
	struct UAnimSequence* PickItemOneShotSequence(); // Function Athena.AthenaAnimationInstance.PickItemOneShotSequence // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0xd0c9e0
	bool NotRunningOnServer(); // Function Athena.AthenaAnimationInstance.NotRunningOnServer // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0bab0
	struct TArray<struct FAthenaAnimationLoadObjectsWrapper> LoadAllItemAnimations(struct AAthenaCharacter* Owner, struct UScriptStruct* DestinationStruct, struct UClass* CharacterType); // Function Athena.AthenaAnimationInstance.LoadAllItemAnimations // Final|Native|Public|BlueprintCallable // @ game+0xd0b3c0
	void LeftItemBlockingFeedbackState(); // Function Athena.AthenaAnimationInstance.LeftItemBlockingFeedbackState // Final|Native|Public|BlueprintCallable // @ game+0xd0b3a0
	bool IsWieldedItemAPet(); // Function Athena.AthenaAnimationInstance.IsWieldedItemAPet // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0xd0b020
	bool InMeleeBlock(); // Function Athena.AthenaAnimationInstance.InMeleeBlock // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0a840
	bool InMeleeAttack(); // Function Athena.AthenaAnimationInstance.InMeleeAttack // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0a810
	void InitialiseCharacterAnimations(struct AActor* Owner, struct UClass* CharacterType); // Function Athena.AthenaAnimationInstance.InitialiseCharacterAnimations // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0xd0a870
	bool GetWantsToReenterItemBlockingFeedback(); // Function Athena.AthenaAnimationInstance.GetWantsToReenterItemBlockingFeedback // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0a460
	char GetMeleeStrikeType(); // Function Athena.AthenaAnimationInstance.GetMeleeStrikeType // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09890
	struct FAthenaAnimationLocomotion GetLocomotion(); // Function Athena.AthenaAnimationInstance.GetLocomotion // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09620
	struct FWieldAnimationParams GetLoadedItemWieldedParams(); // Function Athena.AthenaAnimationInstance.GetLoadedItemWieldedParams // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09410
	bool GetLoadedItemSecondaryPitchOverride(); // Function Athena.AthenaAnimationInstance.GetLoadedItemSecondaryPitchOverride // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd093e0
	struct FAthenaAnimationObjectActionContinuousStruct GetLoadedItemSecondaryContinuousAnimationsMain(bool UseAlternate); // Function Athena.AthenaAnimationInstance.GetLoadedItemSecondaryContinuousAnimationsMain // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd092d0
	struct FTransform GetLoadedItemRightHandOffset(); // Function Athena.AthenaAnimationInstance.GetLoadedItemRightHandOffset // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xd09270
	bool GetLoadedItemPrimaryPitchOverride(); // Function Athena.AthenaAnimationInstance.GetLoadedItemPrimaryPitchOverride // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09240
	struct FAthenaAnimationObjectActionContinuousStruct GetLoadedItemPrimaryContinuousAnimationsMain(bool UseAlternate); // Function Athena.AthenaAnimationInstance.GetLoadedItemPrimaryContinuousAnimationsMain // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09130
	struct FAthenaAnimationObjectLocomotionAnimations GetLoadedItemLocomotionAnimations(); // Function Athena.AthenaAnimationInstance.GetLoadedItemLocomotionAnimations // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08ff0
	struct FTransform GetLoadedItemLeftHandOffset(); // Function Athena.AthenaAnimationInstance.GetLoadedItemLeftHandOffset // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xd08f90
	struct FAthenaAnimationObjectJumpingAnimations GetLoadedItemJumpingAnimations(); // Function Athena.AthenaAnimationInstance.GetLoadedItemJumpingAnimations // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08f50
	bool GetLoadedItemIsRangedWeapon(); // Function Athena.AthenaAnimationInstance.GetLoadedItemIsRangedWeapon // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08f20
	struct FAthenaAnimationObjectIdleAnimations GetLoadedItemIdleAnimations(); // Function Athena.AthenaAnimationInstance.GetLoadedItemIdleAnimations // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08ee0
	struct UAnimSequence* GetLoadedItemHandAdditiveOverlayAnimation(); // Function Athena.AthenaAnimationInstance.GetLoadedItemHandAdditiveOverlayAnimation // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08eb0
	struct FAthenaAnimationObjectFacial GetLoadedItemFacialAnimations(); // Function Athena.AthenaAnimationInstance.GetLoadedItemFacialAnimations // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08e50
	struct FAthenaAnimationObjectEquipAnimations GetLoadedItemEquippingAnimations(); // Function Athena.AthenaAnimationInstance.GetLoadedItemEquippingAnimations // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08e00
	struct FAthenaAnimationObjectLocomotionAnimations GetLoadedItemAlternateLocomotionAnimations(); // Function Athena.AthenaAnimationInstance.GetLoadedItemAlternateLocomotionAnimations // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08db0
	struct FAthenaAnimationObjectIdleAnimations GetLoadedItemAlternateIdleAnimations(); // Function Athena.AthenaAnimationInstance.GetLoadedItemAlternateIdleAnimations // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08d70
	struct FAthenaAnimationCoreObjectAnimations GetLoadedItemAllAnimations(); // Function Athena.AthenaAnimationInstance.GetLoadedItemAllAnimations // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08cf0
	char GetJumpingAnimationState(); // Function Athena.AthenaAnimationInstance.GetJumpingAnimationState // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08cc0
	bool GetItemUsePitchOverride(); // Function Athena.AthenaAnimationInstance.GetItemUsePitchOverride // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08c90
	struct FAthenaAnimationObjectActionOneShotPlayingStruct GetItemOneShotStructure(bool IsPrimary, bool IsAlternate); // Function Athena.AthenaAnimationInstance.GetItemOneShotStructure // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08a90
	struct UBlendSpace* GetItemMeleeDodgeBlendspace(); // Function Athena.AthenaAnimationInstance.GetItemMeleeDodgeBlendspace // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08a60
	struct FAthenaAnimationObjectMeleeBlocking GetItemMeleeBlockingAnimations(); // Function Athena.AthenaAnimationInstance.GetItemMeleeBlockingAnimations // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd089f0
	struct FAthenaAnimationObjectActionContinuousStruct GetItemContinuousStructure(bool IsPrimary, bool IsAlternate); // Function Athena.AthenaAnimationInstance.GetItemContinuousStructure // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08770
	struct FAthenaAnimationObjectComplexOneShot GetItemComplexOneShotStructure(char ComplexOneShotLookUpType, bool IsSwimming, bool IsMoving, int32_t OneShotIndex); // Function Athena.AthenaAnimationInstance.GetItemComplexOneShotStructure // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd085d0
	struct UAnimSequence* GetItemComplexOneShotSequence(char ComplexOneShotSubState, int32_t OneShotIndex); // Function Athena.AthenaAnimationInstance.GetItemComplexOneShotSequence // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08510
	float GetItemComplexOneShotPlaySpeed(struct UAnimSequence* AnimSequence, char ComplexOneShotSubState); // Function Athena.AthenaAnimationInstance.GetItemComplexOneShotPlaySpeed // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08440
	char GetItemBlockingSubState(); // Function Athena.AthenaAnimationInstance.GetItemBlockingSubState // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08410
	struct UAnimSequence* GetItemBlockingMainOutOfAnimation(); // Function Athena.AthenaAnimationInstance.GetItemBlockingMainOutOfAnimation // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd083e0
	struct UAnimSequence* GetItemBlockingMainIntoAnimation(); // Function Athena.AthenaAnimationInstance.GetItemBlockingMainIntoAnimation // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd083b0
	struct UBlendSpace* GetItemBlockingMainBlendspace(); // Function Athena.AthenaAnimationInstance.GetItemBlockingMainBlendspace // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08380
	struct UAnimSequence* GetItemBlockingFeedbackSequence(); // Function Athena.AthenaAnimationInstance.GetItemBlockingFeedbackSequence // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08350
	bool GetInDockingTransition(); // Function Athena.AthenaAnimationInstance.GetInDockingTransition // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd07af0
	struct AActor* GetCurrentEquippedItem(); // Function Athena.AthenaAnimationInstance.GetCurrentEquippedItem // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0xd07670
	char GetControllableSocketGroupCharacterSize(); // Function Athena.AthenaAnimationInstance.GetControllableSocketGroupCharacterSize // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd07590
	char GetControllableSocketGroup(); // Function Athena.AthenaAnimationInstance.GetControllableSocketGroup // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd07550
	float GetAnimationLength(struct UAnimSequence* Animation); // Function Athena.AthenaAnimationInstance.GetAnimationLength // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0xd06f50
	void EnteredItemBlockingFeedbackState(); // Function Athena.AthenaAnimationInstance.EnteredItemBlockingFeedbackState // Final|Native|Public|BlueprintCallable // @ game+0xd06480
	void AdjustIdleTransition(); // Function Athena.AthenaAnimationInstance.AdjustIdleTransition // Final|Native|Public|BlueprintCallable // @ game+0xd05670
};

// Class Athena.FirstPersonAnimationInstance
// Size: 0x32b0 (Inherited: 0x31e0)
struct UFirstPersonAnimationInstance : UAthenaAnimationInstance {
	char UnknownData_31E0[0x8]; // 0x31e0(0x08)
	float SpineRotationTime; // 0x31e8(0x04)
	struct FVector RangedWeaponTargetingOffset; // 0x31ec(0x0c)
	float RangedWeaponAlpha; // 0x31f8(0x04)
	struct FAthenaAnimationCamera CameraParams; // 0x31fc(0x18)
	char UnknownData_3214[0x4]; // 0x3214(0x04)
	struct FAthenaAnimationFirstPersonAnimatic FirstPersonAnimatic; // 0x3218(0x80)
	char CameraAdditiveBlendPoseType; // 0x3298(0x01)
	char UnknownData_3299[0x3]; // 0x3299(0x03)
	float RowboatCameraAlpha; // 0x329c(0x04)
	char UseAdditiveHandOverlay : 1; // 0x32a0(0x01)
	char CameraAttachmentTypeNotDefault : 1; // 0x32a0(0x01)
	char BlendUpperBodyAndArmOverlay : 1; // 0x32a0(0x01)
	char UseArmOverlayJumpContinuous : 1; // 0x32a0(0x01)
	char IsSwimming : 1; // 0x32a0(0x01)
	char IsControllableObjectActive : 1; // 0x32a0(0x01)
	char UseSwimmingEquip : 1; // 0x32a0(0x01)
	char UnknownData_32A1[0x3]; // 0x32a1(0x03)
	float EquipAnimationPlayRate; // 0x32a4(0x04)
	char ActivateIK : 1; // 0x32a8(0x01)
	char UseOneShotIntoAnimInContinuousUse : 1; // 0x32a8(0x01)
	char UnknownData_32A8_2 : 6; // 0x32a8(0x01)
	char UnknownData_32A9[0x7]; // 0x32a9(0x07)

	void UpdateLoadedAnimations(); // Function Athena.FirstPersonAnimationInstance.UpdateLoadedAnimations // Native|Public|BlueprintCallable // @ game+0xd0ffd0
	void SetFirstPersonAnimToPlay(struct UAnimSequence* AnimSequenceToPlay); // Function Athena.FirstPersonAnimationInstance.SetFirstPersonAnimToPlay // Final|Native|Public|BlueprintCallable // @ game+0xd0ddd0
	void LoadSpecificItemAnimations(struct UClass* ItemId); // Function Athena.FirstPersonAnimationInstance.LoadSpecificItemAnimations // Final|Native|Public|BlueprintCallable // @ game+0xd0b610
	void FirstPersonAnimaticFinished(); // Function Athena.FirstPersonAnimationInstance.FirstPersonAnimaticFinished // Final|Native|Public|BlueprintCallable // @ game+0xd065b0
};

// Class Athena.ThirdPersonAnimationInstance
// Size: 0x4670 (Inherited: 0x31e0)
struct UThirdPersonAnimationInstance : UAthenaAnimationInstance {
	float ItemAnimPausedTimeRemaining; // 0x31e0(0x04)
	char IsItemAnimPaused : 1; // 0x31e4(0x01)
	char UseContinualLoopInOneShotState : 1; // 0x31e4(0x01)
	char UnknownData_31E4_2 : 6; // 0x31e4(0x01)
	char UnknownData_31E5[0x3]; // 0x31e5(0x03)
	struct FAthenaAnimationIKLimbStretch IKLimbStretchParams; // 0x31e8(0x0c)
	char UnknownData_31F4[0x4]; // 0x31f4(0x04)
	struct FAthenaAnimationLadder LadderAnimationParams; // 0x31f8(0x330)
	struct FAthenaAnimationTalking Talking; // 0x3528(0x38)
	struct FAthenaAnimationPitchControlStates PitchTargetingControlStates; // 0x3560(0x168)
	struct FAthenaAnimationObjectTargetingOptions PitchTargetingParameters; // 0x36c8(0x3c)
	struct FAthenaAnimationObjectTargetingOptions WantedPitchTargetingParameters; // 0x3704(0x3c)
	struct FAthenaAnimationPitchAlpha PitchTargetingAlpha; // 0x3740(0x14)
	struct FAthenaAnimationPitchShoulders PitchShoulderParams; // 0x3754(0x1c)
	struct FAthenaAnimationMountedWeapon MountedWeaponAnimationParams; // 0x3770(0x128)
	struct FAthenaAnimationFootPlanting FootPlanting; // 0x3898(0x48)
	char StairAnimationState; // 0x38e0(0x01)
	char UnknownData_38E1[0x7]; // 0x38e1(0x07)
	struct FAthenaAnimationPulleyControl PulleyControl; // 0x38e8(0x40)
	struct FAthenaAnimationPulleyControlAnimData PulleyControlAnimData; // 0x3928(0x48)
	struct FAthenaAnimationKeyedInstrumentAnimData KeyedInstrumentAnimData; // 0x3970(0x18)
	struct FAthenaAnimationAI AIAnimationParams; // 0x3988(0x358)
	struct FAthenaAnimationLocomotionAlternateAnimData LocomotionDrunk; // 0x3ce0(0x50)
	struct FAthenaAnimationLocomotionAlternateAnimData LocomotionLimp; // 0x3d30(0x50)
	struct FAthenaAnimationLocomotionAlternateAnimData LocomotionPegLeg; // 0x3d80(0x50)
	struct FAthenaAnimationLocomotionAlternateAnimData LocomotionHotCoals; // 0x3dd0(0x50)
	struct TArray<struct FAthenaAnimationSpawnBase> AISpawnStruct; // 0x3e20(0x10)
	struct TArray<struct FAthenaAnimationSkeletonFlee> AIFleeLoadingStruct; // 0x3e30(0x10)
	struct FAthenaAnimationSkeletonFleeInGraph AIFleePlayingStruct; // 0x3e40(0x38)
	struct FAthenaAnimationSkeletonScream SkeletonScream; // 0x3e78(0x08)
	struct UBlendSpace1D* PitchAnimationToPlay; // 0x3e80(0x08)
	struct FAthenaAnimationShopInteractionParams ShopInteractionParams; // 0x3e88(0x30)
	struct FAthenaAnimationEmoteAnimgraphStructure EmoteParams; // 0x3eb8(0x148)
	struct FAthenaAnimationSkeletonCurseAnimations SkeletonCurseAnims; // 0x4000(0x28)
	struct FAthenaAnimationHarpoonLauncherAnimData HarpoonLauncherAnims; // 0x4028(0x28)
	struct FAthenaAnimationAIKnockback AIKnockbackStruct; // 0x4050(0x30)
	struct FAthenaAnimationHitReactsAnimData HitReactionsAnimationData; // 0x4080(0x40)
	struct FAthenaAnimationHitReactsSelectedAnimations HitReactionsSelectedAnimationData; // 0x40c0(0x48)
	struct FAthenaAnimationHitReactParams HitReactionsAnimationParams; // 0x4108(0x2c)
	char UnknownData_4134[0x4]; // 0x4134(0x04)
	struct FAthenaAnimationSinkingTunnel Sinking; // 0x4138(0x68)
	float HitReactAdditiveBlendAmount; // 0x41a0(0x04)
	float WieldedItemPoseBlendTime; // 0x41a4(0x04)
	float UpperBodyPoseBlendTime; // 0x41a8(0x04)
	float AimingAndPitchOverride; // 0x41ac(0x04)
	float FacialOverlayBlendWeight; // 0x41b0(0x04)
	struct FRotator PitchShoulderRotation; // 0x41b4(0x0c)
	struct FRotator PitchClavicleRotation; // 0x41c0(0x0c)
	float RightArmPitchAlpha; // 0x41cc(0x04)
	float LeftArmPitchAlpha; // 0x41d0(0x04)
	float SpineRotation; // 0x41d4(0x04)
	struct FAthenaAnimationStunData StunData; // 0x41d8(0x08)
	struct UBlendSpace1D* HitReactItem; // 0x41e0(0x08)
	float WorldDelta; // 0x41e8(0x04)
	float CapstanAngularVelocityWanted; // 0x41ec(0x04)
	struct FAthenaAnimationPlayingFacialAnimations PlayingFacialAnimations; // 0x41f0(0x40)
	struct FAthenaAnimationPlayingEquipAnimations PlayingEquipAnimations; // 0x4230(0x18)
	float CharacterPitch; // 0x4248(0x04)
	float TargetingPitch; // 0x424c(0x04)
	struct FAthenaAnimationObjectLocomotionAnimations ItemAlternateLocomotionAnims; // 0x4250(0x40)
	struct FAthenaAnimationObjectIdleAnimations ItemAlternateIdleAnims; // 0x4290(0x18)
	struct FAthenaAnimationObjectActionContinuousStructPitchOverride ItemPrimaryContinousUseAnimsPitchOverride; // 0x42a8(0x78)
	struct FAthenaAnimationObjectActionContinuousStructPitchOverride ItemSecondaryContinousUseAnimsPitchOverride; // 0x4320(0x78)
	struct FAthenaAnimationObjectActionContinuousStructPitchOverride ItemPrimaryContinousUseAlternateAnimsPitchOverride; // 0x4398(0x78)
	struct FAthenaAnimationObjectActionContinuousStructPitchOverride ItemSecondaryContinousUseAlternateAnimsPitchOverride; // 0x4410(0x78)
	struct FAthenaAnimationObjectActionContinuousSwimming ItemPrimaryContinousUseSwimmingAnimsPitchOverride; // 0x4488(0x20)
	struct FAthenaAnimationObjectActionContinuousSwimming ItemSecondaryContinousUseSwimmingAnimsPitchOverride; // 0x44a8(0x20)
	struct FAthenaAnimationObjectActionContinuousSwimming ItemPrimaryContinousUseSwimmingAlternateAnimsPitchOverride; // 0x44c8(0x20)
	struct FAthenaAnimationObjectActionContinuousSwimming ItemSecondaryContinousUseSwimmingAlternateAnimsPitchOverride; // 0x44e8(0x20)
	struct FAthenaAnimationObjectJumpingAnimationsPitchOverride ItemPrimaryContinousUseJumpingAnimsPitchOverride; // 0x4508(0x20)
	struct FAthenaAnimationObjectJumpingAnimationsPitchOverride ItemSecondaryContinousUseJumpingAnimsPitchOverride; // 0x4528(0x20)
	struct FAthenaAnimationObjectJumpingAnimationsPitchOverride ItemPrimaryContinousUseJumpingAlternateAnimsPitchOverride; // 0x4548(0x20)
	struct FAthenaAnimationObjectJumpingAnimationsPitchOverride ItemSecondaryContinousUseJumpingAlternateAnimsPitchOverride; // 0x4568(0x20)
	struct FAthenaAnimationObjectActionOneShotPlayingStructPitchOverride ItemPrimaryOneShotAnimsPitchOverride; // 0x4588(0x28)
	struct FAthenaAnimationObjectActionOneShotPlayingStructPitchOverride ItemSecondaryOneShotAnimsPitchOverride; // 0x45b0(0x28)
	struct FAthenaAnimationObjectActionOneShotPlayingStructPitchOverride ItemPrimaryOneShotAlternateAnimsPitchOverride; // 0x45d8(0x28)
	struct FAthenaAnimationObjectActionOneShotPlayingStructPitchOverride ItemSecondaryOneShotAlternateAnimsPitchOverride; // 0x4600(0x28)
	char ZeroLocomotionForced : 1; // 0x4628(0x01)
	char ConcealedInLoadable : 1; // 0x4628(0x01)
	char AIUseAlternateLocomotion : 1; // 0x4628(0x01)
	char EmoteIKIsOff : 1; // 0x4628(0x01)
	char InBlockingInto : 1; // 0x4628(0x01)
	char IsAI : 1; // 0x4628(0x01)
	char IsLocallyControlled : 1; // 0x4628(0x01)
	char IsHit : 1; // 0x4628(0x01)
	char InRecover : 1; // 0x4629(0x01)
	char InWarmUp : 1; // 0x4629(0x01)
	char PlayingFullBodyAnimation : 1; // 0x4629(0x01)
	char PlayingUpperBodyAnimation : 1; // 0x4629(0x01)
	char PlayingRightArmOverlayAnimation : 1; // 0x4629(0x01)
	char PlayingSpineOverlayAnimation : 1; // 0x4629(0x01)
	char PlayingLeftArmOverlayAnimation : 1; // 0x4629(0x01)
	char IsUsingFullBodyOverlayPose : 1; // 0x4629(0x01)
	char IsUsingLocalIKPose : 1; // 0x462a(0x01)
	char IsRightShoulderActive : 1; // 0x462a(0x01)
	char IsLeftShoulderActive : 1; // 0x462a(0x01)
	char ControllableObjectTypeHasValidTarget : 1; // 0x462a(0x01)
	char UseHandsAndFootplantingIK : 1; // 0x462a(0x01)
	char IKLODActive : 1; // 0x462a(0x01)
	char LODSolverActive : 1; // 0x462a(0x01)
	char ObjectPitchTargetingActive : 1; // 0x462a(0x01)
	char ObjectOrIKEmoteActive : 1; // 0x462b(0x01)
	char ObjectOrWheelCapstanAndNotDocking : 1; // 0x462b(0x01)
	char HitReact1Active : 1; // 0x462b(0x01)
	char HitReact2Active : 1; // 0x462b(0x01)
	char AthenaCharacterIsValid : 1; // 0x462b(0x01)
	char UsePrimaryActionPitchOverride : 1; // 0x462b(0x01)
	char UseSecondaryActionPitchOverride : 1; // 0x462b(0x01)
	char UnknownData_462C[0x44]; // 0x462c(0x44)

	void UpdateSkeletonFleeingAnimations(struct UClass* ObjectId); // Function Athena.ThirdPersonAnimationInstance.UpdateSkeletonFleeingAnimations // Final|Native|Public|BlueprintCallable // @ game+0xd100a0
	void UpdatePitchOverrideAnimation(bool IsPrimary); // Function Athena.ThirdPersonAnimationInstance.UpdatePitchOverrideAnimation // Final|Native|Public|BlueprintCallable // @ game+0xd10010
	void UpdateLoadedAnimations(); // Function Athena.ThirdPersonAnimationInstance.UpdateLoadedAnimations // Native|Public|BlueprintCallable // @ game+0xd0fff0
	float UpdateAISpawnAnimation(struct AAthenaCharacter* Owner, struct UClass* ObjectId, char SpawnType, bool QuickSpawn, int32_t SpawnIndex); // Function Athena.ThirdPersonAnimationInstance.UpdateAISpawnAnimation // Native|Public|BlueprintCallable // @ game+0xd0f930
	void TriggerSensingAnimation(char NewSensingState); // Function Athena.ThirdPersonAnimationInstance.TriggerSensingAnimation // Final|Native|Public|BlueprintCallable // @ game+0xd0f6b0
	void TriggerEmoteActionAnimation(char EmoteActionState); // Function Athena.ThirdPersonAnimationInstance.TriggerEmoteActionAnimation // Final|Native|Public|BlueprintCallable // @ game+0xd0f630
	void StopMeleeStanceChange(); // Function Athena.ThirdPersonAnimationInstance.StopMeleeStanceChange // Final|Native|Public|BlueprintCallable // @ game+0xd0f360
	void StartMeleeStanceChange(); // Function Athena.ThirdPersonAnimationInstance.StartMeleeStanceChange // Final|Native|Public|BlueprintCallable // @ game+0xd0f180
	void SetLocomotionTypeActive(char LocomotionType, bool Active); // Function Athena.ThirdPersonAnimationInstance.SetLocomotionTypeActive // Final|Native|Public|BlueprintCallable // @ game+0xd0e270
	void SetFullBodyOverlayPoseDisabled(bool IsDisabled); // Function Athena.ThirdPersonAnimationInstance.SetFullBodyOverlayPoseDisabled // Final|Native|Public|BlueprintCallable // @ game+0xd0de60
	void SetEmoteStateActive(bool IsActive); // Function Athena.ThirdPersonAnimationInstance.SetEmoteStateActive // Final|Native|Public|BlueprintCallable // @ game+0xd0dbc0
	bool SelectSkeletonFleeingVariationAnimation(); // Function Athena.ThirdPersonAnimationInstance.SelectSkeletonFleeingVariationAnimation // Final|Native|Public|BlueprintCallable // @ game+0xd0d220
	void RemoveActiveEmote(); // Function Athena.ThirdPersonAnimationInstance.RemoveActiveEmote // Final|Native|Public|BlueprintCallable // @ game+0xd0ce80
	void OnEventAllocateShopInteractionAnimations(struct AAthenaCharacter* Owner, bool Active, char Type); // Function Athena.ThirdPersonAnimationInstance.OnEventAllocateShopInteractionAnimations // Final|Native|Public|BlueprintCallable // @ game+0xd0bb60
	void LoadSpecificItemAnimations(struct UClass* ItemId); // Function Athena.ThirdPersonAnimationInstance.LoadSpecificItemAnimations // Final|Native|Public|BlueprintCallable // @ game+0xd0b690
	float GetTargetingPitch(); // Function Athena.ThirdPersonAnimationInstance.GetTargetingPitch // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0xd09de0
	struct UBlendSpace* GetLoadedItemMeleeAnimations_LungeWarmupLocomotion(); // Function Athena.ThirdPersonAnimationInstance.GetLoadedItemMeleeAnimations_LungeWarmupLocomotion // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09100
	struct UAnimSequence* GetLoadedItemMeleeAnimations_CombatLocomotionTurnOut(); // Function Athena.ThirdPersonAnimationInstance.GetLoadedItemMeleeAnimations_CombatLocomotionTurnOut // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09070
	struct UAnimSequence* GetLoadedItemMeleeAnimations_CombatLocomotionTurningRight(); // Function Athena.ThirdPersonAnimationInstance.GetLoadedItemMeleeAnimations_CombatLocomotionTurningRight // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd090d0
	struct UAnimSequence* GetLoadedItemMeleeAnimations_CombatLocomotionTurningLeft(); // Function Athena.ThirdPersonAnimationInstance.GetLoadedItemMeleeAnimations_CombatLocomotionTurningLeft // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd090a0
	struct UBlendSpace* GetLoadedItemMeleeAnimations_CombatLocomotion(); // Function Athena.ThirdPersonAnimationInstance.GetLoadedItemMeleeAnimations_CombatLocomotion // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09040
	struct FAthenaAnimationObjectActionOneShotPlayingStructPitchOverride GetItemOneShotStructurePitchOverride(bool IsPrimary, bool IsAlternate); // Function Athena.ThirdPersonAnimationInstance.GetItemOneShotStructurePitchOverride // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08b90
	struct FAthenaAnimationObjectActionContinuousStructPitchOverride GetItemContinuousStructurePitchOverride(bool IsPrimary, bool IsAlternate); // Function Athena.ThirdPersonAnimationInstance.GetItemContinuousStructurePitchOverride // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd088d0
	char GetCurrentLocomotionType(); // Function Athena.ThirdPersonAnimationInstance.GetCurrentLocomotionType // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd076a0
	float GetCharacterPitch(); // Function Athena.ThirdPersonAnimationInstance.GetCharacterPitch // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0xd07160
	struct UAnimSequence* GetAIKnockbackAnimation(); // Function Athena.ThirdPersonAnimationInstance.GetAIKnockbackAnimation // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd06af0
	void AllocateNewTauntCheerVariant(bool IsPrimary, char EmoteActionState); // Function Athena.ThirdPersonAnimationInstance.AllocateNewTauntCheerVariant // Final|Native|Public|BlueprintCallable // @ game+0xd05890
	void AllocateNewShipCaptainIdleVariant(bool IsIdleStateA); // Function Athena.ThirdPersonAnimationInstance.AllocateNewShipCaptainIdleVariant // Final|Native|Public|BlueprintCallable // @ game+0xd05800
	void AllocateNewRandomContinuousEmote(bool IsSlotA); // Function Athena.ThirdPersonAnimationInstance.AllocateNewRandomContinuousEmote // Final|Native|Public|BlueprintCallable // @ game+0xd05770
};

// Class Athena.SkeletonAnimationInstance
// Size: 0x47e0 (Inherited: 0x4670)
struct USkeletonAnimationInstance : UThirdPersonAnimationInstance {
	char UnknownData_4670[0x10]; // 0x4670(0x10)
	struct FAthenaAnimationSkeletonAIFastPathData SkeletonAIFastPathData; // 0x4680(0x04)
	char UnknownData_4684[0x4]; // 0x4684(0x04)
	struct UNPCHeldObjectData* HeldObjectList; // 0x4688(0x08)
	struct AActor* LeftHandObject; // 0x4690(0x08)
	struct AActor* RightHandObject; // 0x4698(0x08)
	float ObjectOverlayBlendOutTime; // 0x46a0(0x04)
	char UnknownData_46A4[0x4]; // 0x46a4(0x04)
	struct UAthenaAnimationCustomSkeletonAnimationData* CustomAnimationData; // 0x46a8(0x08)
	struct FAthenaAnimationCustomSkeletonAnimationBlueprintData CustomAnimationBlueprintData; // 0x46b0(0x58)
	char PreviousCustomAnimationState; // 0x4708(0x01)
	char UnknownData_4709[0x7]; // 0x4709(0x07)
	struct UAnimMontage* CustomAnimationCurrentMontage; // 0x4710(0x08)
	char UnknownData_4718[0xc8]; // 0x4718(0xc8)

	void UseHeldObject(char SpawnHand, char ObjectSlot); // Function Athena.SkeletonAnimationInstance.UseHeldObject // Final|Native|Public|BlueprintCallable // @ game+0xd10290
	void StopAnimation(float BlendOutTime); // Function Athena.SkeletonAnimationInstance.StopAnimation // Final|Native|Public|BlueprintCallable // @ game+0xd0f1a0
	bool SetNewCustomAnimationLoopingSequence(bool IsLoopA, struct FName SequenceName); // Function Athena.SkeletonAnimationInstance.SetNewCustomAnimationLoopingSequence // Native|Public|BlueprintCallable // @ game+0xd0e400
	float GetCurrentMontagePosition(); // Function Athena.SkeletonAnimationInstance.GetCurrentMontagePosition // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0xd076d0
	void DetachHeldObject(char SpawnHand); // Function Athena.SkeletonAnimationInstance.DetachHeldObject // Final|Native|Public|BlueprintCallable // @ game+0xd06330
	void DestroyHeldObject(char SpawnHand); // Function Athena.SkeletonAnimationInstance.DestroyHeldObject // Final|Native|Public|BlueprintCallable // @ game+0xd062b0
	void AttachHeldObject(char SpawnHand); // Function Athena.SkeletonAnimationInstance.AttachHeldObject // Final|Native|Public|BlueprintCallable // @ game+0xd05a90
};

// Class Athena.AthenaAnimationInstanceTestFunctions
// Size: 0x28 (Inherited: 0x28)
struct UAthenaAnimationInstanceTestFunctions : UBlueprintFunctionLibrary {

	bool IsStateActiveOnAnimationInstance(struct UAthenaAnimationInstance* AnimationInstance, struct FName InStatePathName); // Function Athena.AthenaAnimationInstanceTestFunctions.IsStateActiveOnAnimationInstance // Final|Native|Static|Public|HasOutParms|BlueprintCallable // @ game+0xd0af50
	struct TArray<struct FName> GetActiveStatesOnAnimationInstance(struct UAthenaAnimationInstance* AnimationInstance); // Function Athena.AthenaAnimationInstanceTestFunctions.GetActiveStatesOnAnimationInstance // Final|Native|Static|Public|BlueprintCallable // @ game+0xd06c00
};

// Class Athena.AthenaAnimationMountedWeaponBlueprintFunctions
// Size: 0x28 (Inherited: 0x28)
struct UAthenaAnimationMountedWeaponBlueprintFunctions : UBlueprintFunctionLibrary {

	void SetFireFinished(struct FAthenaAnimationMountedWeapon MountedWeapon); // Function Athena.AthenaAnimationMountedWeaponBlueprintFunctions.SetFireFinished // Final|Native|Static|Public|HasOutParms|BlueprintCallable // @ game+0xd0dd60
};

// Class Athena.AthenaAnimationWieldedItemAnimationOverlayFunctions
// Size: 0x28 (Inherited: 0x28)
struct UAthenaAnimationWieldedItemAnimationOverlayFunctions : UBlueprintFunctionLibrary {

	void UpdateThirdPersonArmOverlayFlags(struct UAthenaAnimationInstance* Owner, struct FString SourceString, struct FAthenaAnimationLocomotion Locomotion); // Function Athena.AthenaAnimationWieldedItemAnimationOverlayFunctions.UpdateThirdPersonArmOverlayFlags // Final|Native|Static|Public|HasOutParms|BlueprintCallable // @ game+0xd10120
	void UpdateFirstPersonArmOverlayFlags(struct UAthenaAnimationInstance* Owner, struct FString SourceString, struct FAthenaAnimationLocomotion Locomotion); // Function Athena.AthenaAnimationWieldedItemAnimationOverlayFunctions.UpdateFirstPersonArmOverlayFlags // Final|Native|Static|Public|HasOutParms|BlueprintCallable // @ game+0xd0fe40
	void UpdateAnimOverlayParameters(struct UAthenaAnimationInstance* Owner, char ArmOverlayState, bool ThirdPersonAnimgraph); // Function Athena.AthenaAnimationWieldedItemAnimationOverlayFunctions.UpdateAnimOverlayParameters // Final|Native|Static|Public|BlueprintCallable // @ game+0xd0fae0
	bool StopFacialAnimationMontage(struct UAthenaAnimationInstance* Owner, struct UAnimMontage* MontageToStop, float BlendTime, char Priority); // Function Athena.AthenaAnimationWieldedItemAnimationOverlayFunctions.StopFacialAnimationMontage // Final|Native|Static|Public|BlueprintCallable // @ game+0xd0f220
	bool PlayNewFacialAnimation(struct UAthenaAnimationInstance* Owner, struct UAnimMontage* MontageToPlay, float MontagePlayRate, char Priority); // Function Athena.AthenaAnimationWieldedItemAnimationOverlayFunctions.PlayNewFacialAnimation // Final|Native|Static|Public|BlueprintCallable // @ game+0xd0cb10
	bool JumpToFacialAnimationMontageSection(struct UAthenaAnimationInstance* Owner, struct UAnimMontage* PlayingMontage, struct FName MontageSection, char Priority); // Function Athena.AthenaAnimationWieldedItemAnimationOverlayFunctions.JumpToFacialAnimationMontageSection // Final|Native|Static|Public|BlueprintCallable // @ game+0xd0b050
};

// Class Athena.AthenaAnimationWieldedItemFunctions
// Size: 0x28 (Inherited: 0x28)
struct UAthenaAnimationWieldedItemFunctions : UObject {

	struct UBlendSpace* GetIntoContinuousUseSwimmingAnimationBlendSpace(struct UAthenaAnimationInstance* AnimInstance, char Override, bool IsAlternate); // Function Athena.AthenaAnimationWieldedItemFunctions.GetIntoContinuousUseSwimmingAnimationBlendSpace // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0xd07e00
	struct UAnimSequenceBase* GetIntoContinuousUseAnimationSequence(struct UAthenaAnimationInstance* AnimInstance, char Override, bool IsAlternate); // Function Athena.AthenaAnimationWieldedItemFunctions.GetIntoContinuousUseAnimationSequence // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0xd07b30
};

// Class Athena.AthenaAssetSettings
// Size: 0x68 (Inherited: 0x28)
struct UAthenaAssetSettings : UObject {
	struct TArray<struct FAssetDelayLoadEntry> DelayLoadedAssets; // 0x28(0x10)
	struct TArray<struct FAssetDelayLoadEntry> SteamOnlyDelayLoadedAssets; // 0x38(0x10)
	struct TArray<struct FString> PhysicsAuditBlueprintExceptions; // 0x48(0x10)
	struct TArray<struct FName> PhysicsAuditExemptedCollisionProfiles; // 0x58(0x10)
};

// Class Athena.AthenaCameraComponent
// Size: 0x8d0 (Inherited: 0x850)
struct UAthenaCameraComponent : UCameraComponent {
	float OffsetBlendSpeed; // 0x850(0x04)
	float AboveWaterOffset; // 0x854(0x04)
	float UnderWaterOffset; // 0x858(0x04)
	float SubmersionDistanceBeforeSurfacing; // 0x85c(0x04)
	float SubmersionDistanceBeforeUnderwater; // 0x860(0x04)
	float SubmersionDistanceBeforeUnderwaterOnShip; // 0x864(0x04)
	struct UMaterialParameterCollection* ScreenEffectsParameters; // 0x868(0x20)
	bool IsInsideShipHull; // 0x888(0x01)
	char UnknownData_889[0x3]; // 0x889(0x03)
	float CurrentCameraOffset; // 0x88c(0x04)
	char UnknownData_890[0x40]; // 0x890(0x40)

	bool GetIsUnderwater(); // Function Athena.AthenaCameraComponent.GetIsUnderwater // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd08280
	void Activate(bool bReset); // Function Athena.AthenaCameraComponent.Activate // Final|Native|Public|BlueprintCallable // @ game+0xd05260
};

// Class Athena.CustomAnimationHandlerComponent
// Size: 0x128 (Inherited: 0xc8)
struct UCustomAnimationHandlerComponent : UActorComponent {
	char UnknownData_C8[0x10]; // 0xc8(0x10)
	struct TArray<struct FStringAssetReference> CurrentCustomAnimationDataAssetReferences; // 0xd8(0x10)
	struct FRequestedLoopAnims RequestedLoopingAnim; // 0xe8(0x10)
	struct UAthenaAnimationCustomSkeletonAnimationData* MergedCustomAnimationData; // 0xf8(0x08)
	char UnknownData_100[0x28]; // 0x100(0x28)

	void OnRep_RequestedLoopingAnim(); // Function Athena.CustomAnimationHandlerComponent.OnRep_RequestedLoopingAnim // Final|Native|Private // @ game+0xd0c850
	void OnRep_CurrentCustomAnimationDataAssetReferences(struct TArray<struct FStringAssetReference> PrevCurrentCustomAnimationDataAssetReferences); // Function Athena.CustomAnimationHandlerComponent.OnRep_CurrentCustomAnimationDataAssetReferences // Final|Native|Protected|HasOutParms // @ game+0xd0c130
	void Multicast_StopCurrentAudio(); // Function Athena.CustomAnimationHandlerComponent.Multicast_StopCurrentAudio // Net|NetReliableNative|Event|NetMulticast|Protected // @ game+0xd0ba90
	void Multicast_PlayOneShotAnim(struct FName AnimName, bool StopCurrentLoopingAnimation); // Function Athena.CustomAnimationHandlerComponent.Multicast_PlayOneShotAnim // Net|NetReliableNative|Event|NetMulticast|Protected // @ game+0xd0b9c0
	void Multicast_PlayAudio(int32_t AudioEventIdx); // Function Athena.CustomAnimationHandlerComponent.Multicast_PlayAudio // Net|NetReliableNative|Event|NetMulticast|Protected // @ game+0xd0b940
	void AddLoadedCustomAnimationDataAsset(struct UAthenaAnimationCustomSkeletonAnimationData* InCurrentCustomAnimationData); // Function Athena.CustomAnimationHandlerComponent.AddLoadedCustomAnimationDataAsset // Final|Native|Public|BlueprintCallable // @ game+0xd05480
};

// Class Athena.HitDetectionVisualisationInterface
// Size: 0x28 (Inherited: 0x28)
struct UHitDetectionVisualisationInterface : UInterface {
};

// Class Athena.AthenaAICharacter
// Size: 0x1380 (Inherited: 0xc00)
struct AAthenaAICharacter : AAthenaCharacter {
	char UnknownData_C00[0xa8]; // 0xc00(0xa8)
	struct UClass* DefaultAmmoItemDescType; // 0xca8(0x08)
	struct UClass* DefaultInteractableAmmoItemDescType; // 0xcb0(0x08)
	struct UCurveFloat* DistanceInMToCannonShotHitChanceCurve; // 0xcb8(0x08)
	bool AimNoiseEnabled; // 0xcc0(0x01)
	char UnknownData_CC1[0x3]; // 0xcc1(0x03)
	float AmplitudeChangeSpeed; // 0xcc4(0x04)
	float AmplitudeOffset; // 0xcc8(0x04)
	float Frequency; // 0xccc(0x04)
	float InteractableMissFallShortMinProportion; // 0xcd0(0x04)
	float InteractableMissFallShortMaxProportion; // 0xcd4(0x04)
	char TrackedActorType; // 0xcd8(0x01)
	char UnknownData_CD9[0x7]; // 0xcd9(0x07)
	struct UFaceTargetComponent* FaceTargetComponent; // 0xce0(0x08)
	struct UAIPartsRetrievalComponent* AIPartsRetrievalComponent; // 0xce8(0x08)
	struct UAthenaAIFormComponent* FormComponent; // 0xcf0(0x08)
	struct UAICharacterAudioComponent* AICharacterAudioComponent; // 0xcf8(0x08)
	struct UStatusEffectManagerComponent* StatusEffectManagerComponent; // 0xd00(0x08)
	struct UStatusEffectPersistenceComponent* StatusEffectPersistenceComponent; // 0xd08(0x08)
	struct UPlayerCurseComponent* PlayerCurseComponent; // 0xd10(0x08)
	struct UVulnerabilityDuringAIStrategyComponent* VulnerabilityDuringAIStrategyComponent; // 0xd18(0x08)
	struct UCapsuleComponent* ProjectileTraceHitVolume; // 0xd20(0x08)
	struct UAnimationDataOverriderComponent* AnimationDataOverriderComponent; // 0xd28(0x08)
	struct UCustomAnimationHandlerComponent* CustomAnimationHandlerComponent; // 0xd30(0x08)
	struct UAIProjectileWeaponFiringIntentionComponent* FiringIntentionComponent; // 0xd38(0x08)
	struct UObject* KilledVfxTemplate; // 0xd40(0x08)
	struct UObject* PartSpecificKilledVfxTemplate; // 0xd48(0x08)
	struct FItemLoadout AISpawnLoadout; // 0xd50(0x20)
	bool KillOnFallingIntoWater; // 0xd70(0x01)
	char UnknownData_D71[0x7]; // 0xd71(0x07)
	struct UClass* MeleeAttackStrategyId; // 0xd78(0x08)
	struct UClass* GunpowderKegAnimationStoreId; // 0xd80(0x08)
	struct FPlayerStat OnFireStat; // 0xd88(0x04)
	char UnknownData_D8C[0x4c]; // 0xd8c(0x4c)
	struct USkeletalMesh* AssignedMesh; // 0xdd8(0x08)
	struct UColorTexture* TeamColorTexture; // 0xde0(0x08)
	struct FGenericTeamId TeamID; // 0xde8(0x01)
	char UnknownData_DE9[0x7]; // 0xde9(0x07)
	struct AActor* CurrentShip; // 0xdf0(0x08)
	float MeshScale; // 0xdf8(0x04)
	bool DamageResponsesDisabled; // 0xdfc(0x01)
	bool TurnActive; // 0xdfd(0x01)
	char UnknownData_DFE[0x2]; // 0xdfe(0x02)
	struct UClass* CurrentAIStrategy; // 0xe00(0x08)
	struct UClass* CurrentAnimationState; // 0xe08(0x08)
	struct UClass* AlternateLocomotionItemType; // 0xe10(0x08)
	char UnknownData_E18[0x3b0]; // 0xe18(0x3b0)
	struct UAthenaAIAmmoDataAsset* Ammo; // 0x11c8(0x08)
	struct FAIEncounterSpecification PawnEncounterSpec; // 0x11d0(0xd0)
	char UnknownData_12A0[0xe0]; // 0x12a0(0xe0)

	void SetTargetActorToFace(struct AActor* InActor); // Function Athena.AthenaAICharacter.SetTargetActorToFace // Final|Native|Public|BlueprintCallable // @ game+0xd0e7d0
	void SetRegion(struct FName InRegion); // Function Athena.AthenaAICharacter.SetRegion // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0xd0e630
	void SetOverrideCannonShotHitChance(bool Enabled, float HitChance); // Function Athena.AthenaAICharacter.SetOverrideCannonShotHitChance // Final|Native|Public|BlueprintCallable // @ game+0xd0e4e0
	void SetLoadout(struct ULoadoutAsset* InLoadout); // Function Athena.AthenaAICharacter.SetLoadout // Final|Native|Public|BlueprintCallable // @ game+0xd0e160
	void SetAIStrategy(struct UClass* InStrategy); // Function Athena.AthenaAICharacter.SetAIStrategy // Native|Public|BlueprintCallable // @ game+0xd0d760
	void SetAIAnimationState(struct UClass* InAnimationState); // Function Athena.AthenaAICharacter.SetAIAnimationState // Native|Public|BlueprintCallable // @ game+0xd0d6d0
	void ResetMaxHealthTo(float InMaxHealth); // Function Athena.AthenaAICharacter.ResetMaxHealthTo // Native|Public|BlueprintCallable // @ game+0xd0d000
	void OnRep_MeshScale(float OldMeshScale); // Function Athena.AthenaAICharacter.OnRep_MeshScale // Final|Native|Public // @ game+0xd0c350
	void OnRep_DamageResponsesDisabled(bool OldDamageResponsesDisabled); // Function Athena.AthenaAICharacter.OnRep_DamageResponsesDisabled // Final|Native|Public // @ game+0xd0c240
	void OnRep_CurrentAnimationState(struct UClass* OldAnimationState); // Function Athena.AthenaAICharacter.OnRep_CurrentAnimationState // Final|Native|Public // @ game+0xd0c0b0
	void OnRep_CurrentAIStrategy(struct UClass* OldAIStrategy); // Function Athena.AthenaAICharacter.OnRep_CurrentAIStrategy // Final|Native|Public // @ game+0xd0c030
	struct FName GetRegion(); // Function Athena.AthenaAICharacter.GetRegion // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09cd0
	struct UClass* GetAIStrategy(); // Function Athena.AthenaAICharacter.GetAIStrategy // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd06b20
	struct FAIEncounterSpecification GetAIEncounterSpec(); // Function Athena.AthenaAICharacter.GetAIEncounterSpec // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd06a60
	struct UClass* GetAIAnimationState(); // Function Athena.AthenaAICharacter.GetAIAnimationState // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd06a20
};

// Class Athena.OceanCrawlerAICharacter
// Size: 0x1450 (Inherited: 0x1380)
struct AOceanCrawlerAICharacter : AAthenaAICharacter {
	char UnknownData_1380[0x68]; // 0x1380(0x68)
	struct UHealthGemComponent* HealthGemComponent; // 0x13e8(0x08)
	struct UBuffReceiverComponent* BuffReceiver; // 0x13f0(0x08)
	char OceanCrawlerType; // 0x13f8(0x01)
	char UnknownData_13F9[0x7]; // 0x13f9(0x07)
	struct UCustomAnimationMontageComponent* MontageComponent; // 0x1400(0x08)
	struct UAnimationServerData* OceanCrawlerAnimationServerData; // 0x1408(0x08)
	float StaticCollisionRampAngleLimit; // 0x1410(0x04)
	bool ShouldPlayersInterruptBullRush; // 0x1414(0x01)
	bool SporeBreathActive; // 0x1415(0x01)
	char UnknownData_1416[0x3a]; // 0x1416(0x3a)

	void OnRep_SporeBreathActive(); // Function Athena.OceanCrawlerAICharacter.OnRep_SporeBreathActive // Final|Native|Private // @ game+0xd0c8b0
};

// Class Athena.AthenaGhostPlayerCharacter
// Size: 0x2080 (Inherited: 0x1f20)
struct AAthenaGhostPlayerCharacter : AAthenaPlayerCharacter {
	char UnknownData_1F20[0xb0]; // 0x1f20(0xb0)
	struct AGhostShipTickManager* GhostShipTickManager; // 0x1fd0(0x08)
	char UnknownData_1FD8[0xa8]; // 0x1fd8(0xa8)

	void OnCharacterAssignedController(struct AController* PossessedByController); // Function Athena.AthenaGhostPlayerCharacter.OnCharacterAssignedController // Final|Native|Private // @ game+0xd0bae0
};

// Class Athena.AthenaGhostPlayerCharacterMock
// Size: 0x2080 (Inherited: 0x2080)
struct AAthenaGhostPlayerCharacterMock : AAthenaGhostPlayerCharacter {
};

// Class Athena.VoyageParticipantComponent
// Size: 0x3b0 (Inherited: 0xc8)
struct UVoyageParticipantComponent : UActorComponent {
	char UnknownData_C8[0xa8]; // 0xc8(0xa8)
	struct AActor* OwningPlayer; // 0x170(0x08)
	struct FVoyageParticipantViewContainer ViewContainer; // 0x178(0xd8)
	struct FVoyageParticipantViewContainer PreviousViewContainer; // 0x250(0xd8)
	char UnknownData_328[0x88]; // 0x328(0x88)

	void OnRep_View(); // Function Athena.VoyageParticipantComponent.OnRep_View // Final|Native|Private // @ game+0xd0c970
	bool IsOnTale(); // Function Athena.VoyageParticipantComponent.IsOnTale // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0ae60
};

// Class Athena.AthenaPlayerCharacterMock
// Size: 0x1f50 (Inherited: 0x1f20)
struct AAthenaPlayerCharacterMock : AAthenaPlayerCharacter {
	struct UAICreatureMovementModifierParamsDataAsset* PetMovementParamsDataAsset; // 0x1f20(0x08)
	bool AllowedToSwim; // 0x1f28(0x01)
	char UnknownData_1F29[0x27]; // 0x1f29(0x27)
};

// Class Athena.AthenaPlayerCharacterUnitTestMock
// Size: 0x20c0 (Inherited: 0x1f50)
struct AAthenaPlayerCharacterUnitTestMock : AAthenaPlayerCharacterMock {
	char UnknownData_1F50[0x150]; // 0x1f50(0x150)
	struct UClass* ExpectedActionStateId; // 0x20a0(0x08)
	char UnknownData_20A8[0x18]; // 0x20a8(0x18)
};

// Class Athena.AthenaPlayerCharacterMockWithAnimSeq
// Size: 0x1fa0 (Inherited: 0x1f50)
struct AAthenaPlayerCharacterMockWithAnimSeq : AAthenaPlayerCharacterMock {
	char UnknownData_1F50[0x50]; // 0x1f50(0x50)
};

// Class Athena.AthenaCharacterMovementUnderwater
// Size: 0x148 (Inherited: 0x28)
struct UAthenaCharacterMovementUnderwater : UDataAsset {
	bool bSphere; // 0x28(0x01)
	char UnknownData_29[0x3]; // 0x29(0x03)
	float Radius; // 0x2c(0x04)
	float HalfHeight; // 0x30(0x04)
	float PenResolveInflation; // 0x34(0x04)
	float PullBackDistance; // 0x38(0x04)
	float FanOutAngle; // 0x3c(0x04)
	float MaxFanOutScalar; // 0x40(0x04)
	uint32_t FanOutNumSteps; // 0x44(0x04)
	float IdleBobSpeed; // 0x48(0x04)
	float IdleBobDuration; // 0x4c(0x04)
	struct FName CollisionProfileName; // 0x50(0x08)
	struct UCurveFloat* VelocityToAngle; // 0x58(0x08)
	uint32_t MaxExpectedHits; // 0x60(0x04)
	bool bDrawDebugCapsule; // 0x64(0x01)
	bool bDebugOldMovement; // 0x65(0x01)
	char UnknownData_66[0xe2]; // 0x66(0xe2)
};

// Class Athena.LocalDisturbanceFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct ULocalDisturbanceFunctionLibrary : UBlueprintFunctionLibrary {

	void SetWindowSize(struct UObject* WorldContextObject, struct FVector2D WindowSize); // Function Athena.LocalDisturbanceFunctionLibrary.SetWindowSize // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0xd0ea10
	void SetBlendValues(struct UObject* WorldContextObject, struct FVector4 BlendValues); // Function Athena.LocalDisturbanceFunctionLibrary.SetBlendValues // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0xd0d970
	void AddDisturbance(struct UObject* WorldContextObject, struct FVector Position, struct FVector Velocity, float Size, float GrassCutScale); // Function Athena.LocalDisturbanceFunctionLibrary.AddDisturbance // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0xd052f0
};

// Class Athena.AthenaCharacterMovementComponent
// Size: 0x860 (Inherited: 0x590)
struct UAthenaCharacterMovementComponent : UCharacterMovementComponent {
	char UnknownData_590[0x8]; // 0x590(0x08)
	struct FAthenaCharacterSwimParams SwimParams; // 0x598(0x9c)
	float SprintSpdAmp; // 0x634(0x04)
	float SprintAccelAmp; // 0x638(0x04)
	float LookAtYawRate; // 0x63c(0x04)
	float LookAtPitchRate; // 0x640(0x04)
	char UnknownData_644[0x4]; // 0x644(0x04)
	float MaxSpeedRatioWhenWalkingInNonSwimWater; // 0x648(0x04)
	float MaxAccelerationRatioWhenWalkingInNonSwimWater; // 0x64c(0x04)
	char bCharacterCollisionSweepsEnabled : 1; // 0x650(0x01)
	char UnknownData_650_1 : 7; // 0x650(0x01)
	char UnknownData_651[0x3]; // 0x651(0x03)
	float CharacterCollisionRadius; // 0x654(0x04)
	struct FCollisionProfileName CharacterCollisionProfile; // 0x658(0x08)
	struct FCollisionProfileName CollisionPanicFallbackProfileName; // 0x660(0x08)
	float CharacterCollisionWalkingFriction; // 0x668(0x04)
	float CharacterCollisionSwimmingFriction; // 0x66c(0x04)
	float CharacterCollisionUnderwaterOffset; // 0x670(0x04)
	char UnknownData_674[0x4]; // 0x674(0x04)
	struct UAthenaCharacterMovementUnderwater* UnderwaterMovement; // 0x678(0x08)
	bool bCreateDisturbance; // 0x680(0x01)
	char UnknownData_681[0x3]; // 0x681(0x03)
	float DisturbanceSize; // 0x684(0x04)
	float DisturbanceVelocityScale; // 0x688(0x04)
	bool UseAsRVOObstacleOnly; // 0x68c(0x01)
	char UnknownData_68D[0x63]; // 0x68d(0x63)
	float FanPushOutAngle; // 0x6f0(0x04)
	int32_t FanPushOutNumSteps; // 0x6f4(0x04)
	float MaxFanPushOutScalar; // 0x6f8(0x04)
	char UnknownData_6FC[0x4]; // 0x6fc(0x04)
	struct UCurveFloat* UnderwaterVelocityToAnglePitchProjectileHitVolume; // 0x700(0x08)
	struct UCurveFloat* UnderwaterVelocityToAngleRollProjectileHitVolume; // 0x708(0x08)
	struct UCurveFloat* UnderwaterVelocityToZOffsetProjectileHitVolume; // 0x710(0x08)
	struct UCurveFloat* OnLandVelocityToAnglePitchProjectileHitVolume; // 0x718(0x08)
	struct UCurveFloat* OnLandVelocityToXOffsetProjectileHitVolume; // 0x720(0x08)
	struct UCurveFloat* OnLandVelocityToYOffsetProjectileHitVolume; // 0x728(0x08)
	struct UCurveFloat* OnLandVelocityToZOffsetProjectileHitVolume; // 0x730(0x08)
	struct UCurveFloat* FallingVelocityToAnglePitchProjectileHitVolume; // 0x738(0x08)
	struct UCurveFloat* FallingVelocityToXOffsetProjectileHitVolume; // 0x740(0x08)
	struct UCurveFloat* FallingVelocityToZOffsetProjectileHitVolume; // 0x748(0x08)
	char UnknownData_750[0xd0]; // 0x750(0xd0)
	struct FName NonUnderwaterCollisionProfileName; // 0x820(0x08)
	struct FName UnderwaterCollisionProfileName; // 0x828(0x08)
	char UnknownData_830[0x30]; // 0x830(0x30)

	void UnforceSwimmingClientTrustThreshold(); // Function Athena.AthenaCharacterMovementComponent.UnforceSwimmingClientTrustThreshold // Final|Native|Public|BlueprintCallable // @ game+0xd0f7c0
	void SetMovementMode(char NewMovementMode, char NewCustomMode); // Function Athena.AthenaCharacterMovementComponent.SetMovementMode // Native|Public|BlueprintCallable // @ game+0xd0e340
	void SetErrorOnResolvePenetration(bool ErrorOnResolve); // Function Athena.AthenaCharacterMovementComponent.SetErrorOnResolvePenetration // Final|Native|Public|BlueprintCallable // @ game+0xd0dc50
	bool HasValidAckedMoveClientOnly(); // Function Athena.AthenaCharacterMovementComponent.HasValidAckedMoveClientOnly // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0a7a0
	float GetTimestampOfMostRecentPredictedMoveClientOnly(); // Function Athena.AthenaCharacterMovementComponent.GetTimestampOfMostRecentPredictedMoveClientOnly // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09f90
	float GetTimestampOfLastAckedMoveClientOnly(); // Function Athena.AthenaCharacterMovementComponent.GetTimestampOfLastAckedMoveClientOnly // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09f60
	float GetTerminalVelocity(); // Function Athena.AthenaCharacterMovementComponent.GetTerminalVelocity // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09ef0
	char GetMovementMode(); // Function Athena.AthenaCharacterMovementComponent.GetMovementMode // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09900
	float GetMaxSprintSpeed(); // Function Athena.AthenaCharacterMovementComponent.GetMaxSprintSpeed // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09850
	float GetMaxMoveSpeedScalar(); // Function Athena.AthenaCharacterMovementComponent.GetMaxMoveSpeedScalar // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09820
	void ForceSwimmingClientTrustThreshold(float NewSwimmingClientTrustThreshold); // Function Athena.AthenaCharacterMovementComponent.ForceSwimmingClientTrustThreshold // Final|Native|Public|BlueprintCallable // @ game+0xd06890
	void FindCurrentFloor(); // Function Athena.AthenaCharacterMovementComponent.FindCurrentFloor // Final|Native|Public|BlueprintCallable // @ game+0xd06590
};

// Class Athena.AthenaPlayerCharacterMovementComponent
// Size: 0x9b0 (Inherited: 0x860)
struct UAthenaPlayerCharacterMovementComponent : UAthenaCharacterMovementComponent {
	struct UCurveFloat* LandingSpeedToFallDamageCurve; // 0x860(0x08)
	float MinFallSpeedToPossiblyCauseDamage; // 0x868(0x04)
	float MinTimeBetweenDamagingImpactsOnUnwalkableSurface; // 0x86c(0x04)
	float MinFallDamageToBreakLeg; // 0x870(0x04)
	float FiredFromActorFallDamageScalar; // 0x874(0x04)
	float TimeUntilRecoverFallDamageAudioState; // 0x878(0x04)
	char UnknownData_87C[0x4]; // 0x87c(0x04)
	struct FStatus FallDamageLimpingStatus; // 0x880(0x18)
	float SwimmingStateFilterTime; // 0x898(0x04)
	char UnknownData_89C[0x114]; // 0x89c(0x114)

	void SetFallDamageLimpStatusIntensity(float Intensity); // Function Athena.AthenaPlayerCharacterMovementComponent.SetFallDamageLimpStatusIntensity // Final|Native|Public|BlueprintCallable // @ game+0xd0dce0
	void RestoreAudioStateAfterFallDamage(); // Function Athena.AthenaPlayerCharacterMovementComponent.RestoreAudioStateAfterFallDamage // Final|Native|Private // @ game+0xd0d0a0
	void CheckForExcessiveVelocity(float DeltaTime); // Function Athena.AthenaPlayerCharacterMovementComponent.CheckForExcessiveVelocity // Final|Native|Private // @ game+0xd05df0
};

// Class Athena.MockAthenaPlayerCharacterMovementComponent
// Size: 0x9b0 (Inherited: 0x9b0)
struct UMockAthenaPlayerCharacterMovementComponent : UAthenaPlayerCharacterMovementComponent {
};

// Class Athena.MockAthenaPlayerCharacterWithAthenaPlayerCharacterMovementComponent
// Size: 0x1f50 (Inherited: 0x1f50)
struct AMockAthenaPlayerCharacterWithAthenaPlayerCharacterMovementComponent : AAthenaPlayerCharacterMock {
};

// Class Athena.StreamingLocationComponent
// Size: 0xe8 (Inherited: 0xc8)
struct UStreamingLocationComponent : UActorComponent {
	char UnknownData_C8[0x8]; // 0xc8(0x08)
	struct FStreamingLocation StreamingLocationOverride; // 0xd0(0x10)
	bool StreamingLocationActive; // 0xe0(0x01)
	char UnknownData_E1[0x7]; // 0xe1(0x07)

	void Server_StreamingLocationOverrideApplied(int32_t Id); // Function Athena.StreamingLocationComponent.Server_StreamingLocationOverrideApplied // Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate // @ game+0xd0d620
	void OnRep_StreamingLocationOverride(); // Function Athena.StreamingLocationComponent.OnRep_StreamingLocationOverride // Final|Native|Private // @ game+0xd0c910
};

// Class Athena.AthenaTavernPlayerCharacter
// Size: 0x1f90 (Inherited: 0x1f20)
struct AAthenaTavernPlayerCharacter : AAthenaPlayerCharacter {
	struct UAICreatureMovementModifierParamsDataAsset* ArenaTavernPetMovementData; // 0x1f20(0x08)
	char UnknownData_1F28[0x30]; // 0x1f28(0x30)
	struct AAthenaPlayerController* PlayerController; // 0x1f58(0x08)
	char UnknownData_1F60[0x20]; // 0x1f60(0x20)
	bool VoteForRivalsHasPassed; // 0x1f80(0x01)
	char UnknownData_1F81[0xf]; // 0x1f81(0x0f)

	void OnRep_VoteForRivalsHasPassed(); // Function Athena.AthenaTavernPlayerCharacter.OnRep_VoteForRivalsHasPassed // Final|Native|Private // @ game+0xd0c990
};

// Class Athena.AthenaTavernPlayerCharacterMock
// Size: 0x1f90 (Inherited: 0x1f90)
struct AAthenaTavernPlayerCharacterMock : AAthenaTavernPlayerCharacter {
};

// Class Athena.AthenaCharacterBaseLocomotionInputComponent
// Size: 0x300 (Inherited: 0x298)
struct UAthenaCharacterBaseLocomotionInputComponent : UAthenaCharacterBaseInputComponent {
	char UnknownData_298[0x60]; // 0x298(0x60)
	struct UClass* ThrowablesItemCategory; // 0x2f8(0x08)
};

// Class Athena.DebugFlyingInputComponent
// Size: 0x300 (Inherited: 0x300)
struct UDebugFlyingInputComponent : UAthenaCharacterBaseLocomotionInputComponent {
};

// Class Athena.LocomotionInputComponent
// Size: 0x300 (Inherited: 0x300)
struct ULocomotionInputComponent : UAthenaCharacterBaseLocomotionInputComponent {
};

// Class Athena.AthenaCharacterDockingFunctions
// Size: 0x28 (Inherited: 0x28)
struct UAthenaCharacterDockingFunctions : UBlueprintFunctionLibrary {

	void StartDockingCharacterWithActor(struct FDocker Docker, struct AAthenaCharacter* Owner, TScriptInterface<struct UDockableInterface> Target, float DockDuration, float DelayAfterDockDuration); // Function Athena.AthenaCharacterDockingFunctions.StartDockingCharacterWithActor // Final|RequiredAPI|Native|Static|Public|HasOutParms|BlueprintCallable // @ game+0xd0ef80
};

// Class Athena.AthenaCharacterDodgeComponent
// Size: 0x108 (Inherited: 0xc8)
struct UAthenaCharacterDodgeComponent : UActorComponent {
	struct FAthenaCharacterDodgeParams Params; // 0xc8(0x10)
	float ConsecutiveDodgeCountResetTimer; // 0xd8(0x04)
	char UnknownData_DC[0x4]; // 0xdc(0x04)
	struct UCurveFloat* BunnyHoppingScalarCurve; // 0xe0(0x08)
	struct AAthenaCharacter* Character; // 0xe8(0x08)
	char UnknownData_F0[0x18]; // 0xf0(0x18)

	void Server_RequestDodge(struct FVector Direction); // Function Athena.AthenaCharacterDodgeComponent.Server_RequestDodge // Final|Net|NetReliableNative|Event|Private|NetServer|HasDefaults|NetValidate // @ game+0xd0d580
	void Multicast_CharacterDodge(struct FVector Direction); // Function Athena.AthenaCharacterDodgeComponent.Multicast_CharacterDodge // Final|Net|NetReliableNative|Event|NetMulticast|UbergraphFunction|Private|HasDefaults // @ game+0xd0b7a0
};

// Class Athena.AthenaCharacterFunctions
// Size: 0x28 (Inherited: 0x28)
struct UAthenaCharacterFunctions : UBlueprintFunctionLibrary {

	void SetItemMovementSpeed(struct AAthenaCharacter* Character, char InItemUseSpeed, struct FItemUseSpeedParams Params); // Function Athena.AthenaCharacterFunctions.SetItemMovementSpeed // Final|Native|Static|Public|BlueprintCallable // @ game+0xd0df80
	void ResetItemMovementSpeed(struct AAthenaCharacter* Character); // Function Athena.AthenaCharacterFunctions.ResetItemMovementSpeed // Final|Native|Static|Public|BlueprintCallable // @ game+0xd0cf90
	bool IsActionStateMachineActive(struct AAthenaCharacter* Character); // Function Athena.AthenaCharacterFunctions.IsActionStateMachineActive // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0xd0aa90
	struct FTeleportLocation GetTeleportLocationForPlayer(struct AAthenaCharacter* Player, char Space); // Function Athena.AthenaCharacterFunctions.GetTeleportLocationForPlayer // Final|Native|Static|Public|BlueprintCallable // @ game+0xd09e10
	bool AllAnimationsLoadedForCharacter(struct AAthenaCharacter* Character); // Function Athena.AthenaCharacterFunctions.AllAnimationsLoadedForCharacter // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0xd056f0
};

// Class Athena.AthenaCharacterKnockbackComponent
// Size: 0x138 (Inherited: 0xc8)
struct UAthenaCharacterKnockbackComponent : UActorComponent {
	char UnknownData_C8[0x8]; // 0xc8(0x08)
	bool Disabled; // 0xd0(0x01)
	char UnknownData_D1[0x7]; // 0xd1(0x07)
	struct AAthenaCharacter* Character; // 0xd8(0x08)
	char UnknownData_E0[0x58]; // 0xe0(0x58)

	void SetDisabled(bool IsDisabled); // Function Athena.AthenaCharacterKnockbackComponent.SetDisabled // Final|Native|Public|BlueprintCallable // @ game+0xd0db30
	void KnockBack(struct FKnockBackInfo KnockBackInfo, struct FVector Direction, float NoWaterDragDuration, struct UClass* DamagerType); // Function Athena.AthenaCharacterKnockbackComponent.KnockBack // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xd0b200
	void Client_PlayerKnockBackRPC(struct FKnockBackInfo KnockBackInfo, struct FVector Direction, float NoWaterDragDuration); // Function Athena.AthenaCharacterKnockbackComponent.Client_PlayerKnockBackRPC // Final|Net|NetReliableNative|Event|Private|HasDefaults|NetClient // @ game+0xd05fe0
};

// Class Athena.AthenaCharacterKnockbackComponentMock
// Size: 0x138 (Inherited: 0x138)
struct UAthenaCharacterKnockbackComponentMock : UAthenaCharacterKnockbackComponent {
};

// Class Athena.AthenaCharacterMovementCheatDetectionSettings
// Size: 0x30 (Inherited: 0x28)
struct UAthenaCharacterMovementCheatDetectionSettings : UObject {
	float MinLifetime; // 0x28(0x04)
	float MinRatioLifetimeToLifetimeRawTimeDiscrepancy; // 0x2c(0x04)
};

// Class Athena.AthenaAICharacterMovementComponent
// Size: 0x9a0 (Inherited: 0x860)
struct UAthenaAICharacterMovementComponent : UAthenaCharacterMovementComponent {
	char UnknownData_860[0x8]; // 0x860(0x08)
	struct FAIStrategyMovementProperties DefaultMovementProperties; // 0x868(0x18)
	struct TArray<struct FAIStrategyMovementProperties> AIStrategyMovementProperties; // 0x880(0x10)
	struct TArray<struct FItemCategoryAIStrategyMovementPropertiesOverride> ItemCategoryAIStrategyMovementPropertiesOverrides; // 0x890(0x10)
	float BlendSpeed; // 0x8a0(0x04)
	float KeepOnNavMeshProjectionDistance; // 0x8a4(0x04)
	bool bDebugKeepOnNavMesh; // 0x8a8(0x01)
	bool DisableNavMeshChecks; // 0x8a9(0x01)
	bool OverrideSmoothNetUpdateDistancesDuringCharge; // 0x8aa(0x01)
	char UnknownData_8AB[0x1]; // 0x8ab(0x01)
	float ChargeMaxSmoothNetUpdateDist; // 0x8ac(0x04)
	float ChargeNoSmoothNetUpdateDist; // 0x8b0(0x04)
	float ChargeSmoothNetUpdateGracePeriod; // 0x8b4(0x04)
	char UnknownData_8B8[0xc0]; // 0x8b8(0xc0)
	float DesiredMaxSpeedAmp; // 0x978(0x04)
	float DesiredMaxAccelAmp; // 0x97c(0x04)
	char UnknownData_980[0x20]; // 0x980(0x20)
};

// Class Athena.AthenaCharacterMovementSettings
// Size: 0x68 (Inherited: 0x28)
struct UAthenaCharacterMovementSettings : UObject {
	struct FNetPositionErrorTolerance StandardError; // 0x28(0x08)
	struct FNetPositionErrorTolerance SwimmingError; // 0x30(0x08)
	float SwimmingClientTrustThreshold; // 0x38(0x04)
	float MaxSwimmingTimeStep; // 0x3c(0x04)
	int32_t MaxSwimmingIterations; // 0x40(0x04)
	float RebaseToServerErrorSqrDist; // 0x44(0x04)
	float OnlyInterpolationAfterSqrDist; // 0x48(0x04)
	float InterpolationSqrDistWhenWithinConeAngle; // 0x4c(0x04)
	float IncreasedInterpolationDistConeAngleDegrees; // 0x50(0x04)
	bool OnlyUseInterpolationConeAngleForPlayerCharacters; // 0x54(0x01)
	char UnknownData_55[0x3]; // 0x55(0x03)
	float NoVisualUpdateAfterSqrDist; // 0x58(0x04)
	float TimeBetweenPlayerDistanceChecks; // 0x5c(0x04)
	float TimeBetweenPlayerDistanceChecksWhenConsideringConeAngle; // 0x60(0x04)
	float TimeToSimulateNewCharacters; // 0x64(0x04)
};

// Class Athena.AthenaCharacterStateManagerComponent
// Size: 0x188 (Inherited: 0xc8)
struct UAthenaCharacterStateManagerComponent : UActorComponent {
	char UnknownData_C8[0xc0]; // 0xc8(0xc0)
};

// Class Athena.AthenaCharacterTestFunctions
// Size: 0x28 (Inherited: 0x28)
struct UAthenaCharacterTestFunctions : UBlueprintFunctionLibrary {

	void WaitUntilFullySpawned(struct AAthenaCharacter* Target, struct FLatentActionInfo LatentInfo); // Function Athena.AthenaCharacterTestFunctions.WaitUntilFullySpawned // Final|Native|Static|Public|BlueprintCallable // @ game+0xd10cd0
	void WaitUntilDocked(struct UObject* WorldContextObject, struct FLatentActionInfo LatentInfo, struct AAthenaCharacter* AthenaCharacter); // Function Athena.AthenaCharacterTestFunctions.WaitUntilDocked // Final|Native|Static|Public|BlueprintCallable // @ game+0xd10bb0
	void WaitForTeleport(struct UObject* WorldContextObject, struct AAthenaCharacter* AthenaCharacter, struct FLatentActionInfo LatentInfo); // Function Athena.AthenaCharacterTestFunctions.WaitForTeleport // Final|Native|Static|Public|BlueprintCallable // @ game+0xd10a90
	void WaitForMovementMode(struct UObject* WorldContextObject, struct FLatentActionInfo LatentInfo, struct AAthenaCharacter* AthenaCharacter, char WantedMovementMode, int32_t NumFramesInMovementMode); // Function Athena.AthenaCharacterTestFunctions.WaitForMovementMode // Final|Native|Static|Public|BlueprintCallable // @ game+0xd10900
	void WaitForCustomMovementMode(struct UObject* WorldContextObject, struct FLatentActionInfo LatentInfo, struct AAthenaCharacter* AthenaCharacter, char CustomMovementMode, int32_t NumFramesInMovementMode); // Function Athena.AthenaCharacterTestFunctions.WaitForCustomMovementMode // Final|Native|Static|Public|BlueprintCallable // @ game+0xd10770
	void TeleportToPosition(struct UObject* WorldContextObject, struct FLatentActionInfo LatentInfo, struct AAthenaCharacter* AthenaCharacter, struct USceneComponent* TeleportBase, struct FVector Position, struct FRotator Rotation, int32_t StreamOutLevel, int32_t StreamInLevel); // Function Athena.AthenaCharacterTestFunctions.TeleportToPosition // Final|Native|Static|Public|HasDefaults|BlueprintCallable // @ game+0xd0f3c0
	void SimulateButtonRelease(struct APlayerController* PlayerController, struct FKey Button); // Function Athena.AthenaCharacterTestFunctions.SimulateButtonRelease // Final|Native|Static|Public|BlueprintCallable // @ game+0xd0ee20
	void SimulateButtonPress(struct APlayerController* PlayerController, struct FKey Button); // Function Athena.AthenaCharacterTestFunctions.SimulateButtonPress // Final|Native|Static|Public|BlueprintCallable // @ game+0xd0ecf0
	void SetupCharacterForMPTesting(struct UObject* WorldContextObject, struct AAthenaCharacter* AthenaCharacter); // Function Athena.AthenaCharacterTestFunctions.SetupCharacterForMPTesting // Final|Native|Static|Public|BlueprintCallable // @ game+0xd0ec40
	struct AAthenaCharacter* SetupAthenaCharacterForInteractionTestByIndex(struct UObject* WorldContextObject, int32_t PlayerIndex); // Function Athena.AthenaCharacterTestFunctions.SetupAthenaCharacterForInteractionTestByIndex // Final|Native|Static|Public|BlueprintCallable // @ game+0xd0eb80
	struct AAthenaCharacter* SetupAthenaCharacterForInteractionTest(struct UObject* WorldContextObject, struct AAthenaCharacter* AthenaCharacter); // Function Athena.AthenaCharacterTestFunctions.SetupAthenaCharacterForInteractionTest // Final|Native|Static|Public|BlueprintCallable // @ game+0xd0eac0
	bool HasAnyoneGotInputBindings(struct UObject* WorldContextObject); // Function Athena.AthenaCharacterTestFunctions.HasAnyoneGotInputBindings // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0xd0a680
	struct AAthenaPlayerCharacter* GetLocalAthenaCharacter(struct UObject* WorldContextObject, int32_t PlayerIndex); // Function Athena.AthenaCharacterTestFunctions.GetLocalAthenaCharacter // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0xd09480
	struct AAthenaPlayerCharacter* GetClientPlayerCharacter(struct UObject* WorldContextObject, int32_t ClientId, int32_t SplitScreenIndex); // Function Athena.AthenaCharacterTestFunctions.GetClientPlayerCharacter // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0xd07340
	struct AAthenaCharacter* GetClientCharacter(struct UObject* WorldContextObject, int32_t ClientId, int32_t SplitScreenIndex); // Function Athena.AthenaCharacterTestFunctions.GetClientCharacter // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0xd07250
	void ForceInteract(struct UObject* WorldContextObject, struct FLatentActionInfo LatentInfo, struct AAthenaCharacter* AthenaCharacter, struct AActor* Interactable, bool WaitUntilFullyDocked); // Function Athena.AthenaCharacterTestFunctions.ForceInteract // Final|Native|Static|Public|BlueprintCallable // @ game+0xd065d0
	struct AItemInfo* CreateAndEquipItemDesc(struct AAthenaCharacter* Character, struct UClass* ItemDesc); // Function Athena.AthenaCharacterTestFunctions.CreateAndEquipItemDesc // Final|Native|Static|Public|BlueprintCallable // @ game+0xd061b0
	struct AItemInfo* CreateAndAddItemDescToInventory(struct AAthenaCharacter* Character, struct UClass* ItemDesc); // Function Athena.AthenaCharacterTestFunctions.CreateAndAddItemDescToInventory // Final|Native|Static|Public|BlueprintCallable // @ game+0xd060f0
	void ClearInputBindings(struct UObject* WorldContextObject); // Function Athena.AthenaCharacterTestFunctions.ClearInputBindings // Final|Native|Static|Public|BlueprintCallable // @ game+0xd05ee0
	void ClearCharacterInteractionPolicies(struct UObject* WorldContextObject); // Function Athena.AthenaCharacterTestFunctions.ClearCharacterInteractionPolicies // Final|Native|Static|Public|BlueprintCallable // @ game+0xd05e70
};

// Class Athena.AthenaContestTavern
// Size: 0x400 (Inherited: 0x3c8)
struct AAthenaContestTavern : AActor {
	struct TArray<struct ASpawnLocation*> TavernSpawnPoints; // 0x3c8(0x10)
	struct TArray<struct AActor*> TavernLevelActorsToPrepare; // 0x3d8(0x10)
	char UnknownData_3E8[0x18]; // 0x3e8(0x18)
};

// Class Athena.PlayerPermissionsComponent
// Size: 0xd0 (Inherited: 0xc8)
struct UPlayerPermissionsComponent : UActorComponent {
	bool AllowDebugMenuAccess; // 0xc8(0x01)
	bool AllowDebugMenuButtonShortcutsAccess; // 0xc9(0x01)
	bool AllowExecuteOnServer; // 0xca(0x01)
	bool DisableWatermark; // 0xcb(0x01)
	char UnknownData_CC[0x4]; // 0xcc(0x04)
};

// Class Athena.AthenaDebugMenuComponent
// Size: 0x128 (Inherited: 0x118)
struct UAthenaDebugMenuComponent : UDebugMenuComponent {
	char UnknownData_118[0x10]; // 0x118(0x10)
};

// Class Athena.TestAthenaDebugMenuComponent
// Size: 0x138 (Inherited: 0x128)
struct UTestAthenaDebugMenuComponent : UAthenaDebugMenuComponent {
	struct UPlayerPermissionsComponent* TestPermissionComponent; // 0x128(0x08)
	char UnknownData_130[0x8]; // 0x130(0x08)
};

// Class Athena.AthenaDebugSettings
// Size: 0x38 (Inherited: 0x28)
struct UAthenaDebugSettings : UObject {
	struct FStringAssetReference Dioramas; // 0x28(0x10)
};

// Class Athena.AthenaEditorRuntimeSettings
// Size: 0x68 (Inherited: 0x38)
struct UAthenaEditorRuntimeSettings : UDeveloperSettings {
	int32_t PIECrewSize; // 0x38(0x04)
	bool PIEWithBootflow; // 0x3c(0x01)
	char UnknownData_3D[0x3]; // 0x3d(0x03)
	struct UClass* PIEShipSize; // 0x40(0x08)
	bool PIEIsInitialTutorial; // 0x48(0x01)
	bool PIEIsArenaGame; // 0x49(0x01)
	bool PIEIsCaptain; // 0x4a(0x01)
	bool PIEIsGuildedSession; // 0x4b(0x01)
	int32_t PIEGuildMembersOnCrew; // 0x4c(0x04)
	bool PIEIsCustomServer; // 0x50(0x01)
	char UnknownData_51[0x7]; // 0x51(0x07)
	struct TArray<struct FAthenaAnimationOverrideEntry> AnimationOverrideEntries; // 0x58(0x10)
};

// Class Athena.AthenaPlayModeLevelsDataAsset
// Size: 0xb8 (Inherited: 0x28)
struct UAthenaPlayModeLevelsDataAsset : UDataAsset {
	struct FPlayModeLevelArray PlayModeSpecificLevels[0x04]; // 0x28(0x80)
	struct TArray<struct FStringAssetReference> CommonLevels; // 0xa8(0x10)
};

// Class Athena.UserBannedHandlerRetrievalInterface
// Size: 0x28 (Inherited: 0x28)
struct UUserBannedHandlerRetrievalInterface : UInterface {
};

// Class Athena.AthenaGameContext
// Size: 0x7c0 (Inherited: 0x28)
struct UAthenaGameContext : UObject {
	char UnknownData_28[0x70]; // 0x28(0x70)
	struct UVoiceChatRenderer* VoiceChatRenderer; // 0x98(0x08)
	struct UAthenaPlayModeLevelsDataAsset* PlayModeLevels; // 0xa0(0x08)
	struct UFeatureToggledLevelsDataAsset* FeatureToggledLevels; // 0xa8(0x08)
	char UnknownData_B0[0x1a0]; // 0xb0(0x1a0)
	struct UGameInstance* PrimaryGameInstance; // 0x250(0x08)
	struct UAthenaServerIdentityManager* AthenaServerIdentityManager; // 0x258(0x08)
	struct FGameServiceCoordinator ServiceCoordinator; // 0x260(0x20)
	char UnknownData_280[0x210]; // 0x280(0x210)
	struct UAthenaLocalPlayerManager* AthenaLocalPlayerManager; // 0x490(0x08)
	struct UAthenaLocalPlayerReengage* AthenaLocalPlayerReengage; // 0x498(0x08)
	struct UGameNarrationCoordinator* GameNarrationCoordinator; // 0x4a0(0x08)
	struct UApplicationSettings* ApplicationSettings; // 0x4a8(0x08)
	char UnknownData_4B0[0x310]; // 0x4b0(0x310)
};

// Class Athena.AthenaGameEngine
// Size: 0xaa8 (Inherited: 0xa88)
struct UAthenaGameEngine : URareGameEngine {
	char UnknownData_A88[0x8]; // 0xa88(0x08)
	struct UAthenaGameEngineSettings* EngineSettings; // 0xa90(0x08)
	char UnknownData_A98[0x10]; // 0xa98(0x10)
};

// Class Athena.AthenaGameEngineSettingsInterface
// Size: 0x28 (Inherited: 0x28)
struct UAthenaGameEngineSettingsInterface : UInterface {
};

// Class Athena.AthenaGameEngineSettings
// Size: 0x50 (Inherited: 0x28)
struct UAthenaGameEngineSettings : UObject {
	char UnknownData_28[0x28]; // 0x28(0x28)
};

// Class Athena.AthenaGameEngineSettingsWindows
// Size: 0x60 (Inherited: 0x50)
struct UAthenaGameEngineSettingsWindows : UAthenaGameEngineSettings {
	char UnknownData_50[0x10]; // 0x50(0x10)
};

// Class Athena.AthenaGameInstance
// Size: 0xd0 (Inherited: 0x88)
struct UAthenaGameInstance : UGameInstance {
	char UnknownData_88[0x8]; // 0x88(0x08)
	struct UAthenaPlayModeLevelsDataAsset* AdditionalPlayModeLevels; // 0x90(0x08)
	uint64_t NumLevels; // 0x98(0x08)
	struct UAthenaGameContext* GameContext; // 0xa0(0x08)
	char UnknownData_A8[0x28]; // 0xa8(0x28)

	struct FString GetLocalPlayerId(); // Function Athena.AthenaGameInstance.GetLocalPlayerId // Final|Native|Public|BlueprintCallable // @ game+0xd09540
};

// Class Athena.AthenaGameMode
// Size: 0xb40 (Inherited: 0x4c0)
struct AAthenaGameMode : AGameMode {
	char UnknownData_4C0[0x28]; // 0x4c0(0x28)
	struct UClass* GhostShipPawnClass; // 0x4e8(0x08)
	struct UClass* ServerNetworkedEventsWhitelistDefinition; // 0x4f0(0x08)
	char UnknownData_4F8[0x1a8]; // 0x4f8(0x1a8)
	struct FGhostShipCoordinator GhostShipCoordinator; // 0x6a0(0x370)
	struct FStorageContainerRefresher StorageContainerRefresher; // 0xa10(0xf8)
	struct URiddleQuestDescGeneratorData* RiddleQuestDescGeneratorData; // 0xb08(0x08)
	float RespawnTimer; // 0xb10(0x04)
	float ContestRespawnTimer; // 0xb14(0x04)
	struct FCrewBasedRespawnTimes CrewBasedRespawnTimes; // 0xb18(0x10)
	float StorageContainerRefreshInterval; // 0xb28(0x04)
	int32_t ContainerRefreshBatchSize; // 0xb2c(0x04)
	char UnknownData_B30[0x10]; // 0xb30(0x10)

	void SetStorageContainerRefreshInterval(float InRefreshInterval); // Function Athena.AthenaGameMode.SetStorageContainerRefreshInterval // Final|Native|Public|BlueprintCallable // @ game+0xd0e750
	void SetRespawnTimer(float InRespawnTimer); // Function Athena.AthenaGameMode.SetRespawnTimer // Native|Public|BlueprintCallable // @ game+0xd0e6d0
	void ResetStorageContainers(); // Function Athena.AthenaGameMode.ResetStorageContainers // Final|Native|Public|BlueprintCallable // @ game+0xd0d080
	void RequestDemoSessionReset(struct AAthenaPlayerController* AthenaPlayerController, bool InStartNewSession); // Function Athena.AthenaGameMode.RequestDemoSessionReset // Final|Native|Public|BlueprintCallable // @ game+0xd0cea0
	bool IsPlayerOnGhostShip(struct APawn* PlayerPawn); // Function Athena.AthenaGameMode.IsPlayerOnGhostShip // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0ae90
};

// Class Athena.OnlineAthenaGameMode
// Size: 0xd50 (Inherited: 0xb40)
struct AOnlineAthenaGameMode : AAthenaGameMode {
	char UnknownData_B40[0x210]; // 0xb40(0x210)
};

// Class Athena.TestAthenaGameMode
// Size: 0xb48 (Inherited: 0xb40)
struct ATestAthenaGameMode : AAthenaGameMode {
	char UnknownData_B40[0x8]; // 0xb40(0x08)
};

// Class Athena.TestAthenaGameModeWithHUD
// Size: 0xb48 (Inherited: 0xb48)
struct ATestAthenaGameModeWithHUD : ATestAthenaGameMode {
};

// Class Athena.TestInventoryAthenaGameMode
// Size: 0xb40 (Inherited: 0xb40)
struct ATestInventoryAthenaGameMode : AAthenaGameMode {
};

// Class Athena.AthenaGameplayDebuggingComponent
// Size: 0x880 (Inherited: 0x7f0)
struct UAthenaGameplayDebuggingComponent : UGameplayDebuggingComponent {
	struct TArray<struct FString> CurrentServerActionStates; // 0x7e8(0x10)
	struct UClass* CurrentAIStrategyId; // 0x7f8(0x08)
	struct TArray<struct FDebugReplicatedAbilityData> CachedAIAbilities; // 0x800(0x10)
	struct TArray<struct FAthenaAIControllerTargetPickingData> CachedAITargetPickingData; // 0x810(0x10)
	struct UClass* NextAbility; // 0x820(0x08)
	struct UClass* QueuedAbility; // 0x828(0x08)
	struct TArray<struct UClass*> ReadiedAbilities; // 0x830(0x10)
	struct UAthenaAIAbilityHandlerComponent* AIAbilityComponent; // 0x840(0x08)
	bool FollowUpAbilitySet; // 0x848(0x01)
	int32_t CurrentAbilityStageIndex; // 0x84c(0x04)
	struct TArray<struct UClass*> AbilitiesActiveInCurrentStage; // 0x850(0x10)
	char UnknownData_865[0x1b]; // 0x865(0x1b)
};

// Class Athena.AthenaGameplayDebuggingHUDComponent
// Size: 0x4b8 (Inherited: 0x4b8)
struct AAthenaGameplayDebuggingHUDComponent : AGameplayDebuggingHUDComponent {
};

// Class Athena.ShovelSurfaceFxDataAsset
// Size: 0x38 (Inherited: 0x28)
struct UShovelSurfaceFxDataAsset : UDataAsset {
	struct TArray<struct FDigSurfaceTypeParams> SurfaceParams; // 0x28(0x10)
};

// Class Athena.ShovelSurfaceHoleDataAsset
// Size: 0x38 (Inherited: 0x28)
struct UShovelSurfaceHoleDataAsset : UDataAsset {
	struct TArray<struct FSurfaceDigHole> SurfaceDigHoleClass; // 0x28(0x10)
};

// Class Athena.AthenaGameSettings
// Size: 0x900 (Inherited: 0x28)
struct UAthenaGameSettings : UObject {
	int32_t NumberOfDaysInEachMonth; // 0x28(0x04)
	char UnknownData_2C[0x4]; // 0x2c(0x04)
	struct FString EntryMap; // 0x30(0x10)
	struct FString FrontendMap; // 0x40(0x10)
	struct FString InGameMap; // 0x50(0x10)
	struct FString TutorialMap; // 0x60(0x10)
	struct FStringAssetReference PlayModeLevels; // 0x70(0x10)
	struct FStringAssetReference FeatureToggledLevels; // 0x80(0x10)
	struct FString OverrideServerURL; // 0x90(0x10)
	float LoadLevelTimeoutTime; // 0xa0(0x04)
	float ServiceBridgeConnectTimeout; // 0xa4(0x04)
	struct UClass* VoiceChatRendererClass; // 0xa8(0x20)
	struct UClass* GameNarrationCoordinatorClass; // 0xc8(0x20)
	struct UClass* ApplicationSettingsClass; // 0xe8(0x20)
	struct FStringAssetReference CinematicCameraControllerClass; // 0x108(0x10)
	struct FStringAssetReference CinematicCameraSpectatorPawnClass; // 0x118(0x10)
	struct FStringAssetReference MaterialTranslationTableFileLocation; // 0x128(0x10)
	struct FStringAssetReference MaterialAudioTableFileLocation; // 0x138(0x10)
	struct FStringAssetReference MaterialVFXTableFileLocation; // 0x148(0x10)
	struct FStringAssetReference ShipAssetClassDatabaseFileLocation; // 0x158(0x10)
	struct FStringAssetReference AIPersistentPartsServiceAssetClassFileLocation; // 0x168(0x10)
	struct FStringAssetReference AIPartsServiceAssetClassFileLocation; // 0x178(0x10)
	struct FStringAssetReference DebugMenuFileLocation; // 0x188(0x10)
	struct FStringAssetReference SpawnLocationKeywordPriorityListLocation; // 0x198(0x10)
	struct FStringAssetReference CrewSpawnLocationVariablesListAsset; // 0x1a8(0x10)
	struct FStringAssetReference SkellyFortDataFileLocation; // 0x1b8(0x10)
	struct FStringAssetReference SkellyFortListDataFileLocation; // 0x1c8(0x10)
	struct FStringAssetReference AIShipServiceDataAssetFileLocation; // 0x1d8(0x10)
	struct FToggleableAIShipServiceDataAssetFileLocation AIShipServiceDataAssetFileLocationOverride; // 0x1e8(0x18)
	struct FStringAssetReference EnemyAIOnShipServiceDataAssetFileLocation; // 0x200(0x10)
	struct FStringAssetReference ProjectileServiceDataFileLocation; // 0x210(0x10)
	struct FStringAssetReference ThrottledProjectileTickDataAssetLocation; // 0x220(0x10)
	struct FStringAssetReference HoleDataFileLocation; // 0x230(0x10)
	struct FStringAssetReference PlayerBuriedItemServiceDataFileLocation; // 0x240(0x10)
	struct FStringAssetReference ItemLifetimeIslandCapsDataFileLocation; // 0x250(0x10)
	struct FStringAssetReference CursedCannonballDataAsset; // 0x260(0x10)
	struct FStringAssetReference Throwables; // 0x270(0x10)
	struct UClass* ThrowablesItemCategory; // 0x280(0x08)
	struct FStringAssetReference SpawnableItemsDataAssetLocation; // 0x288(0x10)
	struct FStringAssetReference FireworksDebugSpawnItemsDataAsset; // 0x298(0x10)
	struct FStringAssetReference UnlockableEntitlementsDataAssetLocation; // 0x2a8(0x10)
	struct FStringAssetReference DebugWieldablesDataAsset; // 0x2b8(0x10)
	struct FStringAssetReference StrongholdKeyDataAsset; // 0x2c8(0x10)
	struct FStringAssetReference MigrationUIContentsFileLocation; // 0x2d8(0x10)
	struct FStringAssetReference ArenaMigrationUIContentsFileLocation; // 0x2e8(0x10)
	struct FStringAssetReference InventoryRemappingAssetLocation; // 0x2f8(0x10)
	struct FStringAssetReference AllianceSettingsAssetLocation; // 0x308(0x10)
	struct FStringAssetReference ReapersMarkSettingsAssetLocation; // 0x318(0x10)
	struct FStringAssetReference EmissaryLevelSettingsAssetLocation; // 0x328(0x10)
	struct FStringAssetReference EmissaryRewardSettingsAssetLocation; // 0x338(0x10)
	struct FStringAssetReference FactionSettingsAssetLocation; // 0x348(0x10)
	struct FStringAssetReference FactionLootLevelRewardsAssetLocation; // 0x358(0x10)
	struct FStringAssetReference FlamesOfFateSettingsAssetLocation; // 0x368(0x10)
	struct FStringAssetReference DiggingConfigResolverAssetLocation; // 0x378(0x10)
	struct FStringAssetReference ContestSettingsDataAsset; // 0x388(0x10)
	struct FStringAssetReference ContestEventsDataAsset; // 0x398(0x10)
	struct FStringAssetReference CrewNotificationToastSettings; // 0x3a8(0x10)
	struct FStringAssetReference FireSettingsDataAsset; // 0x3b8(0x10)
	struct FString InventoryDefaultItemURL; // 0x3c8(0x10)
	float CheatFlyingSpeedSlow; // 0x3d8(0x04)
	float CheatFlyingSpeedDefault; // 0x3dc(0x04)
	float CheatFlyingSpeedFast; // 0x3e0(0x04)
	float CheatFlyingAcceleration; // 0x3e4(0x04)
	struct FEncounterServiceParams EncounterServiceParams; // 0x3e8(0x20)
	struct FWindServiceParams WindParams; // 0x408(0x24)
	char UnknownData_42C[0x4]; // 0x42c(0x04)
	struct FCrewServiceParams CrewServiceParams; // 0x430(0x70)
	struct FSharedShovelParams SharedShovelParams; // 0x4a0(0x60)
	struct FMermaidServiceParams MermaidServiceParams; // 0x500(0x88)
	struct FMermaidServiceParams ContestSpecificMermaidServiceParamsToggleLocked; // 0x588(0x88)
	struct FMakeFriendsEmoteParams MakeFriendsEmoteParams; // 0x610(0x18)
	struct FMermaidRespawnConfig MermaidRespawnConfiguration; // 0x628(0x28)
	struct FCharacterSocketCollisionServiceParams CharacterSocketCollisionServiceParams; // 0x650(0x08)
	struct FAthenaAICharacterParams AAthenaAICharacterParams; // 0x658(0x14)
	int32_t AssumedMaxFPSOnServer; // 0x66c(0x04)
	struct FName WwiseObjectUnderwaterStateSwitchGroup; // 0x670(0x08)
	struct FName WwiseObjectUnderwaterSwitchDefaultState; // 0x678(0x08)
	struct FName WwiseObjectUnderwaterSwitchUnderwaterState; // 0x680(0x08)
	float StormQuantisePrecision; // 0x688(0x04)
	char UnknownData_68C[0x4]; // 0x68c(0x04)
	struct FStringAssetReference ShipLiveryCatalogueDataAssetLocation; // 0x690(0x10)
	struct FStringAssetReference ShipPartsCatalogueDataAssetLocation; // 0x6a0(0x10)
	struct FStringAssetReference RowboatSpawnParamsDataAssetLocation; // 0x6b0(0x10)
	struct FStringAssetReference HarpoonLauncherItemExclusionDataAssetLocation; // 0x6c0(0x10)
	struct FStringAssetReference KrakenTentacleClassLocation; // 0x6d0(0x10)
	struct FStringAssetReference KrakenShipTentacleClassLocation; // 0x6e0(0x10)
	struct FStringAssetReference KrakenServiceParamsDataAssetLocation; // 0x6f0(0x10)
	struct FStringAssetReference AmbientTinySharkServiceParamsDataAssetLocation; // 0x700(0x10)
	struct FStringAssetReference SunkenIslandSettings; // 0x710(0x10)
	struct FStringAssetReference CompanyDataListAssetLocation; // 0x720(0x10)
	struct FStringAssetReference CoherentUIGTAssetRootLocation; // 0x730(0x10)
	struct FStringAssetReference CoherentUIGTPersistentDataAssetLocation; // 0x740(0x10)
	struct FStringAssetReference CoherentContentEngagementMessageLocation; // 0x750(0x10)
	struct FStringAssetReference NestedWorldRootDataAssetLocation; // 0x760(0x10)
	struct FStringAssetReference AshenLordEncounterServiceParams; // 0x770(0x10)
	struct FStringAssetReference PortalServiceParams; // 0x780(0x10)
	struct FStringAssetReference AggressiveGhostShipsEncounterServiceParams; // 0x790(0x10)
	struct TArray<struct UClass*> RequiredLoadoutCategories; // 0x7a0(0x10)
	struct FStringAssetReference CarouselGenerationParams; // 0x7b0(0x10)
	float SinkingShipDestructionDistanceThreshold; // 0x7c0(0x04)
	char UnknownData_7C4[0x4]; // 0x7c4(0x04)
	struct FStringAssetReference DefaultItemsToBeDisplayedOnInventoryPanel; // 0x7c8(0x10)
	struct UClass* DefaultFogBank; // 0x7d8(0x08)
	struct UClass* DefaultFogBankManager; // 0x7e0(0x08)
	struct FStringAssetReference TunnelsOfTheDamnedServiceParamsDataAssetLocation; // 0x7e8(0x10)
	struct FPlayerModerationParams PlayerModerationParams; // 0x7f8(0x0c)
	char UnknownData_804[0x4]; // 0x804(0x04)
	struct FStringAssetReference SpireServiceParamsDataAssetLocation; // 0x808(0x10)
	struct UClass* GhostCurseEntitlement; // 0x818(0x08)
	struct FName GhostCurseRewardId; // 0x820(0x08)
	struct UClass* GoldGhostCurseEntitlement; // 0x828(0x08)
	struct FName GoldGhostCurseRewardId; // 0x830(0x08)
	struct UClass* SkeletonCurseEntitlement; // 0x838(0x08)
	struct FName SkeletonCurseRewardId; // 0x840(0x08)
	struct FName SkeletonCurseWardrobeKey; // 0x848(0x08)
	struct TArray<struct UClass*> SkeletonClothingCategories; // 0x850(0x10)
	struct FStringAssetReference SkeletonClothingEntitlementMapDataAsset; // 0x860(0x10)
	struct TArray<char> KillNotificationHealthChangeReasons; // 0x870(0x10)
	struct FStringAssetReference ShipStorageJettisonParamsDataAsset; // 0x880(0x10)
	struct FStringAssetReference WorldEdgeItemParamsDataAsset; // 0x890(0x10)
	struct FStringAssetReference PlayerLootMarkerServiceParamsFileLocation; // 0x8a0(0x10)
	struct FStringAssetReference AdventureOnDemandServiceParamsAssetFileLocation; // 0x8b0(0x10)
	struct FStringAssetReference AdventureOnDemandVoyageSelectionDataAssetFileLocation; // 0x8c0(0x10)
	struct FStringAssetReference SkellyFortAvailabilityParamsAssetFileLocation; // 0x8d0(0x10)
	struct FStringAssetReference KrakenAvailabilityParamsAssetFileLocation; // 0x8e0(0x10)
	struct FStringAssetReference AshenLordAvailabilityParamsAssetFileLocation; // 0x8f0(0x10)
};

// Class Athena.AthenaGameState
// Size: 0xc20 (Inherited: 0x540)
struct AAthenaGameState : AServiceProviderGameState {
	char UnknownData_540[0x78]; // 0x540(0x78)
	struct AWindService* WindService; // 0x5b8(0x08)
	struct APlayerManagerService* PlayerManagerService; // 0x5c0(0x08)
	struct AShipService* ShipService; // 0x5c8(0x08)
	struct AWatercraftService* WatercraftService; // 0x5d0(0x08)
	struct ATimeService* TimeService; // 0x5d8(0x08)
	struct UHealthCustomizationService* HealthService; // 0x5e0(0x08)
	struct UCustomWeatherService* CustomWeatherService; // 0x5e8(0x08)
	struct UCustomStatusesService* CustomStatusesService; // 0x5f0(0x08)
	struct AFFTWaterService* WaterService; // 0x5f8(0x08)
	struct AStormService* StormService; // 0x600(0x08)
	struct ACrewService* CrewService; // 0x608(0x08)
	struct ACaptainedSessionService* CaptainedSessionService; // 0x610(0x08)
	struct AContestZoneService* ContestZoneService; // 0x618(0x08)
	struct AIslandService* IslandService; // 0x620(0x08)
	struct ANPCService* NPCService; // 0x628(0x08)
	struct ASkellyFortService* SkellyFortService; // 0x630(0x08)
	struct ADeepSeaRegionService* DeepSeaRegionService; // 0x638(0x08)
	struct UAIActionSpotService* AIActionSpotService; // 0x640(0x08)
	struct AAIDioramaService* AIDioramaService; // 0x648(0x08)
	struct AAshenLordEncounterService* AshenLordEncounterService; // 0x650(0x08)
	struct AAggressiveGhostShipsEncounterService* AggressiveGhostShipsEncounterService; // 0x658(0x08)
	struct ATallTaleService* TallTaleService; // 0x660(0x08)
	struct AAIShipObstacleService* AIShipObstacleService; // 0x668(0x08)
	struct AAIShipService* AIShipService; // 0x670(0x08)
	struct AAITargetService* AITargetService; // 0x678(0x08)
	struct UShipLiveryCatalogueService* ShipLiveryCatalogueService; // 0x680(0x08)
	struct ADrawDebugService* DrawDebugService; // 0x688(0x08)
	struct AWorldEventZoneService* WorldEventZoneService; // 0x690(0x08)
	struct UWorldResourceRegistry* WorldResourceRegistry; // 0x698(0x08)
	struct AKrakenService* KrakenService; // 0x6a0(0x08)
	struct UPlayerNameService* PlayerNameService; // 0x6a8(0x08)
	struct ATinySharkService* TinySharkService; // 0x6b0(0x08)
	struct AProjectileService* ProjectileService; // 0x6b8(0x08)
	struct AProjectileHitRegService* ProjectileHitRegService; // 0x6c0(0x08)
	struct ULaunchableProjectileService* LaunchableProjectileService; // 0x6c8(0x08)
	struct UServerNotificationsService* ServerNotificationsService; // 0x6d0(0x08)
	struct AAIManagerService* AIManagerService; // 0x6d8(0x08)
	struct AAIEncounterService* AIEncounterService; // 0x6e0(0x08)
	struct AAIEncounterGenerationService* AIEncounterGenerationService; // 0x6e8(0x08)
	struct UEncounterService* EncounterService; // 0x6f0(0x08)
	struct UGameEventSchedulerService* GameEventSchedulerService; // 0x6f8(0x08)
	struct UGameEventsOnDemandAvailabilityService* GameEventsOnDemandAvailabilityService; // 0x700(0x08)
	struct UHideoutService* HideoutService; // 0x708(0x08)
	struct UAthenaStreamedLevelService* StreamedLevelService; // 0x710(0x08)
	struct ULocationProviderService* LocationProviderService; // 0x718(0x08)
	struct AHoleService* HoleService; // 0x720(0x08)
	struct APlayerBuriedItemService* PlayerBuriedItemService; // 0x728(0x08)
	struct ULoadoutService* LoadoutService; // 0x730(0x08)
	struct UOcclusionService* OcclusionService; // 0x738(0x08)
	struct UPetsService* PetsService; // 0x740(0x08)
	struct UAthenaAITeamsService* AthenaAITeamsService; // 0x748(0x08)
	struct AAllianceService* AllianceService; // 0x750(0x08)
	struct UMaterialAccessibilityService* MaterialAccessibilityService; // 0x758(0x08)
	struct UNPCLoadedOnClientService* NPCLoadedOnClientService; // 0x760(0x08)
	struct AReapersMarkService* ReapersMarkService; // 0x768(0x08)
	struct AEmissaryLevelService* EmissaryLevelService; // 0x770(0x08)
	struct AFactionService* FactionService; // 0x778(0x08)
	struct ACampaignService* CampaignService; // 0x780(0x08)
	struct AStoryService* StoryService; // 0x788(0x08)
	struct AStorySpawnedActorsService* StorySpawnedActorsService; // 0x790(0x08)
	struct AStoryClaimedResourcesService* StoryClaimedResourcesService; // 0x798(0x08)
	struct UGlobalVoyageDirectorService* GlobalVoyageDirector; // 0x7a0(0x08)
	struct UUtilityVoyageService* UtilityVoyageService; // 0x7a8(0x08)
	struct AFlamesOfFateSettingsService* FlamesOfFateSettingsService; // 0x7b0(0x08)
	struct AServiceStatusNotificationsService* ServiceStatusNotificationsService; // 0x7b8(0x08)
	struct UMigrationService* MigrationService; // 0x7c0(0x08)
	struct UShipStockService* ShipStockService; // 0x7c8(0x08)
	struct AShroudBreakerService* ShroudBreakerService; // 0x7d0(0x08)
	struct UServerUpdateReportingService* ServerUpdateReportingService; // 0x7d8(0x08)
	struct AGenericMarkerService* GenericMarkerService; // 0x7e0(0x08)
	struct AMechanismsService* MechanismsService; // 0x7e8(0x08)
	struct UMerchantContractsService* MerchantContractsService; // 0x7f0(0x08)
	struct UShipFactory* ShipFactory; // 0x7f8(0x08)
	struct URewindPhysicsService* RewindPhysicsService; // 0x800(0x08)
	struct UNotificationMessagesDataAsset* NotificationMessagesDataAsset; // 0x808(0x08)
	struct AProjectileCooldownService* ProjectileCooldownService; // 0x810(0x08)
	struct UIslandReservationService* IslandReservationService; // 0x818(0x08)
	struct APortalService* PortalService; // 0x820(0x08)
	struct UMeshMemoryConstraintService* MeshMemoryConstraintService; // 0x828(0x08)
	struct ABootyStorageService* BootyStorageService; // 0x830(0x08)
	struct ALoadoutCostService* LoadoutCostService; // 0x838(0x08)
	struct ASpireService* SpireService; // 0x840(0x08)
	struct AFireworkService* FireworkService; // 0x848(0x08)
	struct AInvasionService* InvasionService; // 0x850(0x08)
	struct UAirGivingService* AirGivingService; // 0x858(0x08)
	struct UCutsceneService* CutsceneService; // 0x860(0x08)
	struct ACargoRunService* CargoRunService; // 0x868(0x08)
	struct ACommodityDemandService* CommodityDemandService; // 0x870(0x08)
	struct ADebugTeleportationDestinationService* DebugTeleportationDestinationService; // 0x878(0x08)
	struct ASeasonProgressionUIService* SeasonProgressionUIService; // 0x880(0x08)
	struct UTransientActorService* TransientActorService; // 0x888(0x08)
	struct ATunnelsOfTheDamnedService* TunnelsOfTheDamnedService; // 0x890(0x08)
	struct UWorldSequenceService* WorldSequenceService; // 0x898(0x08)
	struct UItemLifetimeManagerService* ItemLifetimeManagerService; // 0x8a0(0x08)
	struct AShipStorageJettisonService* ShipStorageJettisonService; // 0x8a8(0x08)
	struct ASeaFortsService* SeaFortsService; // 0x8b0(0x08)
	struct ACustomServerLocalisationService* CustomServerLocalisationService; // 0x8b8(0x08)
	struct ABeckonService* BeckonService; // 0x8c0(0x08)
	struct UVolcanoService* VolcanoService; // 0x8c8(0x08)
	struct UShipAnnouncementService* ShipAnnouncementService; // 0x8d0(0x08)
	struct AShipsLogService* ShipsLogService; // 0x8d8(0x08)
	struct UAsyncLoadingMonitoringService* AsyncLoadingMonitoringService; // 0x8e0(0x08)
	struct AActorOfInterestService* ActorOfInterestService; // 0x8e8(0x08)
	struct AEnemyAIOnShipService* EnemyAIOnShipService; // 0x8f0(0x08)
	struct AUserSettingsService* UserSettingsService; // 0x8f8(0x08)
	struct AGuildService* GuildService; // 0x900(0x08)
	struct UGuildChroniclesService* GuildChroniclesService; // 0x908(0x08)
	struct APlayerLootMarkerService* PlayerLootMarkerService; // 0x910(0x08)
	struct AAdventureOnDemandService* AdventureOnDemandService; // 0x918(0x08)
	char UnknownData_920[0x1c0]; // 0x920(0x1c0)
	struct FGameServiceCoordinator ServiceCoordinator; // 0xae0(0x20)
	char UnknownData_B00[0x28]; // 0xb00(0x28)
	struct TArray<TScriptInterface<struct UVoiceChatEmitterInterface>> ChatComponents; // 0xb28(0x10)
	char UnknownData_B38[0x98]; // 0xb38(0x98)
	bool IsXboxGamePadOnlyServer; // 0xbd0(0x01)
	bool ShouldDisableAsyncOcclusionCheck; // 0xbd1(0x01)
	char UnknownData_BD2[0x6]; // 0xbd2(0x06)
	struct FString SubPlayMode; // 0xbd8(0x10)
	struct UCustomVaultService* CustomVaultService; // 0xbe8(0x08)
	struct UEntityEnumerationService* EntityEnumerationService; // 0xbf0(0x08)
	struct ULevelAssetCachingService* LevelAssetCachingService; // 0xbf8(0x08)
	struct UCrewSkillRatingService* CrewSkillRatingService; // 0xc00(0x08)
	char UnknownData_C08[0x18]; // 0xc08(0x18)

	void OnRep_TunnelsOfTheDamnedService(); // Function Athena.AthenaGameState.OnRep_TunnelsOfTheDamnedService // Final|Native|Private // @ game+0xd0c950
	void OnRep_SubPlayMode(); // Function Athena.AthenaGameState.OnRep_SubPlayMode // Final|Native|Private // @ game+0xd0c930
	void OnRep_StoryService(); // Function Athena.AthenaGameState.OnRep_StoryService // Final|Native|Private // @ game+0xd0c8f0
	void OnRep_ShouldDisableAsyncOcclusionCheck(); // Function Athena.AthenaGameState.OnRep_ShouldDisableAsyncOcclusionCheck // Final|Native|Private // @ game+0xd0c890
	void OnRep_ServiceStatusNotificationsService(); // Function Athena.AthenaGameState.OnRep_ServiceStatusNotificationsService // Final|Native|Public // @ game+0xd0c870
	void OnRep_ReplicatedWindService(); // Function Athena.AthenaGameState.OnRep_ReplicatedWindService // Final|Native|Private // @ game+0xd0c810
	void OnRep_ReplicatedWaterService(); // Function Athena.AthenaGameState.OnRep_ReplicatedWaterService // Final|Native|Private // @ game+0xd0c7d0
	void OnRep_ReplicatedWatercraftService(); // Function Athena.AthenaGameState.OnRep_ReplicatedWatercraftService // Final|Native|Private // @ game+0xd0c7f0
	void OnRep_ReplicatedUserSettingsService(); // Function Athena.AthenaGameState.OnRep_ReplicatedUserSettingsService // Final|Native|Private // @ game+0xd0c7b0
	void OnRep_ReplicatedTinySharkService(); // Function Athena.AthenaGameState.OnRep_ReplicatedTinySharkService // Final|Native|Private // @ game+0xd0c790
	void OnRep_ReplicatedTimeService(); // Function Athena.AthenaGameState.OnRep_ReplicatedTimeService // Final|Native|Private // @ game+0xd0c770
	void OnRep_ReplicatedTallTaleService(); // Function Athena.AthenaGameState.OnRep_ReplicatedTallTaleService // Final|Native|Private // @ game+0xd0c750
	void OnRep_ReplicatedStormService(); // Function Athena.AthenaGameState.OnRep_ReplicatedStormService // Final|Native|Private // @ game+0xd0c730
	void OnRep_ReplicatedSpireService(); // Function Athena.AthenaGameState.OnRep_ReplicatedSpireService // Final|Native|Private // @ game+0xd0c710
	void OnRep_ReplicatedShipService(); // Function Athena.AthenaGameState.OnRep_ReplicatedShipService // Final|Native|Private // @ game+0xd0c6f0
	void OnRep_ReplicatedProjectileHitRegService(); // Function Athena.AthenaGameState.OnRep_ReplicatedProjectileHitRegService // Final|Native|Private // @ game+0xd0c6d0
	void OnRep_ReplicatedPlayerManagerService(); // Function Athena.AthenaGameState.OnRep_ReplicatedPlayerManagerService // Final|Native|Private // @ game+0xd0c6b0
	void OnRep_ReplicatedPlayerBuriedItemService(); // Function Athena.AthenaGameState.OnRep_ReplicatedPlayerBuriedItemService // Final|Native|Private // @ game+0xd0c690
	void OnRep_ReplicatedNPCService(); // Function Athena.AthenaGameState.OnRep_ReplicatedNPCService // Final|Native|Private // @ game+0xd0c670
	void OnRep_ReplicatedLoadoutCostService(); // Function Athena.AthenaGameState.OnRep_ReplicatedLoadoutCostService // Final|Native|Private // @ game+0xd0c650
	void OnRep_ReplicatedKrakenService(); // Function Athena.AthenaGameState.OnRep_ReplicatedKrakenService // Final|Native|Private // @ game+0xd0c630
	void OnRep_ReplicatedIslandService(); // Function Athena.AthenaGameState.OnRep_ReplicatedIslandService // Final|Native|Private // @ game+0xd0c610
	void OnRep_ReplicatedInvasionService(); // Function Athena.AthenaGameState.OnRep_ReplicatedInvasionService // Final|Native|Private // @ game+0xd0c5d0
	void OnRep_ReplicatedGuildService(); // Function Athena.AthenaGameState.OnRep_ReplicatedGuildService // Final|Native|Private // @ game+0xd0c5b0
	void OnRep_ReplicatedFireworkService(); // Function Athena.AthenaGameState.OnRep_ReplicatedFireworkService // Final|Native|Private // @ game+0xd0c590
	void OnRep_ReplicatedFactionService(); // Function Athena.AthenaGameState.OnRep_ReplicatedFactionService // Final|Native|Private // @ game+0xd0c570
	void OnRep_ReplicatedEnemyAIOnShipService(); // Function Athena.AthenaGameState.OnRep_ReplicatedEnemyAIOnShipService // Final|Native|Private // @ game+0xd0c550
	void OnRep_ReplicatedDrawDebugService(); // Function Athena.AthenaGameState.OnRep_ReplicatedDrawDebugService // Final|Native|Private // @ game+0xd0c530
	void OnRep_ReplicatedCrewService(); // Function Athena.AthenaGameState.OnRep_ReplicatedCrewService // Final|Native|Private // @ game+0xd0c510
	void OnRep_ReplicatedContestZoneService(); // Function Athena.AthenaGameState.OnRep_ReplicatedContestZoneService // Final|Native|Private // @ game+0xd0c4f0
	void OnRep_ReplicatedCaptainedSessionService(); // Function Athena.AthenaGameState.OnRep_ReplicatedCaptainedSessionService // Final|Native|Private // @ game+0xd0c4d0
	void OnRep_ReplicatedBootyStorageService(); // Function Athena.AthenaGameState.OnRep_ReplicatedBootyStorageService // Final|Native|Private // @ game+0xd0c4b0
	void OnRep_ReplicatedAllianceService(); // Function Athena.AthenaGameState.OnRep_ReplicatedAllianceService // Final|Native|Private // @ game+0xd0c490
	void OnRep_IsXboxGamePadOnlyServer(); // Function Athena.AthenaGameState.OnRep_IsXboxGamePadOnlyServer // Final|Native|Private // @ game+0xd0c330
	void OnRep_GenericMarkerService(); // Function Athena.AthenaGameState.OnRep_GenericMarkerService // Final|Native|Private // @ game+0xd0c2f0
	void OnRep_DebugTeleportationDestinationService(); // Function Athena.AthenaGameState.OnRep_DebugTeleportationDestinationService // Final|Native|Private // @ game+0xd0c2d0
	void OnRep_CustomServerLocalisationService(); // Function Athena.AthenaGameState.OnRep_CustomServerLocalisationService // Final|Native|Private // @ game+0xd0c220
	void OnRep_CommodityDemandService(); // Function Athena.AthenaGameState.OnRep_CommodityDemandService // Final|Native|Private // @ game+0xd0bff0
	void OnRep_CargoRunService(); // Function Athena.AthenaGameState.OnRep_CargoRunService // Final|Native|Private // @ game+0xd0bfd0
	void OnRep_CampaignService(); // Function Athena.AthenaGameState.OnRep_CampaignService // Final|Native|Private // @ game+0xd0bfb0
	void OnRep_AdventureOnDemandService(); // Function Athena.AthenaGameState.OnRep_AdventureOnDemandService // Final|Native|Private // @ game+0xd0bf30
};

// Class Athena.AthenaGameUserSettings
// Size: 0xb8 (Inherited: 0x78)
struct UAthenaGameUserSettings : UGameUserSettings {
	int32_t MaxVerticalResolution; // 0x78(0x04)
	int32_t MaxFPS; // 0x7c(0x04)
	int32_t VSync; // 0x80(0x04)
	int32_t LightingDetail; // 0x84(0x04)
	int32_t ModelDetail; // 0x88(0x04)
	int32_t ShadowDetail; // 0x8c(0x04)
	int32_t TextureDetail; // 0x90(0x04)
	int32_t WaterDetail; // 0x94(0x04)
	int32_t AnimationQuality; // 0x98(0x04)
	int32_t MMCThresholdScale; // 0x9c(0x04)
	float ResolutionScaling; // 0xa0(0x04)
	int32_t ParticleEmitterQuality; // 0xa4(0x04)
	int32_t ParticleResolutionQuality; // 0xa8(0x04)
	int32_t BackBufferCount; // 0xac(0x04)
	int32_t ShowPerformanceCounters; // 0xb0(0x04)
	bool SmoothFPS; // 0xb4(0x01)
	bool HDR; // 0xb5(0x01)
	bool AudioOutputSpatialAudio; // 0xb6(0x01)
	bool Fullscreen; // 0xb7(0x01)
};

// Class Athena.AthenaGameViewportClient
// Size: 0x260 (Inherited: 0x250)
struct UAthenaGameViewportClient : UGameViewportClient {
	char UnknownData_250[0x10]; // 0x250(0x10)
};

// Class Athena.AthenaLocalPlayerManager
// Size: 0x340 (Inherited: 0x28)
struct UAthenaLocalPlayerManager : UObject {
	char UnknownData_28[0x318]; // 0x28(0x318)
};

// Class Athena.AthenaLocalPlayerReengage
// Size: 0x178 (Inherited: 0x28)
struct UAthenaLocalPlayerReengage : UObject {
	char UnknownData_28[0x150]; // 0x28(0x150)
};

// Class Athena.AthenaPlayerCharacterTestFunctions
// Size: 0x28 (Inherited: 0x28)
struct UAthenaPlayerCharacterTestFunctions : UBlueprintFunctionLibrary {

	void ForceShipRegion(struct AAthenaPlayerCharacter* AthenaPlayerCharacter, char ShipRegion); // Function Athena.AthenaPlayerCharacterTestFunctions.ForceShipRegion // Final|Native|Static|Public|BlueprintCallable // @ game+0xd067e0
	void ForceReCalculateShipRegion(struct AAthenaPlayerCharacter* AthenaPlayerCharacter); // Function Athena.AthenaPlayerCharacterTestFunctions.ForceReCalculateShipRegion // Final|Native|Static|Public|BlueprintCallable // @ game+0xd06770
	void DisableStatusResponse(struct AAthenaPlayerCharacter* AthenaPlayerCharacter, struct UClass* StatusResponseClass); // Function Athena.AthenaPlayerCharacterTestFunctions.DisableStatusResponse // Final|Native|Static|Public|BlueprintCallable // @ game+0xd063d0
};

// Class Athena.CharacterAnimaticSettingsInterface
// Size: 0x28 (Inherited: 0x28)
struct UCharacterAnimaticSettingsInterface : UInterface {
};

// Class Athena.CharacterAnimaticSettingsComponent
// Size: 0x140 (Inherited: 0xc8)
struct UCharacterAnimaticSettingsComponent : UActorComponent {
	char UnknownData_C8[0x70]; // 0xc8(0x70)
	bool HasPlayedWakeUpAnimation; // 0x138(0x01)
	char UnknownData_139[0x7]; // 0x139(0x07)
};

// Class Athena.AthenaPlayerState
// Size: 0x800 (Inherited: 0x450)
struct AAthenaPlayerState : APlayerState {
	char UnknownData_450[0x48]; // 0x450(0x48)
	struct UVoiceChatComponent* VoiceChatComponent; // 0x498(0x08)
	char UnknownData_4A0[0x58]; // 0x4a0(0x58)
	struct FString Sandbox; // 0x4f8(0x10)
	struct FString ClientPlatform; // 0x508(0x10)
	struct FString DeviceID; // 0x518(0x10)
	struct FPirateIdentity PirateIdentity; // 0x528(0x78)
	char UnknownData_5A0[0xa0]; // 0x5a0(0xa0)
	struct FGuid PlayerGameId; // 0x640(0x10)
	struct FPirateDescription PirateDesc; // 0x650(0x80)
	int32_t PlayerIndexOnServer; // 0x6d0(0x04)
	char UnknownData_6D4[0x3c]; // 0x6d4(0x3c)
	struct FString PlayerNameDebug; // 0x710(0x10)
	char PlayerActivity; // 0x720(0x01)
	char UnknownData_721[0xdf]; // 0x721(0xdf)

	void OnRep_PlayerIndexOnServer(); // Function Athena.AthenaPlayerState.OnRep_PlayerIndexOnServer // Final|Native|Private // @ game+0xd0c430
	struct FString GetUniquePlayerId(); // Function Athena.AthenaPlayerState.GetUniquePlayerId // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd0a190
	char GetPlayerActivity(); // Function Athena.AthenaPlayerState.GetPlayerActivity // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09b20
	struct FPirateDescription GetPirateDescCopy(); // Function Athena.AthenaPlayerState.GetPirateDescCopy // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09ac0
	struct FPirateDescription GetPirateDesc(); // Function Athena.AthenaPlayerState.GetPirateDesc // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd09a80
	struct FString GetHumanReadableName(); // Function Athena.AthenaPlayerState.GetHumanReadableName // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xd07a20
};

// Class Athena.VoyageRecipeDataAsset
// Size: 0x180 (Inherited: 0x28)
struct UVoyageRecipeDataAsset : UDataAsset {
	struct FVoyageRecipe Recipe; // 0x28(0x150)
	bool IsVoyageLocationBound; // 0x178(0x01)
	char UnknownData_179[0x7]; // 0x179(0x07)
};

// Class Athena.EmergentContestVoyageRecipeDataAsset
// Size: 0x348 (Inherited: 0x180)
struct UEmergentContestVoyageRecipeDataAsset : UVoyageRecipeDataAsset {
	struct FEmergentContestVoyageRecipe ContestVoyageRecipe; // 0x180(0x1c8)
};

// Class Athena.VoyageDescDataAsset
// Size: 0x180 (Inherited: 0x28)
struct UVoyageDescDataAsset : UDataAsset {
	struct TArray<struct FChapterQuests> Chapters; // 0x28(0x10)
	struct TArray<struct FFeatureToggledChapters> FeatureToggledChapters; // 0x38(0x10)
	struct FText Title; // 0x48(0x38)
	struct FText Description; // 0x80(0x38)
	struct FText LockedDescription; // 0xb8(0x38)
	struct FStringAssetReference KeyArtUrl; // 0xf0(0x10)
	struct FStringAssetReference IconUrl; // 0x100(0x10)
	struct UClass* Company; // 0x110(0x08)
	bool IsEmergent; // 0x118(0x01)
	bool IsTale; // 0x119(0x01)
	bool IsStarlightTale; // 0x11a(0x01)
	bool IsUtilityVoyage; // 0x11b(0x01)
	bool IsAdventure; // 0x11c(0x01)
	bool IsCrossWorld; // 0x11d(0x01)
	bool IsAthenaVoyage2; // 0x11e(0x01)
	bool IsConsumableQuestTableVoyage; // 0x11f(0x01)
	struct FViewVoyageBanners ViewVoyageBanners; // 0x120(0x03)
	bool DoNotNotifyParticipantsOnVoyageComplete; // 0x123(0x01)
	bool DoNotNotifyParticipantsOfQuestPages; // 0x124(0x01)
	char UnknownData_125[0x3]; // 0x125(0x03)
	int32_t Rank; // 0x128(0x04)
	char UnknownData_12C[0x4]; // 0x12c(0x04)
	struct TArray<struct FPlayerStat> VoyageCompletionStats; // 0x130(0x10)
	struct TArray<struct FPlayerStat> ReapersMarkCompletionStats; // 0x140(0x10)
	struct TArray<struct FVoyageCompletionReward> VoyageCompletionRewards; // 0x150(0x10)
	struct FName CampaignId; // 0x160(0x08)
	struct FStringAssetReference TaleCancelVoteMesh; // 0x168(0x10)
	char EmergentSource; // 0x178(0x01)
	char UnknownData_179[0x7]; // 0x179(0x07)
};

// Class Athena.TallTaleContestRecipeDataAsset
// Size: 0x1c8 (Inherited: 0x180)
struct UTallTaleContestRecipeDataAsset : UVoyageDescDataAsset {
	struct FContestZoneDistribution WeightedContestZonesToActivate; // 0x180(0x10)
	struct TArray<struct FContestIslandArchetype> AvailableIslandArchetypes; // 0x190(0x10)
	struct FContestTimerData ContestVoyageTime; // 0x1a0(0x18)
	struct FStringClassReference ScoreSystemToLoad; // 0x1b8(0x10)
};

// Class Athena.ContestManagerServiceInterface
// Size: 0x28 (Inherited: 0x28)
struct UContestManagerServiceInterface : UInterface {
};

// Class Athena.UIResponceComponent
// Size: 0x168 (Inherited: 0xc8)
struct UUIResponceComponent : UActorComponent {
	struct AAthenaPlayerController* OwningPlayerController; // 0xc8(0x08)
	char UnknownData_D0[0x98]; // 0xd0(0x98)
};

// Class Athena.PlayerTelemetryComponent
// Size: 0x2b0 (Inherited: 0xc8)
struct UPlayerTelemetryComponent : UActorComponent {
	char UnknownData_C8[0x64]; // 0xc8(0x64)
	float HeartbeatInterval; // 0x12c(0x04)
	char UnknownData_130[0x150]; // 0x130(0x150)
	struct FDateTime SpawnTimestamp; // 0x280(0x08)
	char UnknownData_288[0x28]; // 0x288(0x28)
};

// Class Athena.IslandEventType
// Size: 0x48 (Inherited: 0x28)
struct UIslandEventType : UObject {
	struct FIslandEventIcons IslandIcons; // 0x28(0x10)
	struct FIslandEventIcons HeaderIcons; // 0x38(0x10)
};

// Class Athena.TallTaleIslandEventType
// Size: 0x48 (Inherited: 0x48)
struct UTallTaleIslandEventType : UIslandEventType {
};

// Class Athena.MapTableCanvasDataAsset
// Size: 0x58 (Inherited: 0x28)
struct UMapTableCanvasDataAsset : UDataAsset {
	struct FMapTableCanvasDetails CanvasDetails; // 0x28(0x30)
};

// Class Athena.IslandEventHUDData
// Size: 0x90 (Inherited: 0x28)
struct UIslandEventHUDData : UDataAsset {
	struct TArray<struct UClass*> EventTypes; // 0x28(0x10)
	struct FVector2D IslandIconSize; // 0x38(0x08)
	struct FVector2D HeaderIconSize; // 0x40(0x08)
	float HeaderYOffset; // 0x48(0x04)
	float TriggerLerpAtZoomLevel; // 0x4c(0x04)
	struct FCanvasLerpData LerpData; // 0x50(0x10)
	struct FCanvasLerpData HighlightLerpData; // 0x60(0x10)
	struct FCanvasLerpData FadeInOutData; // 0x70(0x10)
	float MarkerHighlightRadiusAdjuster; // 0x80(0x04)
	struct FVector2D MarkerHighlightCentreOffset; // 0x84(0x08)
	float MarkerHighlightScale; // 0x8c(0x04)
};

// Class Athena.IslandEventTrackerComponent
// Size: 0x158 (Inherited: 0xc8)
struct UIslandEventTrackerComponent : UActorComponent {
	struct TArray<struct FIslandEventData> EventData; // 0xc8(0x10)
	char UnknownData_D8[0x80]; // 0xd8(0x80)

	void OnRep_EventData(); // Function Athena.IslandEventTrackerComponent.OnRep_EventData // Final|Native|Private // @ game+0xe05ed0
};

// Class Athena.IslandEventTrackerInterface
// Size: 0x28 (Inherited: 0x28)
struct UIslandEventTrackerInterface : UInterface {
};

// Class Athena.AthenaPlayerController
// Size: 0x1728 (Inherited: 0x770)
struct AAthenaPlayerController : APlayerController {
	char UnknownData_770[0x80]; // 0x770(0x80)
	struct UPioneerComponent* PioneerComponent; // 0x7f0(0x08)
	struct UPlayerPermissionsComponent* PlayerPermissionsComponent; // 0x7f8(0x08)
	struct UPlayerTelemetryComponent* PlayerTelemetryComponent; // 0x800(0x08)
	struct UPlayerStatsComponent* PlayerStatsComponent; // 0x808(0x08)
	struct UPlayerSeasonProgressionComponent* PlayerSeasonProgressionComponent; // 0x810(0x08)
	struct UPlayerHeroStatsComponent* PlayerHeroStatsComponent; // 0x818(0x08)
	struct UPlayerWalletComponent* PlayerWalletComponent; // 0x820(0x08)
	struct UBoxedRpcDispatcherComponent* BoxedRpcDispatcherComponent; // 0x828(0x08)
	struct UPlayerEntitlementComponent* PlayerEntitlementComponent; // 0x830(0x08)
	struct UPlayerMigratableStatusComponent* PlayerMigratableStatusComponent; // 0x838(0x08)
	struct UEmblemComponent* EmblemComponent; // 0x840(0x08)
	struct UPlayerCompanyComponent* PlayerCompanyComponent; // 0x848(0x08)
	struct ULeaderboardComponent* LeaderboardComponent; // 0x850(0x08)
	struct URewardComponent* RewardComponent; // 0x858(0x08)
	struct UPlayerNonVerbalComponent* PlayerNonVerbalComponent; // 0x860(0x08)
	struct UPlayerCrewComponent* PlayerCrewComponent; // 0x868(0x08)
	struct UPlayerMuteComponent* PlayerMuteComponent; // 0x870(0x08)
	struct UUIResponceComponent* PlayerUIReturnedResponceComponent; // 0x878(0x08)
	struct UPopUpNotificationComponent* PopUpNotificationComponent; // 0x880(0x08)
	struct UEncounterListenerComponent* EncounterListenerComponent; // 0x888(0x08)
	struct UCharacterAnimaticSettingsComponent* CharacterAnimaticSettingsComponent; // 0x890(0x08)
	struct UAthenaTutorialComponent* TutorialComponent; // 0x898(0x08)
	struct UContextualTutorialComponent* ContextualTutorialComponent; // 0x8a0(0x08)
	struct UShantySelectionComponent* ShantySelectionComponent; // 0x8a8(0x08)
	struct UTutorialManager* TutorialManagerComponent; // 0x8b0(0x08)
	struct UEmissaryActionRewardBoostComponent* EmissaryActionRewardBoostComponent; // 0x8b8(0x08)
	struct UPlayerMysteriousNoteComponent* PlayerMysteriousNoteComponent; // 0x8c0(0x08)
	struct UEmissaryParticipantComponent* EmissaryParticipantComponent; // 0x8c8(0x08)
	struct UCommodityPurchaseTrackingComponent* CommodityPurchaseTrackingComponent; // 0x8d0(0x08)
	struct UPlayerActivityComponent* PlayerActivityComponent; // 0x8d8(0x08)
	struct UIslandEventTrackerComponent* IslandEventTrackerComponent; // 0x8e0(0x08)
	struct UCampaignComponent* CampaignComponent; // 0x8e8(0x08)
	struct UTaleQuestQueryableStatesAccessComponent* TaleQuestQueryableStatesAccessComponent; // 0x8f0(0x08)
	struct UAudioReportingComponent* AudioReportingComponent; // 0x8f8(0x08)
	float InputRawYawScale; // 0x900(0x04)
	float InputRawPitchScale; // 0x904(0x04)
	struct FInventoryMemory InventoryMemory; // 0x908(0x50)
	struct ACinematicCameraController* CinematicCameraController; // 0x958(0x08)
	char UnknownData_960[0xc10]; // 0x960(0xc10)
	struct FGuid ClientSessionId; // 0x1570(0x10)
	char UnknownData_1580[0x10]; // 0x1580(0x10)
	uint32_t MigratedPossessCount; // 0x1590(0x04)
	char UnknownData_1594[0x64]; // 0x1594(0x64)
	struct UPromptsLocalService* PromptsLocalService; // 0x15f8(0x08)
	struct UCurveFloat* AutoCentreCurve; // 0x1600(0x08)
	char UnknownData_1608[0x40]; // 0x1608(0x40)
	struct FVector CinematicCameraControllerLocation; // 0x1648(0x0c)
	struct FRotator CinematicCameraControllerRotation; // 0x1654(0x0c)
	struct FPirateIdentity PirateIdentity; // 0x1660(0x78)
	char DeathFlameOfFateType; // 0x16d8(0x01)
	char FlameOfFateType; // 0x16d9(0x01)
	char UnknownData_16DA[0x6]; // 0x16da(0x06)
	struct AIndividualReplicationChannel* IndividualReplicationChannel; // 0x16e0(0x08)
	char UnknownData_16E8[0x18]; // 0x16e8(0x18)
	struct FString DebugServerMigrationEndpoint; // 0x1700(0x10)
	char UnknownData_1710[0x18]; // 0x1710(0x18)

	void Server_ReportPlayerDelta(struct FVector InVector); // Function Athena.AthenaPlayerController.Server_ReportPlayerDelta // Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|NetValidate // @ game+0xe07d50
	void Server_ReportPerformanceMetrics(struct TArray<char> InData); // Function Athena.AthenaPlayerController.Server_ReportPerformanceMetrics // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xe07c90
	void Server_NotifyPlayEnd(int32_t InX, int32_t InY); // Function Athena.AthenaPlayerController.Server_NotifyPlayEnd // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0xe07a70
	void Server_ExecuteCommand(struct FString Command); // Function Athena.AthenaPlayerController.Server_ExecuteCommand // Net|NetReliableNative|Event|Protected|NetServer|NetValidate // @ game+0xe07780
	void OnRep_PirateIdentity(); // Function Athena.AthenaPlayerController.OnRep_PirateIdentity // Final|Native|Private // @ game+0xe060e0
	bool IsPirateLegend(); // Function Athena.AthenaPlayerController.IsPirateLegend // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xe03fe0
	bool GetPlayerStreamingReferenceLocation(struct FVector Location); // Function Athena.AthenaPlayerController.GetPlayerStreamingReferenceLocation // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xe03170
	struct UAthenaCheatManager* GetAthenaCheatManager(); // Function Athena.AthenaPlayerController.GetAthenaCheatManager // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xe024f0
	void EOS(struct FString Command); // Function Athena.AthenaPlayerController.EOS // Final|Exec|Native|Public // @ game+0xe012f0
	void EnableAutoStrafe(bool InEnabled); // Function Athena.AthenaPlayerController.EnableAutoStrafe // Final|Exec|Native|Public // @ game+0xe01390
	void AddYawRotationInput(float Input, char RotationType); // Function Athena.AthenaPlayerController.AddYawRotationInput // Final|Native|Public|BlueprintCallable // @ game+0xe000d0
	void AddPitchRotationInput(float Input, char RotationType); // Function Athena.AthenaPlayerController.AddPitchRotationInput // Final|Native|Public|BlueprintCallable // @ game+0xe00010
};

// Class Athena.OnlineAthenaPlayerController
// Size: 0x1810 (Inherited: 0x1728)
struct AOnlineAthenaPlayerController : AAthenaPlayerController {
	char UnknownData_1728[0x8]; // 0x1728(0x08)
	struct FMysteriousNotesCompletionEventsModelEntry LogoutNoteCompletionIdent; // 0x1730(0x08)
	char UnknownData_1738[0x19]; // 0x1738(0x19)
	bool IdleDisconnectEnabled; // 0x1751(0x01)
	char UnknownData_1752[0xbe]; // 0x1752(0xbe)

	void ModifyActiveState(bool IsActive); // Function Athena.OnlineAthenaPlayerController.ModifyActiveState // Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate // @ game+0xe04640
	bool IsClientAndInActiveGameplay(); // Function Athena.OnlineAthenaPlayerController.IsClientAndInActiveGameplay // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xe03df0
};

// Class Athena.TestAthenaPlayerController
// Size: 0x1768 (Inherited: 0x1728)
struct ATestAthenaPlayerController : AAthenaPlayerController {
	struct UForceFeedbackEffect* LastReceivedForceFeedbackEffect; // 0x1728(0x08)
	char UnknownData_1730[0x38]; // 0x1730(0x38)

	void TestConsoleExecutableFunction(); // Function Athena.TestAthenaPlayerController.TestConsoleExecutableFunction // Final|Exec|Native|Public // @ game+0xe0a630
	void GrantDebugMenuPermissions(bool AllowAccess); // Function Athena.TestAthenaPlayerController.GrantDebugMenuPermissions // Final|Native|Public|BlueprintCallable // @ game+0xe03c30
	void FakeInput(struct FKey Key); // Function Athena.TestAthenaPlayerController.FakeInput // Final|Native|Public|BlueprintCallable // @ game+0xe01910
	void FakeAxisInput(struct FKey Key, float Delta, float DeltaTime); // Function Athena.TestAthenaPlayerController.FakeAxisInput // Final|Native|Public|BlueprintCallable // @ game+0xe017a0
};

// Class Athena.TestAthenaPlayerControllerWithAthenaPlayerCameraManager
// Size: 0x1768 (Inherited: 0x1768)
struct ATestAthenaPlayerControllerWithAthenaPlayerCameraManager : ATestAthenaPlayerController {
};

// Class Athena.PlayerRelevancyServiceInterface
// Size: 0x28 (Inherited: 0x28)
struct UPlayerRelevancyServiceInterface : UInterface {
};

// Class Athena.TestPlayerRelevancyAthenaPlayerController
// Size: 0x1750 (Inherited: 0x1728)
struct ATestPlayerRelevancyAthenaPlayerController : AAthenaPlayerController {
	struct FMulticastDelegate OnQueryRelevancyCallback; // 0x1728(0x10)
	char UnknownData_1738[0x18]; // 0x1738(0x18)

	void QueryRelevancyService(float Timeout); // Function Athena.TestPlayerRelevancyAthenaPlayerController.QueryRelevancyService // Final|Native|Public|BlueprintCallable // @ game+0xe06bb0
};

// Class Athena.AthenaPlayerControllerTestFunctions
// Size: 0x28 (Inherited: 0x28)
struct UAthenaPlayerControllerTestFunctions : UBlueprintFunctionLibrary {

	void TestAthenaPlayerControllerDisableNormalInputHandling(struct AAthenaPlayerController* AthenaPlayerController); // Function Athena.AthenaPlayerControllerTestFunctions.TestAthenaPlayerControllerDisableNormalInputHandling // Final|Native|Static|Public|BlueprintCallable // @ game+0xe0a5c0
	void AddEntitlementDescToInventory(struct AAthenaPlayerController* Controller, struct UClass* EntitlementDesc); // Function Athena.AthenaPlayerControllerTestFunctions.AddEntitlementDescToInventory // Final|Native|Static|Public|BlueprintCallable // @ game+0xdffcb0
};

// Class Athena.TestAthenaPlayerState
// Size: 0x818 (Inherited: 0x800)
struct ATestAthenaPlayerState : AAthenaPlayerState {
	char UnknownData_800[0x18]; // 0x800(0x18)

	void SetUniquePlayerID(struct FString InUniquePlayerId); // Function Athena.TestAthenaPlayerState.SetUniquePlayerID // Final|Native|Public|BlueprintCallable // @ game+0xe089e0
};

// Class Athena.AthenaPlayerZonePenetrationTrackerComponent
// Size: 0x1c0 (Inherited: 0xc8)
struct UAthenaPlayerZonePenetrationTrackerComponent : UActorComponent {
	char UnknownData_C8[0x8]; // 0xc8(0x08)
	char OverlapType; // 0xd0(0x01)
	char UnknownData_D1[0x3]; // 0xd1(0x03)
	float UpdateInterval; // 0xd4(0x04)
	struct UShapeComponent* ShapeComponent; // 0xd8(0x08)
	struct TArray<struct AAthenaPlayerCharacter*> PlayersInZone; // 0xe0(0x10)
	char UnknownData_F0[0xd0]; // 0xf0(0xd0)

	void OnOverlapEnd(struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function Athena.AthenaPlayerZonePenetrationTrackerComponent.OnOverlapEnd // Final|Native|Private // @ game+0xe05a00
	void OnOverlapBegin(struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Athena.AthenaPlayerZonePenetrationTrackerComponent.OnOverlapBegin // Final|Native|Private|HasOutParms // @ game+0xe05730
};

// Class Athena.AthenaServerIdentityManager
// Size: 0x58 (Inherited: 0x28)
struct UAthenaServerIdentityManager : UObject {
	char UnknownData_28[0x30]; // 0x28(0x30)
};

// Class Athena.AthenaTextRender
// Size: 0x4a0 (Inherited: 0x3d8)
struct AAthenaTextRender : AStaticMeshActor {
	struct FText Text; // 0x3d8(0x38)
	struct FTreasureMapWidgetText TextDesc; // 0x410(0x3c)
	int32_t CanvasWidth; // 0x44c(0x04)
	int32_t CanvasHeight; // 0x450(0x04)
	char UnknownData_454[0x4]; // 0x454(0x04)
	struct UFont* Font; // 0x458(0x08)
	struct FVector2D FontScale; // 0x460(0x08)
	float FontLineSpacingScale; // 0x468(0x04)
	char UnknownData_46C[0xc]; // 0x46c(0x0c)
	struct UCanvasRenderTarget2D* AthenaTextRenderTarget; // 0x478(0x08)
	char UnknownData_480[0x20]; // 0x480(0x20)

	void OnTextCanvasUpdate(struct UCanvas* Canvas, int32_t Width, int32_t Height); // Function Athena.AthenaTextRender.OnTextCanvasUpdate // Final|Native|Private // @ game+0xe06720
};

// Class Athena.VoyageProposalDesc
// Size: 0x128 (Inherited: 0xc8)
struct UVoyageProposalDesc : UEntitlementDesc {
	struct UClass* TradingCompany; // 0xc8(0x08)
	int32_t Rank; // 0xd0(0x04)
	bool UseDifficultyAsRank; // 0xd4(0x01)
	bool UnlockedForAnyRank; // 0xd5(0x01)
	bool AvailableEvenIfRecentlySeen; // 0xd6(0x01)
	char UnknownData_D7[0x1]; // 0xd7(0x01)
	int32_t Difficulty; // 0xd8(0x04)
	char UnknownData_DC[0x4]; // 0xdc(0x04)
	struct FStringAssetReference TooltipBackgroundImageUrl; // 0xe0(0x10)
	struct UVoyageRecipeDataAsset* VoyageRecipe; // 0xf0(0x08)
	struct UVoyageDescDataAsset* VoyageDesc; // 0xf8(0x08)
	struct FStringAssetReference OverrideVotingTableVoyageProposalMesh; // 0x100(0x10)
	struct FStringAssetReference OverrideOpenVoyageProposalMesh; // 0x110(0x10)
	char UnknownData_120[0x8]; // 0x120(0x08)
};

// Class Athena.VoyageCheckpointProposalDesc
// Size: 0x130 (Inherited: 0x128)
struct UVoyageCheckpointProposalDesc : UVoyageProposalDesc {
	int32_t TaleIndex; // 0x128(0x04)
	bool DoConsumeOnUse; // 0x12c(0x01)
	bool DoCountAsInventoryVoyage; // 0x12d(0x01)
	char UnknownData_12E[0x2]; // 0x12e(0x02)
};

// Class Athena.WorldSafeRegion
// Size: 0x408 (Inherited: 0x400)
struct AWorldSafeRegion : ABlockingVolume {
	char UnknownData_400[0x1]; // 0x400(0x01)
	bool RequiresShroudBreaker; // 0x401(0x01)
	bool IsMainWorldSafeZone; // 0x402(0x01)
	char UnknownData_403[0x5]; // 0x403(0x05)
};

// Class Athena.AthenaWorldSettings
// Size: 0x748 (Inherited: 0x580)
struct AAthenaWorldSettings : AWorldSettings {
	char UnknownData_580[0x60]; // 0x580(0x60)
	struct FVector2D WorldMax; // 0x5e0(0x08)
	struct FVector2D WorldMapMin; // 0x5e8(0x08)
	struct FVector2D WorldMapMax; // 0x5f0(0x08)
	char UnknownData_5F8[0x4]; // 0x5f8(0x04)
	float AdventureDistanceFromWorldSafeRegionEdgeToKillZone; // 0x5fc(0x04)
	float ArenaDistanceFromWorldSafeRegionEdgeToKillZone; // 0x600(0x04)
	float EndOfWorldWarningOffset; // 0x604(0x04)
	char UnknownData_608[0x4]; // 0x608(0x04)
	float AdventureDistanceFromWorldSafeRegionEdgeToFullStrainAndLighting; // 0x60c(0x04)
	float ArenaDistanceFromWorldSafeRegionEdgeToFullStrainAndLighting; // 0x610(0x04)
	int32_t EndOfWorldWarningLightingIndex; // 0x614(0x04)
	struct UBuoyantObjectSpawnParamsDataAsset* BuoyantObjectSpawnParams; // 0x618(0x08)
	struct USeaFortsWorldDataAsset* SeaFortsData; // 0x620(0x08)
	struct USeaRockDataAsset* SeaRockLocations; // 0x628(0x08)
	struct FStringAssetReference TradeRoutes; // 0x630(0x10)
	struct TArray<struct FAthenaStreamedLevelItem> ManuallyStreamedLevels; // 0x640(0x10)
	struct UTunnelWorldConfig* TunnelWorldConfig; // 0x650(0x08)
	struct USpireStreamedLevelDataAsset* SpireLevels; // 0x658(0x08)
	struct FKrakenWorldSettingsParams KrakenParams; // 0x660(0x01)
	struct FTinySharkWorldSettingsParams TinySharkParams; // 0x661(0x01)
	char UnknownData_662[0x6]; // 0x662(0x06)
	struct FAIShipWorldSettings AIShipParams; // 0x668(0x18)
	struct UInvasionLocationsDataAsset* InvasionLocationsDataAsset; // 0x680(0x08)
	struct UIslandDataAsset* IslandDataAsset; // 0x688(0x08)
	struct UPrebakedIslandAsset* PrebakedIslandData; // 0x690(0x08)
	struct UMapTableCanvasDataAsset* MapTableCanvasData; // 0x698(0x08)
	struct UVoyageDescDataAsset* TutorialTale; // 0x6a0(0x08)
	struct UVoyageDescDataAsset* ScuttleShipVoyageDescAsset; // 0x6a8(0x08)
	float DevilsShroudPlayerDamageMaxDamage; // 0x6b0(0x04)
	bool AllowCompanyOnboardingTutorial; // 0x6b4(0x01)
	bool AllowContextualTutorial; // 0x6b5(0x01)
	bool ShowMapTable; // 0x6b6(0x01)
	bool UseDevDefinition; // 0x6b7(0x01)
	bool EnableGlobalVoyages; // 0x6b8(0x01)
	char UnknownData_6B9[0x7]; // 0x6b9(0x07)
	struct UGlobalVoyageOverrideAsset* GlobalVoyageOverrideAsset; // 0x6c0(0x08)
	struct TArray<struct UClass*> NPCOnBeachVoyageCheckpoints; // 0x6c8(0x10)
	bool UseGameEventSchedulerRemoteServices; // 0x6d8(0x01)
	char UnknownData_6D9[0x7]; // 0x6d9(0x07)
	struct UGameEventSchedulerSettingsAsset* DefaultGameEventSchedulerSettings; // 0x6e0(0x08)
	struct TArray<struct FAthenaWorldSettingsGameEventSchedulerSettingsConfiguration> GameEventSchedulerSettingsConfigurations; // 0x6e8(0x10)
	struct UStormServiceAsset* StormServiceSettings; // 0x6f8(0x08)
	struct TArray<struct FWorldSafeZone> SafeZonesIncludingRequiresShroudBreaker; // 0x700(0x10)
	struct TArray<struct FWorldSafeZone> SafeZonesExcludingRequiresShroudBreaker; // 0x710(0x10)
	struct TArray<struct FWorldSafeZone> MainWorldSafeZones; // 0x720(0x10)
	struct TArray<struct FWorldSafeZone> OverridingSafeZones; // 0x730(0x10)
	char UnknownData_740[0x8]; // 0x740(0x08)
};

// Class Athena.AtmosphericPressureService
// Size: 0x40 (Inherited: 0x28)
struct UAtmosphericPressureService : UObject {
	char UnknownData_28[0x8]; // 0x28(0x08)
	struct TArray<TScriptInterface<struct UAtmosphericPressureZoneInterface>> RegisteredAtmosphericPressureZones; // 0x30(0x10)
};

// Class Athena.AudioEmitterPoolSourceInterface
// Size: 0x28 (Inherited: 0x28)
struct UAudioEmitterPoolSourceInterface : UInterface {

	struct UWwiseObjectPoolWrapper* GetAudioEmitterPool(); // Function Athena.AudioEmitterPoolSourceInterface.GetAudioEmitterPool // Native|Public|BlueprintCallable // @ game+0xe02520
};

// Class Athena.AudioUtilities
// Size: 0x28 (Inherited: 0x28)
struct UAudioUtilities : UBlueprintFunctionLibrary {

	void UpdateCharacterWadingRtpc(struct AAthenaCharacter* AthenaCharacter, struct TArray<struct FWwiseEmitter> Emitters, struct FName WadingRtpcName, struct FName SquelchRtpcName, float MinRtpcValue, float MaxRtpcValue); // Function Athena.AudioUtilities.UpdateCharacterWadingRtpc // Final|Native|Static|Public|BlueprintCallable // @ game+0xe0a980
	bool IsPointInPolygon(struct FVector2D TestPoint, struct TArray<struct FVector2D> PolygonPoints); // Function Athena.AudioUtilities.IsPointInPolygon // Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xe040b0
	void FilterLocalPlayerFootStepSounds(char FootImpactType); // Function Athena.AudioUtilities.FilterLocalPlayerFootStepSounds // Final|Native|Static|Public|BlueprintCallable // @ game+0xe01a40
};

// Class Athena.AudioVisualiserHudComponentInterface
// Size: 0x28 (Inherited: 0x28)
struct UAudioVisualiserHudComponentInterface : UInterface {
};

// Class Athena.AudioVisualiserHudComponent
// Size: 0x138 (Inherited: 0xc8)
struct UAudioVisualiserHudComponent : UActorComponent {
	char UnknownData_C8[0x10]; // 0xc8(0x10)
	struct TArray<struct FHoopData> Hoops; // 0xd8(0x10)
	char UnknownData_E8[0x50]; // 0xe8(0x50)
};

// Class Athena.AwaitCrewShipToSailAwayFromCurrentLocationStep
// Size: 0x148 (Inherited: 0x98)
struct UAwaitCrewShipToSailAwayFromCurrentLocationStep : UTaleQuestStep {
	char UnknownData_98[0x68]; // 0x98(0x68)
	struct AShip* WeakCrewShipPtr; // 0x100(0x08)
	char UnknownData_108[0x40]; // 0x108(0x40)
};

// Class Athena.AwaitCrewShipToSailAwayFromCurrentLocationStepDesc
// Size: 0x88 (Inherited: 0x80)
struct UAwaitCrewShipToSailAwayFromCurrentLocationStepDesc : UTaleQuestStepDesc {
	float MinShipDistanceToTravel; // 0x80(0x04)
	bool CompleteStepIfShipIsDestroyed; // 0x84(0x01)
	char UnknownData_85[0x3]; // 0x85(0x03)
};

// Class Athena.RadialContentRule
// Size: 0x78 (Inherited: 0x28)
struct URadialContentRule : UObject {
	struct FText RadialTitle; // 0x28(0x38)
	char UnknownData_60[0x8]; // 0x60(0x08)
	struct TArray<struct UClass*> NotificationInputsToBlock; // 0x68(0x10)
};

// Class Athena.BaitRadialContentRule
// Size: 0x110 (Inherited: 0x78)
struct UBaitRadialContentRule : URadialContentRule {
	char UnknownData_78[0x58]; // 0x78(0x58)
	float RadialIconScale; // 0xd0(0x04)
	struct FVector2D RadialIconOffset; // 0xd4(0x08)
	char UnknownData_DC[0x4]; // 0xdc(0x04)
	struct UInventoryItemDescToSlotRemappingPolicyAsset* RemappingAsset; // 0xe0(0x08)
	struct TArray<struct AItemInfo*> MappedSlots; // 0xe8(0x10)
	struct UClass* BaitItemCategory; // 0xf8(0x08)
	char UnknownData_100[0x10]; // 0x100(0x10)
};

// Class Athena.BakedDecalComponent
// Size: 0x110 (Inherited: 0xc8)
struct UBakedDecalComponent : UActorComponent {
	int32_t TargetTextureSize; // 0xc8(0x04)
	struct FLinearColor ClearColour; // 0xcc(0x10)
	int32_t MaxDeferredDecals; // 0xdc(0x04)
	struct UTextureRenderTarget2D* TargetTexture; // 0xe0(0x08)
	struct TArray<struct UStaticMeshComponent*> StaticMeshes; // 0xe8(0x10)
	struct TArray<struct FDeferredBakedDecal> DeferredDecals; // 0xf8(0x10)
	char UnknownData_108[0x8]; // 0x108(0x08)

	struct UTexture* GetTargetTexture(); // Function Athena.BakedDecalComponent.GetTargetTexture // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xe03890
	void FinishInitialisation(struct UObject* WorldContextObject); // Function Athena.BakedDecalComponent.FinishInitialisation // Final|Native|Public|BlueprintCallable // @ game+0xe01c60
	void FilterEdges(); // Function Athena.BakedDecalComponent.FilterEdges // Final|Native|Public|BlueprintCallable // @ game+0xe01a20
	void DrawDecal(struct UObject* WorldContextObject, struct FVector Position, struct FVector Normal, float Radius, float NearDistance, float FarDistance, float CullDistance, struct UTexture2D* DecalTexture, char BlendMode, int32_t LODIndex); // Function Athena.BakedDecalComponent.DrawDecal // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xe01010
	void CopyToTargetTexture(struct UObject* WorldContextObject, struct UTexture* SourceTexture); // Function Athena.BakedDecalComponent.CopyToTargetTexture // Final|Native|Public|BlueprintCallable // @ game+0xe00c30
	void ClearTargetTexture(struct FLinearColor ClearColor); // Function Athena.BakedDecalComponent.ClearTargetTexture // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0xe00b30
	void AddMesh(struct UStaticMeshComponent* Mesh); // Function Athena.BakedDecalComponent.AddMesh // Final|Native|Public|BlueprintCallable // @ game+0xdfff90
};

// Class Athena.BallastStatus
// Size: 0x30 (Inherited: 0x30)
struct UBallastStatus : UStatusBase {
};

// Class Athena.PickupableObject
// Size: 0x5a0 (Inherited: 0x400)
struct APickupableObject : AInteractableBase {
	char UnknownData_400[0x10]; // 0x400(0x10)
	struct FStartPickupObjectActionRuleParams StartPickupObjectActionRuleParams; // 0x410(0x10)
	float PickupTime; // 0x420(0x04)
	char UnknownData_424[0x10c]; // 0x424(0x10c)
	struct FText PickupTooltipDescription; // 0x530(0x38)
	struct FText PickupInventoryFullTooltipDescription; // 0x568(0x38)
};

// Class Athena.ItemProxy
// Size: 0x6d8 (Inherited: 0x5a0)
struct AItemProxy : APickupableObject {
	char UnknownData_5A0[0x30]; // 0x5a0(0x30)
	float InteractionPointRadius; // 0x5d0(0x04)
	char UnknownData_5D4[0x4]; // 0x5d4(0x04)
	struct UWwiseEvent* GroundImpactSfx; // 0x5d8(0x08)
	struct UWwiseEvent* GroundImpactAdditiveSfx; // 0x5e0(0x08)
	char UnknownData_5E8[0x20]; // 0x5e8(0x20)
	struct TArray<struct FItemProxyImpactVfxParams> VFXParams; // 0x608(0x10)
	float ZOffsetWhenPlacingWorldProxy; // 0x618(0x04)
	struct FRotator RotationWhenPlacingWorldProxy; // 0x61c(0x0c)
	char DropOnSurfaceClientTraceChannel; // 0x628(0x01)
	char UnknownData_629[0x7]; // 0x629(0x07)
	struct UPrimitiveComponent* ThirdPersonMesh; // 0x630(0x08)
	float TTL; // 0x638(0x04)
	char UnknownData_63C[0x4]; // 0x63c(0x04)
	struct UWaterInteractionComponent* WaterInteractionComponent; // 0x640(0x08)
	struct UBuoyancyComponent* BuoyancyComponent; // 0x648(0x08)
	char UnknownData_650[0x1]; // 0x650(0x01)
	char CachedProxySurfaceType; // 0x651(0x01)
	bool CachedOnTopOfExistingBuriable; // 0x652(0x01)
	bool DroppedInDeepWater; // 0x653(0x01)
	char UnknownData_654[0x4]; // 0x654(0x04)
	struct AItemInfo* ItemInfo; // 0x658(0x08)
	char UnknownData_660[0x6c]; // 0x660(0x6c)
	float TTLPlayerProximityCutoff; // 0x6cc(0x04)
	float TTLRecheckPeriod; // 0x6d0(0x04)
	char UnknownData_6D4[0x4]; // 0x6d4(0x04)

	void SetActorItemProxyDroppedOn(struct AActor* InActorItemProxyDroppedOn); // Function Athena.ItemProxy.SetActorItemProxyDroppedOn // Native|Public|BlueprintCallable // @ game+0x3887620
	void PerformDropOnSurfaceFx(char ServerSurfaceType, bool AttachVFXToItem, struct FVector OverrideVFXPos, struct AActor* ActorToParentVfxTo); // Function Athena.ItemProxy.PerformDropOnSurfaceFx // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x3886ba0
	void OnRep_ItemInfo(); // Function Athena.ItemProxy.OnRep_ItemInfo // Final|Native|Private // @ game+0x3886b40
	void OnRep_CachedProxySurfaceType(); // Function Athena.ItemProxy.OnRep_CachedProxySurfaceType // Final|Native|Private // @ game+0x3886ae0
	void Multicast_DropOnSurfaceRPC(char SurfaceType, bool AttachVFXToItem, struct FVector OverrideVFXPos, struct AActor* ActorToParentVfxTo); // Function Athena.ItemProxy.Multicast_DropOnSurfaceRPC // Final|Net|Native|Event|NetMulticast|Private|HasDefaults // @ game+0x3886610
	struct AItemInfo* GetItemInfo(); // Function Athena.ItemProxy.GetItemInfo // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x3885980
	void DestroyWholeItem(); // Function Athena.ItemProxy.DestroyWholeItem // Final|Native|Public|BlueprintCallable // @ game+0x3884d80
};

// Class Athena.FloatingItemProxy
// Size: 0x888 (Inherited: 0x6d8)
struct AFloatingItemProxy : AItemProxy {
	char UnknownData_6D8[0x8]; // 0x6d8(0x08)
	struct FRigidBodyErrorCorrection PhysicsErrorCorrection; // 0x6e0(0x1c)
	char UnknownData_6FC[0x4]; // 0x6fc(0x04)
	struct UBoxComponent* BaseComponent; // 0x700(0x08)
	char UnknownData_708[0x40]; // 0x708(0x40)
	struct FNetTimeStampCalculator MovementTimeStamp; // 0x748(0x70)
	struct AActor* TutorialOwner; // 0x7b8(0x08)
	bool IsTutorialProxy; // 0x7c0(0x01)
	char UnknownData_7C1[0x7]; // 0x7c1(0x07)
	struct FReplicatedPhysicsState ReplicatedPhysicsState; // 0x7c8(0x50)
	struct URetractableComponent* RetractableComponent; // 0x818(0x08)
	bool ForceKeepTickActive; // 0x820(0x01)
	char UnknownData_821[0x5f]; // 0x821(0x5f)
	char CachedAutoAimCollisionChannel; // 0x880(0x01)
	char CachedVehicleCollisionResponse; // 0x881(0x01)
	char UnknownData_882[0x6]; // 0x882(0x06)

	void OnRep_PhysicsState(); // Function Athena.FloatingItemProxy.OnRep_PhysicsState // Final|Native|Protected // @ game+0x3b63c60
};

// Class Athena.BootyProxy
// Size: 0x8a8 (Inherited: 0x888)
struct ABootyProxy : AFloatingItemProxy {
	char UnknownData_888[0x18]; // 0x888(0x18)
	struct UItemProxyShipTrackerComponent* ItemProxyShipTrackerComponent; // 0x8a0(0x08)
};

// Class Athena.BaseMerchantCrateItemProxy
// Size: 0x8c8 (Inherited: 0x8a8)
struct ABaseMerchantCrateItemProxy : ABootyProxy {
	struct URewindComponent* RewindComponent; // 0x8a8(0x08)
	TScriptInterface<struct UMountpointInterface> MountpointInterface; // 0x8b0(0x10)
	struct UWwiseEvent* FullGroundImpactSfx; // 0x8c0(0x08)
};

// Class Athena.MerchantCrateItemProxy
// Size: 0x8c8 (Inherited: 0x8c8)
struct AMerchantCrateItemProxy : ABaseMerchantCrateItemProxy {
};

// Class Athena.StaticMerchantCrateItemProxy
// Size: 0x8c8 (Inherited: 0x8c8)
struct AStaticMerchantCrateItemProxy : ABaseMerchantCrateItemProxy {
};

// Class Athena.CargoRunCrateItemProxy
// Size: 0x8d8 (Inherited: 0x8c8)
struct ACargoRunCrateItemProxy : AMerchantCrateItemProxy {
	struct UCargoRunCrateComponent* CargoRunCrateComponent; // 0x8c8(0x08)
	struct UNPCDialogComponent* NPCDialogComponent; // 0x8d0(0x08)
};

// Class Athena.StaticCargoRunCrateItemProxy
// Size: 0x8d8 (Inherited: 0x8c8)
struct AStaticCargoRunCrateItemProxy : AStaticMerchantCrateItemProxy {
	struct UCargoRunCrateComponent* CargoRunCrateComponent; // 0x8c8(0x08)
	struct UNPCDialogComponent* NPCDialogComponent; // 0x8d0(0x08)
};

// Class Athena.DamageableCargoRunCrateItemProxy
// Size: 0x900 (Inherited: 0x8d8)
struct ADamageableCargoRunCrateItemProxy : ACargoRunCrateItemProxy {
	bool ProjectileCollisionsEnabledAboveMinimumHealthGate; // 0x8d8(0x01)
	char UnknownData_8D9[0x7]; // 0x8d9(0x07)
	struct UGatedHealthComponent* GatedHealthComponent; // 0x8e0(0x08)
	char UnknownData_8E8[0x8]; // 0x8e8(0x08)
	struct UVisualHealthResponseComponent* VisualHealthResponseComponent; // 0x8f0(0x08)
	struct ULightWeightStatusEffectManagerComponent* LightweightStatusEffectComponent; // 0x8f8(0x08)
};

// Class Athena.StaticDamageableCargoRunCrateItemProxy
// Size: 0x900 (Inherited: 0x8d8)
struct AStaticDamageableCargoRunCrateItemProxy : AStaticCargoRunCrateItemProxy {
	bool ProjectileCollisionsEnabledAboveMinimumHealthGate; // 0x8d8(0x01)
	char UnknownData_8D9[0x7]; // 0x8d9(0x07)
	struct UGatedHealthComponent* GatedHealthComponent; // 0x8e0(0x08)
	char UnknownData_8E8[0x8]; // 0x8e8(0x08)
	struct UVisualHealthResponseComponent* VisualHealthResponseComponent; // 0x8f0(0x08)
	struct ULightWeightStatusEffectManagerComponent* LightweightStatusEffectComponent; // 0x8f8(0x08)
};

// Class Athena.ItemInfo
// Size: 0x510 (Inherited: 0x3c8)
struct AItemInfo : AActor {
	char UnknownData_3C8[0x20]; // 0x3c8(0x20)
	bool CanBeStoredInInventory; // 0x3e8(0x01)
	char UnknownData_3E9[0x7]; // 0x3e9(0x07)
	struct FMulticastDelegate OnItemPickedUpDelegate; // 0x3f0(0x10)
	struct FMulticastDelegate OnItemDroppedDeletage; // 0x400(0x10)
	char UnknownData_410[0x18]; // 0x410(0x18)
	struct UClass* WieldableType; // 0x428(0x08)
	struct UClass* ProxyType; // 0x430(0x08)
	struct UWieldableItemPersistentCooldownComponent* WieldableItemPersistenceCooldownComponent; // 0x438(0x08)
	struct UItemDesc* Desc; // 0x440(0x08)
	char CurrentRepresentation; // 0x448(0x01)
	char UnknownData_449[0x7]; // 0x449(0x07)
	struct AActor* CurrentRepresentationInstance; // 0x450(0x08)
	struct AActor* CurrentOwner; // 0x458(0x08)
	struct AActor* TutorialOwner; // 0x460(0x08)
	char UnknownData_468[0xa1]; // 0x468(0xa1)
	bool DoNotConsiderForMigrationGather; // 0x509(0x01)
	char UnknownData_50A[0x6]; // 0x50a(0x06)

	void SwitchNetworkClusterToGlobal(); // Function Athena.ItemInfo.SwitchNetworkClusterToGlobal // Final|Native|Public|BlueprintCallable // @ game+0x3888710
	void SwitchNetworkClusterTo(struct AActor* NewOwner); // Function Athena.ItemInfo.SwitchNetworkClusterTo // Final|Native|Public|BlueprintCallable // @ game+0x3888690
	void OnRep_Desc(); // Function Athena.ItemInfo.OnRep_Desc // Native|Protected // @ game+0x3886b20
	void OnRep_CurrentRepresentationInstance(); // Function Athena.ItemInfo.OnRep_CurrentRepresentationInstance // Native|Protected // @ game+0x3886b00
	struct UClass* GetItemType(); // Function Athena.ItemInfo.GetItemType // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x38859f0
	struct UClass* GetItemCategory(); // Function Athena.ItemInfo.GetItemCategory // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x3885730
	struct AActor* GetItem(); // Function Athena.ItemInfo.GetItem // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x3885660
	struct AWieldableItem* GetAsWieldable(); // Function Athena.ItemInfo.GetAsWieldable // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x3885230
	struct AWieldableItem* CreateWieldableItem(struct AActor* InNewOwner, struct FTransform InTransform); // Function Athena.ItemInfo.CreateWieldableItem // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x3884ad0
	struct AActor* CreateProxyItem(struct FTransform InTransform, char LifetimeManagement); // Function Athena.ItemInfo.CreateProxyItem // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x38847a0
};

// Class Athena.NonStorableItemInfo
// Size: 0x510 (Inherited: 0x510)
struct ANonStorableItemInfo : AItemInfo {
};

// Class Athena.BootyItemInfo
// Size: 0x728 (Inherited: 0x510)
struct ABootyItemInfo : ANonStorableItemInfo {
	char UnknownData_510[0x30]; // 0x510(0x30)
	char BootyType; // 0x540(0x01)
	char UnknownData_541[0x3]; // 0x541(0x03)
	struct FGuid Id; // 0x544(0x10)
	bool PlayedFirstTimeEquipSfx; // 0x554(0x01)
	char UnknownData_555[0x3]; // 0x555(0x03)
	struct TArray<struct FPlayerStat> HandInPlayerStats; // 0x558(0x10)
	struct TArray<struct FPlayerStat> HandInStolenPlayerStats; // 0x568(0x10)
	struct TArray<struct FPlayerStat> HandInStolenFromPlayerStats; // 0x578(0x10)
	struct TArray<struct FPlayerStat> HandInGiftPlayerStats; // 0x588(0x10)
	struct TArray<struct FPlayerStat> HandInAsPirateLegendPlayerStats; // 0x598(0x10)
	struct TArray<struct FPlayerStat> HandInOnSchedulePlayerStats; // 0x5a8(0x10)
	struct TArray<struct FPlayerStat> HandInAsPirateLegendOnSchedulePlayerStats; // 0x5b8(0x10)
	struct TArray<struct FEmissaryBootyItemStats> HandInAsEmissaryPlayerStats; // 0x5c8(0x10)
	struct TArray<struct FEmissaryBootyItemStats> HandInAsMaxLevelEmissaryPlayerStats; // 0x5d8(0x10)
	struct TArray<struct FEmissaryBootyItemStats> HandInStolenAsEmissaryPlayerStats; // 0x5e8(0x10)
	struct TArray<struct FEmissaryBootyItemStats> HandInStolenAsMaxLevelEmissaryPlayerStats; // 0x5f8(0x10)
	struct TArray<struct FPlayerStat> UsePlayerStats; // 0x608(0x10)
	struct TArray<struct FPlayerStat> UseStolenPlayerStats; // 0x618(0x10)
	struct FCompanyBootyStatList CompanySpecificStats; // 0x628(0x10)
	struct FConditionalHandInStat ConditionalHandInStat; // 0x638(0x20)
	struct UPopUpMessageDesc* DiscoveredPopupDesc; // 0x658(0x08)
	struct FBootyItemSellPrerequisites SellPrerequisites; // 0x660(0x10)
	struct UTrackedOwnerComponent* TrackedOwnerComponent; // 0x670(0x08)
	struct UItemQualityComponent* ItemQualityComponent; // 0x678(0x08)
	char ItemQualityLevel; // 0x680(0x01)
	char UnknownData_681[0x7]; // 0x681(0x07)
	struct TArray<struct FPerComanyItemQualityEntry> CompanySpecificItemQualityLevel; // 0x688(0x10)
	struct FRewardId HandInRewardId; // 0x698(0x08)
	struct TArray<struct FCompanySpecificBootyReward> HandInRewardIdCompanySpecific; // 0x6a0(0x10)
	bool RewardToOwnCrewOnly; // 0x6b0(0x01)
	char UnknownData_6B1[0x3]; // 0x6b1(0x03)
	struct FName Rarity; // 0x6b4(0x08)
	char UnknownData_6BC[0x4]; // 0x6bc(0x04)
	struct UClass* AwardAllegianceToFaction; // 0x6c0(0x08)
	char UnknownData_6C8[0x18]; // 0x6c8(0x18)
	struct UDeliverableComponent* DeliverableComponent; // 0x6e0(0x08)
	struct UCrewOwnershipTrackingComponent* CrewOwnershipTrackingComponent; // 0x6e8(0x08)
	struct UBootyItemShipOwnershipComponent* BootyItemShipOwnershipComponent; // 0x6f0(0x08)
	char SpawnSource; // 0x6f8(0x01)
	char UnknownData_6F9[0x2f]; // 0x6f9(0x2f)
};

// Class Athena.MerchantCrateItemInfo
// Size: 0x7b0 (Inherited: 0x728)
struct AMerchantCrateItemInfo : ABootyItemInfo {
	char UnknownData_728[0x8]; // 0x728(0x08)
	struct TArray<struct FMerchantCrateItemInfoFaunaBreedRarityEntry> FaunaBreedRarity; // 0x730(0x10)
	char UnknownData_740[0x68]; // 0x740(0x68)
	struct AActor* CurrentShip; // 0x7a8(0x08)

	void OnDispatcherDestroyed(); // Function Athena.MerchantCrateItemInfo.OnDispatcherDestroyed // Final|Native|Private // @ game+0xe05100
};

// Class Athena.WieldableItem
// Size: 0x7e0 (Inherited: 0x3c8)
struct AWieldableItem : AActor {
	char UnknownData_3C8[0x60]; // 0x3c8(0x60)
	struct UPrimitiveComponent* FirstPersonMesh; // 0x428(0x08)
	struct UPrimitiveComponent* ThirdPersonMesh; // 0x430(0x08)
	struct UActionRulesComponent* ActionRulesComponent; // 0x438(0x08)
	struct UClass* AnimationKey; // 0x440(0x08)
	struct FObjectMessagingDispatcher MessagingDispatcher; // 0x448(0xa0)
	char UnknownData_4E8[0x8]; // 0x4e8(0x08)
	struct FTransform AnimationOffset; // 0x4f0(0x30)
	struct UWwiseEvent* EquipSfx; // 0x520(0x08)
	struct UWwiseEvent* UnequipSfx; // 0x528(0x08)
	struct UWwiseEvent* WielderLandedJumpSfx; // 0x530(0x08)
	struct UWwiseEvent* WielderFootstepLayerOneshot; // 0x538(0x08)
	struct FName PlayerWalkSpeedRtpc; // 0x540(0x08)
	struct UWwiseEvent* FirstTimeEquipSfx; // 0x548(0x08)
	bool ForceUnequipSfx; // 0x550(0x01)
	char ItemSize; // 0x551(0x01)
	char UnknownData_552[0x6]; // 0x552(0x06)
	struct FDetailAppearenceDesc DetailAppearence; // 0x558(0x30)
	bool PropagateVisibilityToChildren; // 0x588(0x01)
	char UnknownData_589[0x3]; // 0x589(0x03)
	struct FName AINoiseTag; // 0x58c(0x08)
	char UnknownData_594[0x4]; // 0x594(0x04)
	struct TArray<struct FName> ThirdPersonExtraMeshNames; // 0x598(0x10)
	struct TArray<struct FName> StashedExtraMeshNames; // 0x5a8(0x10)
	struct UMeshComponent* StashedMeshComponent; // 0x5b8(0x08)
	struct FName StashedMeshAttachSocket; // 0x5c0(0x08)
	struct FName ServerWieldAttachSocket; // 0x5c8(0x08)
	struct UPhrasesRadialDataAsset* Phrases; // 0x5d0(0x08)
	struct UObject* CachedFirstPersonProxyMesh; // 0x5d8(0x08)
	struct UObject* CachedThirdPersonProxyMesh; // 0x5e0(0x08)
	char UnknownData_5E8[0x168]; // 0x5e8(0x168)
	struct UClass* ItemCategory; // 0x750(0x08)
	struct AItemInfo* ItemInfo; // 0x758(0x08)
	struct AInterpolatingItem* InterpolatingItem; // 0x760(0x08)
	char UnknownData_768[0x18]; // 0x768(0x18)
	struct AActor* LastKnownWielder; // 0x780(0x08)
	struct UWieldableItemVfxComponent* WieldableItemVfxComponent; // 0x788(0x08)
	struct TArray<struct UMeshComponent*> ThirdPersonExtraMeshes; // 0x790(0x10)
	struct TArray<struct UMeshComponent*> StashedExtraMeshes; // 0x7a0(0x10)
	char UnknownData_7B0[0x19]; // 0x7b0(0x19)
	bool OfferingEnabled; // 0x7c9(0x01)
	char UnknownData_7CA[0x2]; // 0x7ca(0x02)
	struct FGuid QuestId; // 0x7cc(0x10)
	char UnknownData_7DC[0x4]; // 0x7dc(0x04)

	void SetItemWwiseSwitch(struct FName SwitchGroup, struct FName SwitchOption); // Function Athena.WieldableItem.SetItemWwiseSwitch // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x3887b30
	void SetItemWwiseRTPC(struct FName RTPCName, float Value); // Function Athena.WieldableItem.SetItemWwiseRTPC // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x3887a60
	void PostItemWwiseEvent(struct UWwiseEvent* Event); // Function Athena.WieldableItem.PostItemWwiseEvent // Final|Native|Public|BlueprintCallable // @ game+0x3886ed0
	void OnWielderHasLandedFromJumpBPImpl(); // Function Athena.WieldableItem.OnWielderHasLandedFromJumpBPImpl // Event|Public|BlueprintEvent // @ game+0x1848130
	void OnRep_QuestId(); // Function Athena.WieldableItem.OnRep_QuestId // Final|Native|Protected // @ game+0x3886b80
	void OnRep_ItemInfo(); // Function Athena.WieldableItem.OnRep_ItemInfo // Native|Protected // @ game+0x3886b60
	bool IsUnderwater(); // Function Athena.WieldableItem.IsUnderwater // Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x3886380
	struct AActor* GetWielder(); // Function Athena.WieldableItem.GetWielder // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x3886170
	struct FTransform GetWieldedItemAnimationOffset(); // Function Athena.WieldableItem.GetWieldedItemAnimationOffset // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x3886020
	char GetWieldableItemSize(); // Function Athena.WieldableItem.GetWieldableItemSize // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x3885fa0
	struct AActor* GetLastKnownWielder(); // Function Athena.WieldableItem.GetLastKnownWielder // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x3885c30
	bool GetIsFirstPerson(); // Function Athena.WieldableItem.GetIsFirstPerson // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x3885630
};

// Class Athena.SkeletalMeshWieldableItem
// Size: 0x7e0 (Inherited: 0x7e0)
struct ASkeletalMeshWieldableItem : AWieldableItem {
};

// Class Athena.LargeSkeletalMeshWieldableItem
// Size: 0x7e0 (Inherited: 0x7e0)
struct ALargeSkeletalMeshWieldableItem : ASkeletalMeshWieldableItem {
};

// Class Athena.MerchantCrate
// Size: 0x810 (Inherited: 0x7e0)
struct AMerchantCrate : ALargeSkeletalMeshWieldableItem {
	struct FMerchantCrateSfx FullCrateSfx; // 0x7e0(0x20)
	TScriptInterface<struct UMountpointInterface> MountpointInterface; // 0x800(0x10)
};

// Class Athena.StaticMeshWieldableItem
// Size: 0x7e0 (Inherited: 0x7e0)
struct AStaticMeshWieldableItem : AWieldableItem {
};

// Class Athena.LargeStaticMeshWieldableItem
// Size: 0x7e0 (Inherited: 0x7e0)
struct ALargeStaticMeshWieldableItem : AStaticMeshWieldableItem {
};

// Class Athena.StaticMerchantCrate
// Size: 0x840 (Inherited: 0x7e0)
struct AStaticMerchantCrate : ALargeStaticMeshWieldableItem {
	struct URewindComponent* RewindComponent; // 0x7e0(0x08)
	struct FMerchantCrateSfx FullCrateSfx; // 0x7e8(0x20)
	TScriptInterface<struct UMountpointInterface> MountpointInterface; // 0x808(0x10)
	struct UHitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectComponent; // 0x818(0x08)
	char UnknownData_820[0x10]; // 0x820(0x10)
	bool RequiresRewindComponent; // 0x830(0x01)
	char UnknownData_831[0xf]; // 0x831(0x0f)
};

// Class Athena.MockMerchantCrateItemProxy
// Size: 0x8c8 (Inherited: 0x8c8)
struct AMockMerchantCrateItemProxy : ABaseMerchantCrateItemProxy {
};

// Class Athena.CategoryBase
// Size: 0x78 (Inherited: 0x28)
struct UCategoryBase : UObject {
	struct FText Name; // 0x28(0x38)
	struct FName UniqueTextIdentifier; // 0x60(0x08)
	struct FStringAssetReference IconPath; // 0x68(0x10)
};

// Class Athena.ItemCategory
// Size: 0x80 (Inherited: 0x78)
struct UItemCategory : UCategoryBase {
	struct UClass* NotificationInputId; // 0x78(0x08)
};

// Class Athena.MerchantCrateCategoryMock
// Size: 0x80 (Inherited: 0x80)
struct UMerchantCrateCategoryMock : UItemCategory {
};

// Class Athena.MerchantCrateItemInfoMock
// Size: 0x7b8 (Inherited: 0x7b0)
struct AMerchantCrateItemInfoMock : AMerchantCrateItemInfo {
	char UnknownData_7B0[0x8]; // 0x7b0(0x08)
};

// Class Athena.CommonMerchantCrateItemInfoMock
// Size: 0x7b8 (Inherited: 0x7b8)
struct ACommonMerchantCrateItemInfoMock : AMerchantCrateItemInfoMock {
};

// Class Athena.RareMerchantCrateItemInfoMock
// Size: 0x7b8 (Inherited: 0x7b8)
struct ARareMerchantCrateItemInfoMock : AMerchantCrateItemInfoMock {
};

// Class Athena.LegendaryMerchantCrateItemInfoMock
// Size: 0x7b8 (Inherited: 0x7b8)
struct ALegendaryMerchantCrateItemInfoMock : AMerchantCrateItemInfoMock {
};

// Class Athena.MythicalMerchantCrateItemInfoMock
// Size: 0x7b8 (Inherited: 0x7b8)
struct AMythicalMerchantCrateItemInfoMock : AMerchantCrateItemInfoMock {
};

// Class Athena.ItemDesc
// Size: 0x120 (Inherited: 0xc8)
struct UItemDesc : UEntitlementDesc {
	char CanBeAddedToLoadout : 1; // 0xc8(0x01)
	char IsTransient : 1; // 0xc8(0x01)
	char UnknownData_C8_2 : 6; // 0xc8(0x01)
	char UnknownData_C9[0x7]; // 0xc9(0x07)
	struct FString PreviousItem; // 0xd0(0x10)
	struct FString NextItem; // 0xe0(0x10)
	struct FStringAssetReference IconRadPath; // 0xf0(0x10)
	struct FStringClassReference InstanceClassType; // 0x100(0x10)
	struct TArray<struct FItemInfoTogglePair> ItemInfoOverrides; // 0x110(0x10)
};

// Class Athena.ItemWithoutIconsDesc
// Size: 0x120 (Inherited: 0x120)
struct UItemWithoutIconsDesc : UItemDesc {
};

// Class Athena.BootyItemDesc
// Size: 0x120 (Inherited: 0x120)
struct UBootyItemDesc : UItemWithoutIconsDesc {
};

// Class Athena.MerchantCrateItemDescMock
// Size: 0x120 (Inherited: 0x120)
struct UMerchantCrateItemDescMock : UBootyItemDesc {
};

// Class Athena.MerchantCrateFilledItemProxy
// Size: 0x8e0 (Inherited: 0x8c8)
struct AMerchantCrateFilledItemProxy : AStaticMerchantCrateItemProxy {
	struct UStorageContainerComponent* StorageContainerComponent; // 0x8c8(0x08)
	bool FillCrateToCapacity; // 0x8d0(0x01)
	char UnknownData_8D1[0xf]; // 0x8d1(0x0f)
};

// Class Athena.ClientNotificationsService
// Size: 0x50 (Inherited: 0x28)
struct UClientNotificationsService : UObject {
	char UnknownData_28[0x28]; // 0x28(0x28)
};

// Class Athena.PlayNpcAnimationStep
// Size: 0xf0 (Inherited: 0x98)
struct UPlayNpcAnimationStep : UTaleQuestStep {
	struct UBasePlayNpcAnimationStepDesc* StepDesc; // 0x98(0x08)
	char UnknownData_A0[0x10]; // 0xa0(0x10)
	struct UNPCDialogComponent* NPCDialogComponent; // 0xb0(0x08)
	struct ACutSceneActor* CutSceneActor; // 0xb8(0x08)
	char UnknownData_C0[0x30]; // 0xc0(0x30)
};

// Class Athena.BasePlayNpcAnimationStepDesc
// Size: 0x108 (Inherited: 0x80)
struct UBasePlayNpcAnimationStepDesc : UTaleQuestStepDesc {
	struct FQuestVariableActor PlaceableReaction; // 0x80(0x30)
	struct FQuestVariableActor CutSceneActor; // 0xb0(0x30)
	struct FName AnimationNameToPlay; // 0xe0(0x08)
	float SubtitleMaxDistance; // 0xe8(0x04)
	bool UseServerDrivenDialogue; // 0xec(0x01)
	char UnknownData_ED[0x3]; // 0xed(0x03)
	struct USceneDialogueData* DialogueData; // 0xf0(0x08)
	struct UClass* LocalMusicZone; // 0xf8(0x08)
	bool PreventServerMigration; // 0x100(0x01)
	char UnknownData_101[0x7]; // 0x101(0x07)
};

// Class Athena.PlayNpcAnimationStepDesc
// Size: 0x170 (Inherited: 0x108)
struct UPlayNpcAnimationStepDesc : UBasePlayNpcAnimationStepDesc {
	struct FQuestVariableActor TargetNpc; // 0x108(0x30)
	struct FText SpeakingActorLocalisableName; // 0x138(0x38)
};

// Class Athena.PlayGroupNpcAnimationStepDesc
// Size: 0x1a8 (Inherited: 0x108)
struct UPlayGroupNpcAnimationStepDesc : UBasePlayNpcAnimationStepDesc {
	struct FQuestVariableActor TargetNpc1; // 0x108(0x30)
	struct FQuestVariableActor TargetNpc2; // 0x138(0x30)
	struct FQuestVariableActor TargetNpc3; // 0x168(0x30)
	struct TArray<struct FText> SpeakingActorLocalisableNames; // 0x198(0x10)
};

// Class Athena.FlamesOfFateSettingsServiceInterface
// Size: 0x28 (Inherited: 0x28)
struct UFlamesOfFateSettingsServiceInterface : UInterface {
};

// Class Athena.InteractableObject
// Size: 0x468 (Inherited: 0x400)
struct AInteractableObject : AInteractableBase {
	char UnknownData_400[0x18]; // 0x400(0x18)
	struct UOneShotInteractableFilterDesc* FilterDesc; // 0x418(0x08)
	struct FText Verb; // 0x420(0x38)
	char UnknownData_458[0x10]; // 0x458(0x10)

	void ServerInteract(struct AActor* InInteractor); // Function Athena.InteractableObject.ServerInteract // Final|Native|Public|BlueprintCallable // @ game+0x37dae80
	void Blueprint_OnInteract_Server(struct AActor* InInteractor); // Function Athena.InteractableObject.Blueprint_OnInteract_Server // Event|Protected|BlueprintEvent // @ game+0x1848130
	void Blueprint_OnInteract_Client(struct AActor* InInteractor); // Function Athena.InteractableObject.Blueprint_OnInteract_Client // Event|Protected|BlueprintEvent // @ game+0x1848130
};

// Class Athena.Beacon
// Size: 0x7f8 (Inherited: 0x468)
struct ABeacon : AInteractableObject {
	char UnknownData_468[0x10]; // 0x468(0x10)
	struct UStaticMeshComponent* Mesh; // 0x478(0x08)
	struct UParticleSystemComponent* BeaconActiveParticleSystem; // 0x480(0x08)
	struct UPointLightComponent* PointLight; // 0x488(0x08)
	bool EnableParticleSystemTint; // 0x490(0x01)
	char UnknownData_491[0x7]; // 0x491(0x07)
	struct UInteractableComponent* InteractableComponent; // 0x498(0x08)
	struct UObject* ExtinguishedVFX; // 0x4a0(0x08)
	struct FName WwiseEmitterName; // 0x4a8(0x08)
	struct UWwiseEvent* StartLoopFlameSfx; // 0x4b0(0x08)
	struct UWwiseEvent* StopLoopFlameSfx; // 0x4b8(0x08)
	struct UWwiseEvent* FlameTransferSfx; // 0x4c0(0x08)
	struct UWwiseEvent* ExtinguishedSfx; // 0x4c8(0x08)
	struct UWwiseObjectPoolWrapper* BeaconWwisePool; // 0x4d0(0x08)
	float InteractionRadius; // 0x4d8(0x04)
	char UnknownData_4DC[0x4]; // 0x4dc(0x04)
	struct FText TakeFlameTooltipText; // 0x4e0(0x38)
	struct FText CannotTakeFlameTooltipText; // 0x518(0x38)
	struct FText LanternNotRaisedToolTipText; // 0x550(0x38)
	struct FText NotWieldingFlameTooltipText; // 0x588(0x38)
	struct FText SetFlameTooltipText; // 0x5c0(0x38)
	bool CanTakeFlameFromBeacon; // 0x5f8(0x01)
	bool CanSetFlameOnBeacon; // 0x5f9(0x01)
	bool StartLit; // 0x5fa(0x01)
	char StartingType; // 0x5fb(0x01)
	struct FPlayerStat StatToFire; // 0x5fc(0x04)
	struct TArray<struct FBeaconLitWithFlameOfFateStatsToFire> StatMap; // 0x600(0x10)
	struct UCurveLinearColor* ColourChangeCurveFX; // 0x610(0x08)
	struct UCurveLinearColor* ColourChangeCurveLight; // 0x618(0x08)
	bool CanExtinguish; // 0x620(0x01)
	char UnknownData_621[0x3]; // 0x621(0x03)
	float ExtinguishFadeTime; // 0x624(0x04)
	struct FBeaconData BeaconData; // 0x628(0x02)
	char UnknownData_62A[0x6]; // 0x62a(0x06)
	struct UParticleSystemComponent* ExtinguishFXComponent; // 0x630(0x08)
	struct FObjectMessagingDispatcher EventDispatcher; // 0x638(0xa0)
	char UnknownData_6D8[0x120]; // 0x6d8(0x120)

	void SetBlockInteractions(bool InBlockInteractions); // Function Athena.Beacon.SetBlockInteractions // Final|Native|Public|BlueprintCallable // @ game+0xe08130
	void Server_OnBeaconLit(struct AActor* InInstigator); // Function Athena.Beacon.Server_OnBeaconLit // Event|Public|BlueprintEvent // @ game+0x1848130
	void OnRep_OnBeaconDataChanged(struct FBeaconData OldData); // Function Athena.Beacon.OnRep_OnBeaconDataChanged // Final|Native|Public // @ game+0xe06060
	bool IsLit(); // Function Athena.Beacon.IsLit // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xe03f80
	bool ExtinguishFlame(); // Function Athena.Beacon.ExtinguishFlame // Native|Public|BlueprintCallable // @ game+0xe015c0
	void Client_OnBeaconLit(); // Function Athena.Beacon.Client_OnBeaconLit // Event|Public|BlueprintEvent // @ game+0x1848130
	void Client_OnBeaconExtinguished(); // Function Athena.Beacon.Client_OnBeaconExtinguished // Event|Public|BlueprintEvent // @ game+0x1848130
};

// Class Athena.BrazierMechanismTrigger
// Size: 0x8b0 (Inherited: 0x7f8)
struct ABrazierMechanismTrigger : ABeacon {
	struct UMechanismTriggerComponent* MechanismTrigger; // 0x7f8(0x08)
	char FlameTypeToActivate; // 0x800(0x01)
	bool ActivateWithSpecificLantern; // 0x801(0x01)
	char UnknownData_802[0x6]; // 0x802(0x06)
	struct UClass* LanternToActivate; // 0x808(0x08)
	struct FText LanternNotLitToolTipText; // 0x810(0x38)
	struct FText CannotSetBeaconToolTipText; // 0x848(0x38)
	struct UClass* TakeFlameOfFateNotificationID; // 0x880(0x08)
	struct UClass* SetFlameOfFateNotificationID; // 0x888(0x08)
	float LanternSwingAmmount; // 0x890(0x04)
	float LanternEmissiveAmmount; // 0x894(0x04)
	float LanternMegaEmmisiveAmount; // 0x898(0x04)
	char UnknownData_89C[0x4]; // 0x89c(0x04)
	struct TArray<struct UMaterialInstanceDynamic*> DynamicMaterials; // 0x8a0(0x10)
};

// Class Athena.FortOfTheDamnedBrazierMechanismTrigger
// Size: 0x8c0 (Inherited: 0x8b0)
struct AFortOfTheDamnedBrazierMechanismTrigger : ABrazierMechanismTrigger {
	struct UParticleSystemComponent* FOTDBeaconActiveParticleSystem; // 0x8b0(0x08)
	bool IsActiveWaveBrazier; // 0x8b8(0x01)
	char UnknownData_8B9[0x7]; // 0x8b9(0x07)

	void OnRep_IsActiveWaveBrazier(bool OldActive); // Function Athena.FortOfTheDamnedBrazierMechanismTrigger.OnRep_IsActiveWaveBrazier // Final|Native|Public // @ game+0xe05f50
	void OnPlinthActivated(); // Function Athena.FortOfTheDamnedBrazierMechanismTrigger.OnPlinthActivated // Native|Event|Protected|BlueprintEvent // @ game+0xe05b00
	void OnFortOfTheDamnedComplete(); // Function Athena.FortOfTheDamnedBrazierMechanismTrigger.OnFortOfTheDamnedComplete // Native|Event|Protected|BlueprintEvent // @ game+0xe05120
};

// Class Athena.Bed
// Size: 0x3d8 (Inherited: 0x3c8)
struct ABed : AActor {
	struct UStaticMeshComponent* BedMeshComponent; // 0x3c8(0x08)
	struct UReplicatedShipPartCustomizationComponent* CustomizationComponent; // 0x3d0(0x08)

	struct UStaticMeshComponent* GetDrapesMeshComponent(); // Function Athena.Bed.GetDrapesMeshComponent // Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const // @ game+0xe02b40
};

// Class Athena.ShipPartDescAsset
// Size: 0x28 (Inherited: 0x28)
struct UShipPartDescAsset : UDataAsset {
};

// Class Athena.BedPartDescAsset
// Size: 0x38 (Inherited: 0x28)
struct UBedPartDescAsset : UShipPartDescAsset {
	struct FBedPartDesc BedPartDesc; // 0x28(0x10)
};

// Class Athena.BeginBullRushUnarmedNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct UBeginBullRushUnarmedNotificationInputId : UNotificationInputId {
};

// Class Athena.EelSlapNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct UEelSlapNotificationInputId : UNotificationInputId {
};

// Class Athena.LungeBeginAshenLordUnarmedNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct ULungeBeginAshenLordUnarmedNotificationInputId : UNotificationInputId {
};

// Class Athena.SweepLeftAshenLordUnarmedNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct USweepLeftAshenLordUnarmedNotificationInputId : UNotificationInputId {
};

// Class Athena.SweepRightAshenLordUnarmedNotificationInputId
// Size: 0x38 (Inherited: 0x38)
struct USweepRightAshenLordUnarmedNotificationInputId : UNotificationInputId {
};

// Class Athena.BeingRetractedActionStateId
// Size: 0x28 (Inherited: 0x28)
struct UBeingRetractedActionStateId : UActionStateId {
};

// Class Athena.Bell
// Size: 0x570 (Inherited: 0x468)
struct ABell : AInteractableObject {
	struct UReplicatedShipPartCustomizationComponent* CustomisationComponent; // 0x468(0x08)
	struct FBellPlayerStats PlayerStats; // 0x470(0x10)
	struct UInteractableComponent* InteractableComponent; // 0x480(0x08)
	struct UStaticMeshComponent* BellMeshComponent; // 0x488(0x08)
	struct UWwiseEvent* BellRingSFX; // 0x490(0x08)
	struct UWwiseEvent* BellRingSfxStorm; // 0x498(0x08)
	struct FText BellName; // 0x4a0(0x38)
	float TimeBetweenTurbulenceChecks; // 0x4d8(0x04)
	float MinIntervalBetweenRingsLowerBound; // 0x4dc(0x04)
	float MinIntervalBetweenRingsUpperBound; // 0x4e0(0x04)
	float MaxIntervalBetweenRingsLowerBound; // 0x4e4(0x04)
	float MaxIntervalBetweenRingsUpperBound; // 0x4e8(0x04)
	char UnknownData_4EC[0x4]; // 0x4ec(0x04)
	struct UWwiseObjectPoolWrapper* BellPool; // 0x4f0(0x08)
	struct FVector EmitterOffset; // 0x4f8(0x0c)
	char UnknownData_504[0x4]; // 0x504(0x04)
	struct UMaterialInstanceDynamic* BellDynamicMaterial; // 0x508(0x08)
	int32_t BellMaterialIndex; // 0x510(0x04)
	char UnknownData_514[0x5c]; // 0x514(0x5c)

	void RingBell(bool IsInTurbulence); // Function Athena.Bell.RingBell // Net|Native|Event|NetMulticast|Public // @ game+0xe076f0
};

// Class Athena.BellDescAsset
// Size: 0x40 (Inherited: 0x28)
struct UBellDescAsset : UShipPartDescAsset {
	struct FBellDesc BellDesc; // 0x28(0x18)
};

// Class Athena.AtmosphericPressureZoneComponent
// Size: 0x300 (Inherited: 0x2e0)
struct UAtmosphericPressureZoneComponent : USceneComponent {
	char UnknownData_2E0[0x8]; // 0x2e0(0x08)
	struct FAtmosphericPressureZoneParameters PressureZoneParameters; // 0x2e8(0x14)
	char UnknownData_2FC[0x4]; // 0x2fc(0x04)
};

// Class Athena.BlendedAtmosphericPressureZoneComponent
// Size: 0x320 (Inherited: 0x300)
struct UBlendedAtmosphericPressureZoneComponent : UAtmosphericPressureZoneComponent {
	struct UCurveFloat* WeightFadeCurveNormalised; // 0x300(0x08)
	struct UCurveFloat* RadiusFadeCurveNormalised; // 0x308(0x08)
	char UnknownData_310[0x10]; // 0x310(0x10)
};

// Class Athena.BlendedPostProcessingZoneComponentBase
// Size: 0x930 (Inherited: 0x840)
struct UBlendedPostProcessingZoneComponentBase : UPostProcessComponent {
	char UnknownData_840[0x10]; // 0x840(0x10)
	struct UCurveFloat* FadeCurveNormalised; // 0x850(0x08)
	float BlendDistance; // 0x858(0x04)
	char UnknownData_85C[0xd4]; // 0x85c(0xd4)

	void FadeOut(float InTime); // Function Athena.BlendedPostProcessingZoneComponentBase.FadeOut // Final|Native|Public|BlueprintCallable // @ game+0xe01670
	void FadeIn(float InTime); // Function Athena.BlendedPostProcessingZoneComponentBase.FadeIn // Final|Native|Public|BlueprintCallable // @ game+0xe015f0
};

// Class Athena.BlendedPostProcessingRainZoneComponent
// Size: 0x930 (Inherited: 0x930)
struct UBlendedPostProcessingRainZoneComponent : UBlendedPostProcessingZoneComponentBase {
};

// Class Athena.BlinkStrafeComponent
// Size: 0xe8 (Inherited: 0xc8)
struct UBlinkStrafeComponent : UActorComponent {
	struct AAthenaAICharacter* Character; // 0xc8(0x08)
	struct AAthenaAIControllerBase* OwnerAIController; // 0xd0(0x08)
	char UnknownData_D8[0x8]; // 0xd8(0x08)
	bool ShouldBlink; // 0xe0(0x01)
	char UnknownData_E1[0x7]; // 0xe1(0x07)

	void OnRep_Blinking(); // Function Athena.BlinkStrafeComponent.OnRep_Blinking // Final|RequiredAPI|Native|Private // @ game+0xe05cd0
};

// Class Athena.BloatingStatus
// Size: 0x30 (Inherited: 0x30)
struct UBloatingStatus : UStatusBase {
};

// Class Athena.BlockEarthquakeTaleQuestService
// Size: 0x70 (Inherited: 0x60)
struct UBlockEarthquakeTaleQuestService : UTaleQuestService {
	struct UBlockEarthquakeTaleQuestServiceDesc* Desc; // 0x60(0x08)
	char UnknownData_68[0x8]; // 0x68(0x08)
};

// Class Athena.BlockEarthquakeTaleQuestServiceDesc
// Size: 0x58 (Inherited: 0x28)
struct UBlockEarthquakeTaleQuestServiceDesc : UTaleQuestServiceDesc {
	struct FQuestVariableActor ActorNearIsland; // 0x28(0x30)
};

// Class Athena.BlockGeysersTaleQuestService
// Size: 0x70 (Inherited: 0x60)
struct UBlockGeysersTaleQuestService : UTaleQuestService {
	struct UBlockGeysersTaleQuestServiceDesc* Desc; // 0x60(0x08)
	char UnknownData_68[0x8]; // 0x68(0x08)
};

// Class Athena.BlockGeysersTaleQuestServiceDesc
// Size: 0x58 (Inherited: 0x28)
struct UBlockGeysersTaleQuestServiceDesc : UTaleQuestServiceDesc {
	struct FQuestVariableActor ActorNearIsland; // 0x28(0x30)
};

// Class Athena.BlockMigrationForCrewTaskStep
// Size: 0xc0 (Inherited: 0x98)
struct UBlockMigrationForCrewTaskStep : UTaleQuestStep {
	struct UBlockMigrationForCrewTaskStepDesc* Desc; // 0x98(0x08)
	TScriptInterface<struct UTaleQuestStepInterface> TaskStep; // 0xa0(0x10)
	char UnknownData_B0[0x10]; // 0xb0(0x10)
};

// Class Athena.BlockMigrationForCrewTaskStepDesc
// Size: 0xa0 (Inherited: 0x80)
struct UBlockMigrationForCrewTaskStepDesc : UTaleQuestStepDesc {
	struct UTaleQuestStepDesc* TaskDesc; // 0x80(0x08)
	struct FName RemoteConfigKeyBlockServerMigration; // 0x88(0x08)
	struct FString Reason; // 0x90(0x10)
};

// Class Athena.BlockVolcanoTaleQuestService
// Size: 0x70 (Inherited: 0x60)
struct UBlockVolcanoTaleQuestService : UTaleQuestService {
	struct UBlockVolcanoTaleQuestServiceDesc* Desc; // 0x60(0x08)
	char UnknownData_68[0x8]; // 0x68(0x08)
};

// Class Athena.BlockVolcanoTaleQuestServiceDesc
// Size: 0x58 (Inherited: 0x28)
struct UBlockVolcanoTaleQuestServiceDesc : UTaleQuestServiceDesc {
	struct FQuestVariableActor ActorNearIsland; // 0x28(0x30)
};

// Class Athena.BlueprintStepBase
// Size: 0x90 (Inherited: 0x28)
struct UBlueprintStepBase : UObject {
	char BeginMode; // 0x28(0x01)
	char UnknownData_29[0x7]; // 0x29(0x07)
	struct UTaleQuestBlueprintStepDesc* Desc; // 0x30(0x08)
	char UnknownData_38[0x58]; // 0x38(0x58)

	struct AActor* SpawnPhasedItem(struct UClass* InWhat, struct FTransform InWhere, bool Tracked, bool Critical, bool DropItemOnSpawn, struct FText FailureMessage); // Function Athena.BlueprintStepBase.SpawnPhasedItem // Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xe0a330
	void SpawnPhasedActorAsyncAtActorLocation(struct UClass* InWhat, struct AActor* InActorLocation, struct AActor* MapActor, DelegateProperty InCompletionDelegate, struct FName SocketName); // Function Athena.BlueprintStepBase.SpawnPhasedActorAsyncAtActorLocation // Final|Native|Protected|HasOutParms|BlueprintCallable // @ game+0xe0a0b0
	void SpawnPhasedActorAsync(struct UClass* InWhat, struct FTransform InTransform, struct AActor* MapActor, DelegateProperty InCompletionDelegate, struct FName SocketName); // Function Athena.BlueprintStepBase.SpawnPhasedActorAsync // Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xe09e60
	struct AActor* SpawnPhasedActor(struct UClass* InWhat, struct FTransform InTransform, struct AActor* MapActor, struct FName SocketName); // Function Athena.BlueprintStepBase.SpawnPhasedActor // Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xe09c90
	void SpawnItemAsync(struct UClass* InWhat, struct FTransform InWhere, bool Tracked, bool Critical, struct FText FailureMessage, DelegateProperty InCompletionDelegate); // Function Athena.BlueprintStepBase.SpawnItemAsync // Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xe099f0
	struct AActor* SpawnItem(struct UClass* InWhat, struct FTransform InWhere, bool Tracked, bool TrackedProxy, bool Critical, bool DropItemOnSpawn, struct FText FailureMessage); // Function Athena.BlueprintStepBase.SpawnItem // Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xe09720
	void SpawnGhostMarker(struct UClass* RewardMarker, struct TArray<struct AActor*> SpawnedActors, struct FTransform InWhere); // Function Athena.BlueprintStepBase.SpawnGhostMarker // Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xe09590
	struct AItemInfo* SpawnDroppedItem(struct APawn* InWho, struct UClass* InWhat, bool Tracked, bool Critical, struct FText FailureMessage); // Function Athena.BlueprintStepBase.SpawnDroppedItem // Final|Native|Protected|BlueprintCallable // @ game+0xe093a0
	void SpawnActorAsyncWithParams(struct UClass* InWhat, struct FTransform InWhere, struct FTaleActorSpawnParameters SpawnParameters, DelegateProperty InCompletionDelegate); // Function Athena.BlueprintStepBase.SpawnActorAsyncWithParams // Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xe09170
	void SpawnActorAsync(struct UClass* InWhat, struct FTransform InWhere, bool Tracked, DelegateProperty InCompletionDelegate); // Function Athena.BlueprintStepBase.SpawnActorAsync // Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xe08f50
	struct AActor* SpawnActor(struct UClass* InWhat, struct FTransform InWhere, bool Tracked); // Function Athena.BlueprintStepBase.SpawnActor // Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xe08dd0
	void SignalComplete(); // Function Athena.BlueprintStepBase.SignalComplete // Final|Native|Protected|BlueprintCallable // @ game+0xe08d90
	void SetVariables(struct FGenericStruct OutStruct); // Function Athena.BlueprintStepBase.SetVariables // Final|Native|Protected|HasOutParms|BlueprintCallable // @ game+0xe08a80
	void SetCrewShipProgressionSpawnLocations(struct TArray<struct AProgressShipSpawnLocation*> SpawnLocations); // Function Athena.BlueprintStepBase.SetCrewShipProgressionSpawnLocations // Final|Native|Protected|HasOutParms|BlueprintCallable // @ game+0xe083b0
	void SetAndLockFlameOfFateForAllParticipants(); // Function Athena.BlueprintStepBase.SetAndLockFlameOfFateForAllParticipants // Final|Native|Protected|BlueprintCallable|Const // @ game+0xe08110
	struct AActor* ResolveActorOnInstancedLevel(struct AActor* ActorToSearch); // Function Athena.BlueprintStepBase.ResolveActorOnInstancedLevel // Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0xe07610
	void ResetAndUnlockFlameOfFateForAllParticipants(); // Function Athena.BlueprintStepBase.ResetAndUnlockFlameOfFateForAllParticipants // Final|Native|Protected|BlueprintCallable|Const // @ game+0xe07520
	void RemoveCompassFromAllParticipants(); // Function Athena.BlueprintStepBase.RemoveCompassFromAllParticipants // Final|Native|Protected|BlueprintCallable|Const // @ game+0xe07480
	void OnParticipantLeave(struct AActor* Participant); // Function Athena.BlueprintStepBase.OnParticipantLeave // Event|Protected|BlueprintEvent // @ game+0x1848130
	void OnParticipantJoin(struct AActor* Participant); // Function Athena.BlueprintStepBase.OnParticipantJoin // Event|Protected|BlueprintEvent // @ game+0x1848130
	void OnEnd(); // Function Athena.BlueprintStepBase.OnEnd // Event|Protected|BlueprintEvent // @ game+0x1848130
	void OnBegin(char InBeginMode); // Function Athena.BlueprintStepBase.OnBegin // Event|Protected|BlueprintEvent // @ game+0x1848130
	void OnActorsSpawnedAsyncDelegate__DelegateSignature(struct TArray<struct AActor*> Actors); // DelegateFunction Athena.BlueprintStepBase.OnActorsSpawnedAsyncDelegate__DelegateSignature // Public|Delegate|HasOutParms // @ game+0x1848130
	void OnActorSpawnedAsyncDelegate__DelegateSignature(struct AActor* Actor); // DelegateFunction Athena.BlueprintStepBase.OnActorSpawnedAsyncDelegate__DelegateSignature // Public|Delegate // @ game+0x1848130
	void MarkActorAsNonCritical(struct AActor* InWhat); // Function Athena.BlueprintStepBase.MarkActorAsNonCritical // Final|Native|Protected|BlueprintCallable // @ game+0xe045c0
	bool IsPlayerInValidAliveActionState(struct AAthenaPlayerCharacter* PlayerCharacter); // Function Athena.BlueprintStepBase.IsPlayerInValidAliveActionState // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0xe04020
	void GiveQuestBookToAllParticipants(struct AAthenaPlayerCharacter* PlayerToWieldImmediately); // Function Athena.BlueprintStepBase.GiveQuestBookToAllParticipants // Final|Native|Protected|BlueprintCallable|Const // @ game+0xe03bb0
	void GiveLanternToAllParticipants(struct AAthenaPlayerCharacter* PlayerToWieldImmediately); // Function Athena.BlueprintStepBase.GiveLanternToAllParticipants // Final|Native|Protected|BlueprintCallable|Const // @ game+0xe03b30
	void GiveEnchantedSpyglassToAllParticipants(struct AAthenaPlayerCharacter* PlayerToWieldImmediately); // Function Athena.BlueprintStepBase.GiveEnchantedSpyglassToAllParticipants // Final|Native|Protected|BlueprintCallable|Const // @ game+0xe03ab0
	void GiveCompassToAllParticipants(struct AAthenaPlayerCharacter* PlayerToWieldImmediately); // Function Athena.BlueprintStepBase.GiveCompassToAllParticipants // Final|Native|Protected|BlueprintCallable|Const // @ game+0xe03a30
	void GiveCommonToolsToAllParticipants(struct AAthenaPlayerCharacter* PlayerToWieldImmediately); // Function Athena.BlueprintStepBase.GiveCommonToolsToAllParticipants // Final|Native|Protected|BlueprintCallable|Const // @ game+0xe039b0
	void GetVariables(struct FGenericStruct OutStruct); // Function Athena.BlueprintStepBase.GetVariables // Final|Native|Protected|HasOutParms|BlueprintCallable // @ game+0xe038c0
	struct UTaleQuestService* GetService(struct UClass* ServiceClass); // Function Athena.BlueprintStepBase.GetService // Final|Native|Protected|BlueprintCallable // @ game+0xe032e0
	void GetParticipants(struct TArray<struct AActor*> Participants); // Function Athena.BlueprintStepBase.GetParticipants // Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure // @ game+0xe030c0
	struct AGameState* GetGameState(); // Function Athena.BlueprintStepBase.GetGameState // Final|Native|Protected|BlueprintCallable // @ game+0xe02d00
	TScriptInterface<struct UObjectMessagingDispatcherInterface> GetGameInstanceObjectMessagingDispatcher(); // Function Athena.BlueprintStepBase.GetGameInstanceObjectMessagingDispatcher // Final|Native|Protected|BlueprintCallable // @ game+0xe02c60
	struct UObject* GetDefinition(); // Function Athena.BlueprintStepBase.GetDefinition // Final|Native|Protected|BlueprintCallable // @ game+0xe02b10
	struct UClass* GetCrewShipSize(int32_t CrewIndex); // Function Athena.BlueprintStepBase.GetCrewShipSize // Final|Native|Protected|BlueprintCallable // @ game+0xe02920
	struct TArray<struct AShip*> GetCrewShips(); // Function Athena.BlueprintStepBase.GetCrewShips // Final|Native|Protected|BlueprintCallable // @ game+0xe029b0
	struct TArray<struct AAthenaPlayerCharacter*> GetCrewPlayers(); // Function Athena.BlueprintStepBase.GetCrewPlayers // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0xe02880
	void GetCrewIds(struct TArray<struct FGuid> CrewIds); // Function Athena.BlueprintStepBase.GetCrewIds // Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure // @ game+0xe027d0
	struct FVector FindNamedPointOnTaleActorPtrAsVector(struct AActor* ActorToSearch, struct FName GroupName, char ReturnInSpace, char SearchMethod); // Function Athena.BlueprintStepBase.FindNamedPointOnTaleActorPtrAsVector // Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xe01ab0
	void FailTale(struct FText FailureMessage); // Function Athena.BlueprintStepBase.FailTale // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0xe016f0
	void Delay(float Duration, struct FLatentActionInfo LatentInfo); // Function Athena.BlueprintStepBase.Delay // Final|Native|Protected|BlueprintCallable // @ game+0xe00e90
	void ClearCrewShipProgressionSpawnLocations(); // Function Athena.BlueprintStepBase.ClearCrewShipProgressionSpawnLocations // Final|Native|Protected|BlueprintCallable // @ game+0xe00b10
	void ChangeCompassTargetByLocation(struct FVector TargetLocation, char Reason); // Function Athena.BlueprintStepBase.ChangeCompassTargetByLocation // Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0xe00a30
	void ChangeCompassTargetByActor(struct AActor* TargetActor, char Reason); // Function Athena.BlueprintStepBase.ChangeCompassTargetByActor // Final|Native|Protected|BlueprintCallable|Const // @ game+0xe00970
	void BroadcastEvent(struct FName EventName); // Function Athena.BlueprintStepBase.BroadcastEvent // Final|Native|Protected|BlueprintCallable // @ game+0xe007b0
	void AsyncSpawnItemWithSpawnData(struct UItemSpawnData* InWhat, struct FTransform InWhere, bool Tracked, bool Critical, bool Phased, bool DropItemOnSpawn, struct FText FailureMessage, DelegateProperty InCompletionDelegate); // Function Athena.BlueprintStepBase.AsyncSpawnItemWithSpawnData // Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable // @ game+0xe00440
	void AddItemToCommonToolsService(struct UClass* Tool, struct AAthenaPlayerCharacter* PlayerToWieldImmediately); // Function Athena.BlueprintStepBase.AddItemToCommonToolsService // Final|Native|Protected|BlueprintCallable|Const // @ game+0xdffd60
	void AddItemsToCommonToolsService(struct TArray<struct UClass*> Tools, struct AAthenaPlayerCharacter* PlayerToWieldImmediately, int32_t ItemIndexToWield); // Function Athena.BlueprintStepBase.AddItemsToCommonToolsService // Final|Native|Protected|BlueprintCallable|Const // @ game+0xdffe20
};

// Class Athena.BlueprintMechanismStepBase
// Size: 0x90 (Inherited: 0x90)
struct UBlueprintMechanismStepBase : UBlueprintStepBase {

	void RegisterMechanismActionWithTrigger(struct AActor* MechanismAction, struct AActor* MechanismTrigger); // Function Athena.BlueprintMechanismStepBase.RegisterMechanismActionWithTrigger // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0xe07150
	void ActivateMechanismTrigger(struct AActor* MechanismTrigger, struct AActor* Instigator); // Function Athena.BlueprintMechanismStepBase.ActivateMechanismTrigger // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0xdffb70
};

// Class Athena.BlueprintSpawnAIStepBase
// Size: 0xa8 (Inherited: 0x90)
struct UBlueprintSpawnAIStepBase : UBlueprintStepBase {
	char UnknownData_90[0x18]; // 0x90(0x18)

	void OnSpawn(struct APawn* Pawn); // Function Athena.BlueprintSpawnAIStepBase.OnSpawn // Event|Protected|BlueprintEvent // @ game+0x1848130
	void OnSetSpawnLocationActor(struct AActor* Actor); // Function Athena.BlueprintSpawnAIStepBase.OnSetSpawnLocationActor // Event|Protected|BlueprintEvent // @ game+0x1848130
	void OnSetSpawnLocation(struct FOrientedPoint Point); // Function Athena.BlueprintSpawnAIStepBase.OnSetSpawnLocation // Event|Protected|BlueprintEvent // @ game+0x1848130
	void OnDespawn(struct APawn* Pawn, char DeathType); // Function Athena.BlueprintSpawnAIStepBase.OnDespawn // Event|Protected|BlueprintEvent // @ game+0x1848130
	void OnBattleWon(); // Function Athena.BlueprintSpawnAIStepBase.OnBattleWon // Final|Native|Public|BlueprintCallable // @ game+0xe04d90
};

// Class Athena.BlueprintSpawnAIStepDefault
// Size: 0xa8 (Inherited: 0xa8)
struct UBlueprintSpawnAIStepDefault : UBlueprintSpawnAIStepBase {
};

// Class Athena.DamagerType
// Size: 0x28 (Inherited: 0x28)
struct UDamagerType : UObject {
};

// Class Athena.BlunderbussDamagerType
// Size: 0x28 (Inherited: 0x28)
struct UBlunderbussDamagerType : UDamagerType {
};

// Class Athena.BodyLightControllerComponent
// Size: 0x180 (Inherited: 0xc8)
struct UBodyLightControllerComponent : UActorComponent {
	struct UCurveFloat* HourOfDayToIntensityMultiplierCurve; // 0xc8(0x08)
	float BaseLightIntensity; // 0xd0(0x04)
	float IntensitySpringAccel; // 0xd4(0x04)
	char UnknownData_D8[0xa8]; // 0xd8(0xa8)

	struct UAmbientLightSourceComponent* GetTargetLight(); // Function Athena.BodyLightControllerComponent.GetTargetLight // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0xe03860
	void AssignTargetLight(struct UAmbientLightSourceComponent* InTargetLight); // Function Athena.BodyLightControllerComponent.AssignTargetLight // Final|Native|Public|BlueprintCallable // @ game+0xe003c0
};

// Class Athena.BoilingStatus
// Size: 0x30 (Inherited: 0x30)
struct UBoilingStatus : UStatusBase {
};

// Class Athena.BoneAIFormComponent
// Size: 0x148 (Inherited: 0x148)
struct UBoneAIFormComponent : UAthenaAIFormComponent {
};

// Class Athena.BoogieStatus
// Size: 0x30 (Inherited: 0x30)
struct UBoogieStatus : UStatusBase {
};

// Class Athena.QuestBookPageLayout
// Size: 0x48 (Inherited: 0x28)
struct UQuestBookPageLayout : UDataAsset {
	struct TArray<struct FTreasureMapWidgetTexture> Images; // 0x28(0x10)
	struct TArray<struct FTreasureMapWidgetLocalisedTextWithFontOverride> GeneralText; // 0x38(0x10)
};

// Class Athena.TurnablePageInterface
// Size: 0x28 (Inherited: 0x28)
struct UTurnablePageInterface : UInterface {
};

// Class Athena.QuestBookPageList
// Size: 0x48 (Inherited: 0x28)
struct UQuestBookPageList : UDataAsset {
	struct TArray<struct FPageReference> Pages; // 0x28(0x10)
	struct TArray<struct FStringAssetReference> InitialPages; // 0x38(0x10)
};

// Class Athena.QuestBook
// Size: 0xb80 (Inherited: 0x7e0)
struct AQuestBook : ASkeletalMeshWieldableItem {
	char UnknownData_7E0[0x18]; // 0x7e0(0x18)
	struct UInventoryItemComponent* InventoryItem; // 0x7f8(0x08)
	char UnknownData_800[0x10]; // 0x800(0x10)
	struct TMap<int32_t, struct UQuestBookPageLayout*> ProcPageCache; // 0x810(0x50)
	struct FQuestBookMaterialHandler MaterialHandler; // 0x860(0x140)
	float ExtraPageTurnDurationForForceRedraw; // 0x9a0(0x04)
	char UnknownData_9A4[0x4]; // 0x9a4(0x04)
	struct FQuestBookRepInfo ReplicationInfo; // 0x9a8(0x28)
	struct UQuestBookPageList* PageList; // 0x9d0(0x08)
	struct UClass* RemapperClass; // 0x9d8(0x08)
	struct UUsableWieldableComponent* UsableWieldableComponent; // 0x9e0(0x08)
	struct UDirectionalLightComponent* DirectionalLightComponent; // 0x9e8(0x08)
	float ShadowCascadeDistributionExponentWhenUsing; // 0x9f0(0x04)
	float ShadowCascadeDistributionExponentTransitionTime; // 0x9f4(0x04)
	char UnknownData_9F8[0x8]; // 0x9f8(0x08)
	float PageTurnDuration; // 0xa00(0x04)
	float PageTurnForceRedrawDuration; // 0xa04(0x04)
	char UnknownData_A08[0x150]; // 0xa08(0x150)
	int32_t PageWidth; // 0xb58(0x04)
	int32_t PageHeight; // 0xb5c(0x04)
	struct FQuestBookPageRenderer PageTextRenderer; // 0xb60(0x18)
	char UnknownData_B78[0x8]; // 0xb78(0x08)

	void Server_TurnToPage(int32_t Index); // Function Athena.QuestBook.Server_TurnToPage // Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate // @ game+0xe08050
	void OnRightSpreadRightPageCanvasUpdate(struct UCanvas* Canvas, int32_t Width, int32_t Height); // Function Athena.QuestBook.OnRightSpreadRightPageCanvasUpdate // Final|Native|Public // @ game+0xe065a0
	void OnRightSpreadLeftPageCanvasUpdate(struct UCanvas* Canvas, int32_t Width, int32_t Height); // Function Athena.QuestBook.OnRightSpreadLeftPageCanvasUpdate // Final|Native|Public // @ game+0xe064a0
	void OnRep_ReplicationInfo(struct FQuestBookRepInfo PreviousValue); // Function Athena.QuestBook.OnRep_ReplicationInfo // Final|Native|Public // @ game+0xe06120
	void OnLeftSpreadRightPageCanvasUpdate(struct UCanvas* Canvas, int32_t Width, int32_t Height); // Function Athena.QuestBook.OnLeftSpreadRightPageCanvasUpdate // Final|Native|Public // @ game+0xe053e0
	void OnLeftSpreadLeftPageCanvasUpdate(struct UCanvas* Canvas, int32_t Width, int32_t Height); // Function Athena.QuestBook.OnLeftSpreadLeftPageCanvasUpdate // Final|Native|Public // @ game+0xe052e0
	bool GetOwnersUseAltXMarkSetting(); // Function Athena.QuestBook.GetOwnersUseAltXMarkSetting // Final|Native|Public|BlueprintCallable // @ game+0xe03090
};

// Class Athena.QuestBookItemDesc
// Size: 0x128 (Inherited: 0x120)
struct UQuestBookItemDesc : UItemDesc {
	struct UQuestBookPageList* PageList; // 0x120(0x08)
};

// Class Athena.TaleQuestToolService
// Size: 0x170 (Inherited: 0x60)
struct UTaleQuestToolService : UTaleQuestService {
	struct UTaleQuestToolServiceDesc* ServiceDesc; // 0x60(0x08)
	struct TArray<struct UItemDesc*> WieldableDescs; // 0x68(0x10)
	char UnknownData_78[0xf8]; // 0x78(0xf8)

	void RemoveToolsFromAllParticipants(); // Function Athena.TaleQuestToolService.RemoveToolsFromAllParticipants // Final|Native|Public|BlueprintCallable // @ game+0x3f57fb0
	void GiveToolsToAllParticipants(); // Function Athena.TaleQuestToolService.GiveToolsToAllParticipants // Final|Native|Public|BlueprintCallable // @ game+0x3f55760
};

// Class Athena.BookTaleQuestService
// Size: 0x1c0 (Inherited: 0x170)
struct UBookTaleQuestService : UTaleQuestToolService {
	struct UBookTaleQuestServiceDesc* Desc; // 0x170(0x08)
	struct TArray<int32_t> BookContents; // 0x178(0x10)
	struct TArray<struct FPageLayoutRepInfo> ProcBookContents; // 0x188(0x10)
	struct TArray<int32_t> CurrentBookContents; // 0x198(0x10)
	struct UQuestBookItemDesc* QuestBookDesc; // 0x1a8(0x08)
	struct UClass* RemapperClass; // 0x1b0(0x08)
	char UnknownData_1B8[0x8]; // 0x1b8(0x08)
};

// Class Athena.TaleQuestToolServiceDesc
// Size: 0x30 (Inherited: 0x28)
struct UTaleQuestToolServiceDesc : UTaleQuestServiceDesc {
	bool GiveToolsOnStart; // 0x28(0x01)
	char UnknownData_29[0x7]; // 0x29(0x07)
};

// Class Athena.BookTaleQuestServiceDesc
// Size: 0x40 (Inherited: 0x30)
struct UBookTaleQuestServiceDesc : UTaleQuestToolServiceDesc {
	struct UClass* QuestBookDesc; // 0x30(0x08)
	struct UClass* RemapperClass; // 0x38(0x08)
};

// Class Athena.TreasureMap
// Size: 0x830 (Inherited: 0x7e0)
struct ATreasureMap : ASkeletalMeshWieldableItem {
	char UnknownData_7E0[0x10]; // 0x7e0(0x10)
	struct UWieldableItemCanvasRenderingComponent* WieldableCanvasRenderingComponent; // 0x7f0(0x08)
	struct UInventoryItemComponent* InventoryItem; // 0x7f8(0x08)
	struct UUsableWieldableComponent* UsableWieldableComponent; // 0x800(0x08)
	struct UZoomInOnWieldableItemComponent* ZoomInOnWieldableComponent; // 0x808(0x08)
	char UnknownData_810[0x11]; // 0x810(0x11)
	char QuestMapIcon; // 0x821(0x01)
	char UnknownData_822[0xe]; // 0x822(0x0e)
};

// Class Athena.BountyMap
// Size: 0x920 (Inherited: 0x830)
struct ABountyMap : ATreasureMap {
	int32_t CanvasWidth; // 0x828(0x04)
	int32_t CanvasHeight; // 0x82c(0x04)
	struct UFont* Font; // 0x830(0x08)
	float FontScale; // 0x838(0x04)
	float FontLineSpacingScale; // 0x83c(0x04)
	struct UBountyMapLayout* BountyMapLayout; // 0x848(0x08)
	struct FBountyMapContents Contents; // 0x850(0x68)
	struct FStringAssetReference MapInventoryTexturePath; // 0x8b8(0x10)
	float Rotation; // 0x8c8(0x04)
	char UnknownData_8CC[0x54]; // 0x8cc(0x54)

	void RefreshContents(); // Function Athena.BountyMap.RefreshContents // Final|Native|Public|BlueprintCallable // @ game+0xe07050
	void OnTextCanvasUpdate(struct UCanvas* Canvas, int32_t Width, int32_t Height); // Function Athena.BountyMap.OnTextCanvasUpdate // Final|Native|Private // @ game+0xe06820
	void OnRep_MapInventoryTexturePath(); // Function Athena.BountyMap.OnRep_MapInventoryTexturePath // Final|Native|Private // @ game+0xe06040
	void OnRep_Contents(struct FBountyMapContents InPreviousContents); // Function Athena.BountyMap.OnRep_Contents // Final|Native|Private|HasOutParms // @ game+0xe05cf0
};

// Class Athena.NonDisplaceableLargeStaticMeshWieldableItem
// Size: 0x7e0 (Inherited: 0x7e0)
struct ANonDisplaceableLargeStaticMeshWieldableItem : ALargeStaticMeshWieldableItem {
};

// Class Athena.BountyReward
// Size: 0x7e0 (Inherited: 0x7e0)
struct ABountyReward : ANonDisplaceableLargeStaticMeshWieldableItem {
};

// Class Athena.PuzzleStatueBaseAudioParamsDataAsset
// Size: 0x38 (Inherited: 0x28)
struct UPuzzleStatueBaseAudioParamsDataAsset : UDataAsset {
	struct UWwiseEvent* StatueActivated; // 0x28(0x08)
	struct UWwiseObjectPoolWrapper* PuzzleStatueAudioPool; // 0x30(0x08)
};

// Class Athena.BroadcasterPuzzleStatueAudioParamsDataAsset
// Size: 0x68 (Inherited: 0x28)
struct UBroadcasterPuzzleStatueAudioParamsDataAsset : UDataAsset {
	struct UWwiseEvent* BroadcasterInitiateReactionSequence; // 0x28(0x08)
	struct UWwiseEvent* SuccessHumStart; // 0x30(0x08)
	struct UWwiseEvent* SuccessHumStop; // 0x38(0x08)
	struct UWwiseEvent* SuccessWaterLevelUp; // 0x40(0x08)
	struct UWwiseEvent* SuccessWaterLevelDown; // 0x48(0x08)
	struct UWwiseEvent* SuccessGeneralActivation; // 0x50(0x08)
	struct UWwiseEvent* UnsuccessfulSequence; // 0x58(0x08)
	struct UWwiseEvent* ShockwaveEffect; // 0x60(0x08)
};

// Class Athena.BTDecorator_ActorWieldedItemCategory
// Size: 0xb8 (Inherited: 0x68)
struct UBTDecorator_ActorWieldedItemCategory : UBTDecorator_BaseConditional {
	float Interval; // 0x68(0x04)
	char UnknownData_6C[0x4]; // 0x6c(0x04)
	struct FBlackboardKeySelector BlackboardKey; // 0x70(0x28)
	struct UClass* ItemCategoryToTest; // 0x98(0x20)
};

// Class Athena.BTDecorator_ActorWieldedItemClass
// Size: 0xb8 (Inherited: 0x90)
struct UBTDecorator_ActorWieldedItemClass : UBTDecorator_BlackboardBase {
	float Interval; // 0x90(0x04)
	char UnknownData_94[0x4]; // 0x94(0x04)
	struct UClass* ItemClassToTest; // 0x98(0x20)
};

// Class Athena.BTDecorator_CanBlock
// Size: 0x68 (Inherited: 0x68)
struct UBTDecorator_CanBlock : UBTDecorator_BaseConditional {
};

// Class Athena.BTDecorator_CanRepair
// Size: 0x90 (Inherited: 0x68)
struct UBTDecorator_CanRepair : UBTDecorator_BaseConditional {
	struct FBlackboardKeySelector RepairActor; // 0x68(0x28)
};

// Class Athena.BTDecorator_ShouldCheatPauseBehavior
// Size: 0x68 (Inherited: 0x68)
struct UBTDecorator_ShouldCheatPauseBehavior : UBTDecorator_BaseConditional {
};

// Class Athena.BTDecorator_ShouldCurrentActionStatePauseBehavior
// Size: 0x68 (Inherited: 0x68)
struct UBTDecorator_ShouldCurrentActionStatePauseBehavior : UBTDecorator_BaseConditional {
};

// Class Athena.BTService_DetermineEngageTarget
// Size: 0xa8 (Inherited: 0x70)
struct UBTService_DetermineEngageTarget : UBTService {
	struct FBlackboardKeySelector BlockChangeEngageOptionKey; // 0x70(0x28)
	char UnknownData_98[0x10]; // 0x98(0x10)
};

// Class Athena.BTService_DetermineRecoveryMethod
// Size: 0xe0 (Inherited: 0x70)
struct UBTService_DetermineRecoveryMethod : UBTService {
	float TimeToForgetAfterSuccessfulFlee; // 0x70(0x04)
	char UnknownData_74[0x4]; // 0x74(0x04)
	struct AAthenaAICharacterController* CachedAICharacterController; // 0x78(0x08)
	char UnknownData_80[0x60]; // 0x80(0x60)

	void OnDamageTaken(struct FImpactDamageEvent Event); // Function Athena.BTService_DetermineRecoveryMethod.OnDamageTaken // Final|Native|Private|HasOutParms // @ game+0xe05000
};

// Class Athena.BTService_ObserveTargetMeleeAttacks
// Size: 0x188 (Inherited: 0x70)
struct UBTService_ObserveTargetMeleeAttacks : UBTService {
	struct FBlackboardKeySelector TargetActorKey; // 0x70(0x28)
	struct FBlackboardKeySelector IsTargetAttackingResultKey; // 0x98(0x28)
	char UnknownData_C0[0xc8]; // 0xc0(0xc8)

