// BlueprintGeneratedClass BP_Adv12_GoldChest_LargeOpen.BP_Adv12_GoldChest_LargeOpen_C
// Size: 0x418 (Inherited: 0x3c8)
struct ABP_Adv12_GoldChest_LargeOpen_C : AActor {
	struct UStaticMeshComponent* StaticMesh7; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x3f8(0x08)
	struct UStaticMeshComponent* frt_coin_01_a; // 0x400(0x08)
	struct UStaticMeshComponent* GoldPile; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x410(0x08)

	void UserConstructionScript(); // Function BP_Adv12_GoldChest_LargeOpen.BP_Adv12_GoldChest_LargeOpen_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

