// AnimBlueprintGeneratedClass BP_Anim_PocketWatch.BP_Anim_PocketWatch_C
// Size: 0x930 (Inherited: 0x680)
struct UBP_Anim_PocketWatch_C : UPocketWatchAnimationInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x680(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_145781B74CB981C0702ED8B9251958AA; // 0x688(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_162C0B904DCC64AAAA8A9388874E4F8E; // 0x6d0(0x60)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_583A8DB8444EA710DDE27BAC368CF160; // 0x730(0x50)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_0502387A43E8E456FE203EB459BF8B6F; // 0x780(0x90)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_A5445CFC40F4EA80BBEF01BDB9FF4FF3; // 0x810(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_0D092AFC452D6A23AF085F862B4C1F69; // 0x858(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5DDE63DE437F4BA5BA226F98CBE4548E; // 0x8a0(0x90)

	void ExecuteUbergraph_BP_Anim_PocketWatch(int32_t EntryPoint); // Function BP_Anim_PocketWatch.BP_Anim_PocketWatch_C.ExecuteUbergraph_BP_Anim_PocketWatch //  // @ game+0x1848130
};

