// AnimBlueprintGeneratedClass BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C
// Size: 0x1d50 (Inherited: 0x660)
struct UBP_Anim_Castaway_Base_C : UNPCAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x660(0x08)
	struct FAnimNode_HIKSolve AnimGraphNode_HIKSolve_B870D3484A54BD831E03239036608C7F; // 0x668(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_599338654CCF86A421F3C68F2F00CF65; // 0x6e8(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8F3474004A89AD3A84824AA8B44CDD7E; // 0x730(0x48)
	struct FAnimNode_HIKLookAt AnimGraphNode_HIKLookAt_2582C8C64614883605C1E592EA3CE41D; // 0x778(0x88)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B7D7BFE443C78A4DB09BF2954F9FB2A7; // 0x800(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1590FC9B424009158EB4CD81148B9C41; // 0x840(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3F28B3CF423C1190623B60A13F607335; // 0x880(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43F9A72248609D19E5705EA6BAB1F30C; // 0x8c0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87E5518C4493614D709ADCBB10100CF5; // 0x900(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AFE99B244EDF78E44038A687CE9DACD7; // 0x940(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7C8989714AD1ACE3E3E052B27235B0BB; // 0x980(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8A25DCAC47B44029B70F88AF3F5A5C54; // 0x9c0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30C5D665441234F12947C383078A8A68; // 0xa00(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F745863A43BD24C6D469ADB62F2DCCEA; // 0xa40(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5AE082B84A607B0DFF0D5C8E7AC5DECC; // 0xa80(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_269309D3407497D6420FD886C69BE95B; // 0xae0(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_0502F6954CD4F84885DE03B203FAA8F6; // 0xb28(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B18FE85B4ADCBEAB2174A7857612C92D; // 0xb88(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_341236BF4A81EBAA5A49EDB86EC42020; // 0xbd0(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_674A6619431A6BBD4596DABD67671419; // 0xc78(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_CF69FE604FFB8ACD4F7C6A8525896858; // 0xcc0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_86A6275B4A5BA192F44B0FA218DF6A6A; // 0xd20(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_09CEE3C24178A5605CCF648191962615; // 0xd68(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A291661E44C69BA0E4EF43964E4A6942; // 0xda8(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_B6B48F6B40274EB5526E73911EB2F649; // 0xde8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_6673CFE14C2EE62CCE3294A742F35812; // 0xe48(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_029EE12A4EF80CF396A5BA8003D57382; // 0xe90(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_4F05CBB143B076B163966AA6906E1FB9; // 0xef0(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_D238362B487C43917B613DBA962EEC64; // 0xf38(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_B40EA37F4A864F9446DE8997ECE0B8F5; // 0xfe0(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_398B14A14CE7DAC59E4F638FF1F7E2B9; // 0x1028(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_AC3CBAAC4C827FD479924A86438256D2; // 0x1088(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_BC0AAFE64F928C6D83C3CD845DE4392F; // 0x10d0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AEFCE8034CC275366AE4CDA1DE42244B; // 0x1110(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_D57BDD0C44F5E9BCE148F7B8CD76E643; // 0x1150(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_D77106F5421C70FDBB57609104AB457F; // 0x11b0(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_09547AC4474E920370C08B9CCA7EDEFA; // 0x11f8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_DBBA67C647C2061BFA1797AFE9BF99E0; // 0x1258(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4015BE5C46E0BF7E41E53C9658B209E1; // 0x12a0(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_8354546645EA8B119354CEA64CC8BDC0; // 0x1348(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_EC197C9A494FDFB662CE46B25CD8705D; // 0x1390(0xa8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_A00956D646F4BA2F5FD5CDAACCE20689; // 0x1438(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_F003585A412F4A022E2B3D801D9B08AA; // 0x14e8(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_418F9EBB4BAF6C7DCF3AFAAF73FA5A28; // 0x1548(0x60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4FC478154142A96F7275D59808FE7214; // 0x15a8(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24175F364A9813D7180BFF8022E13EDD; // 0x1658(0x60)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_C60473CE417CD6AEB18505A864F11072; // 0x16b8(0x70)
	struct FAnimNode_Slot AnimGraphNode_Slot_E016A2A74E8ABDCAC3CAF19029B2074C; // 0x1728(0x60)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose_C9B05CC14452668E257F5E8820B6F305; // 0x1788(0x38)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3615CAE647A49133A333B69073BF0703; // 0x17c0(0x90)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_AE43B0854184603482291BAAD8BD6B2A; // 0x1850(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root_2CC695EE42F957B8FB84CB90DD12357F; // 0x1900(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6D2E367F40EFD8A1114E46AB263E8F2F; // 0x1948(0x90)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4435C7694F94F5E5C0C9FE87B4E923E4; // 0x19d8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50103564484D4471E09CC58845E868DF; // 0x1a20(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3FD2E5FD440BF97EBE3CBB95FBC08C88; // 0x1a68(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_CF7443674316BE65F42930827FDAC41C; // 0x1ab0(0x60)
	struct FAnimationNode_TwoWayBlend AnimGraphNode_TwoWayBlend_DC67B22C43FE5B3ACF584D8F6C947179; // 0x1b10(0x70)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3DCF2F2743B292DCCAA5849ABDE22B02; // 0x1b80(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_0F5460ED406658E5F6DC8EB9B38FA9B5; // 0x1bc8(0x60)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_B53112D04F420ED411D2D4834653EB93; // 0x1c28(0x70)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose_BBAE480D4EB6C571F7DADE8874A05AF2; // 0x1c98(0x38)
	struct FAnimNode_Slot AnimGraphNode_Slot_4BE4FEE94EB433778EE56398000D22F5; // 0x1cd0(0x60)
	float LookAtChest; // 0x1d30(0x04)
	struct FVector2D LookAtAngleClamp; // 0x1d34(0x08)
	char LookAtClamp; // 0x1d3c(0x01)
	char UnknownData_1D3D[0x3]; // 0x1d3d(0x03)
	float LookAtActivationSpeed; // 0x1d40(0x04)
	float LookAtTargetPositionSpeed; // 0x1d44(0x04)
	bool AnimgraphStarted; // 0x1d48(0x01)
	bool IsPhased; // 0x1d49(0x01)
	char UnknownData_1D4A[0x2]; // 0x1d4a(0x02)
	float SequencerBlendWeight; // 0x1d4c(0x04)

	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_B7D7BFE443C78A4DB09BF2954F9FB2A7(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_B7D7BFE443C78A4DB09BF2954F9FB2A7 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_1590FC9B424009158EB4CD81148B9C41(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_1590FC9B424009158EB4CD81148B9C41 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_3F28B3CF423C1190623B60A13F607335(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_3F28B3CF423C1190623B60A13F607335 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_43F9A72248609D19E5705EA6BAB1F30C(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_43F9A72248609D19E5705EA6BAB1F30C // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_87E5518C4493614D709ADCBB10100CF5(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_87E5518C4493614D709ADCBB10100CF5 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_7C8989714AD1ACE3E3E052B27235B0BB(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_7C8989714AD1ACE3E3E052B27235B0BB // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_30C5D665441234F12947C383078A8A68(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_30C5D665441234F12947C383078A8A68 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_F745863A43BD24C6D469ADB62F2DCCEA(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_F745863A43BD24C6D469ADB62F2DCCEA // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_09CEE3C24178A5605CCF648191962615(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_09CEE3C24178A5605CCF648191962615 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_A291661E44C69BA0E4EF43964E4A6942(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_A291661E44C69BA0E4EF43964E4A6942 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_BC0AAFE64F928C6D83C3CD845DE4392F(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_BC0AAFE64F928C6D83C3CD845DE4392F // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_AEFCE8034CC275366AE4CDA1DE42244B(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_Castaway_Base_AnimGraphNode_TransitionResult_AEFCE8034CC275366AE4CDA1DE42244B // BlueprintEvent // @ game+0x1848130
	void AnimNotify_StartLookat(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_StartLookat // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_StopLookAt(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_StopLookAt // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_IdleVariantChange(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_IdleVariantChange // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_InactiveVariantChange(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_InactiveVariantChange // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_InteractVariantChange(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_InteractVariantChange // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void BlueprintInitializeAnimation(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.BlueprintInitializeAnimation // Event|Public|BlueprintEvent // @ game+0x1848130
	void AnimNotify_NPCLookAtOn(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_NPCLookAtOn // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_NPCLookAtOff(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_NPCLookAtOff // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_EnteredNull(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_EnteredNull // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_EnteredOneShot(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_EnteredOneShot // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_EnteredContinuousOut(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_EnteredContinuousOut // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_EnteredContinuousLoopB(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_EnteredContinuousLoopB // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_EnteredContinuousLoopA(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_EnteredContinuousLoopA // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_EnteredContinuousIn(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_EnteredContinuousIn // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_NPCSelectNewCustomAnim_B(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_NPCSelectNewCustomAnim_B // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_NPCSelectNewCustomAnim_A(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_NPCSelectNewCustomAnim_A // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_NPCDeactivateCustomAnimSequence(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_NPCDeactivateCustomAnimSequence // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_DetachSocketB(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_RH_DetachSocketB // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_DetachSocketB(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_LH_DetachSocketB // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_DetachSocketA(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_RH_DetachSocketA // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_DetachSocketA(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_LH_DetachSocketA // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_11(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_LH_UseItem_11 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_10(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_LH_UseItem_10 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_9(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_LH_UseItem_9 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_8(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_LH_UseItem_8 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_7(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_LH_UseItem_7 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_6(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_LH_UseItem_6 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_11(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_RH_UseItem_11 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_10(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_RH_UseItem_10 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_9(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_RH_UseItem_9 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_8(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_RH_UseItem_8 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_7(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_RH_UseItem_7 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_6(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_RH_UseItem_6 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_AttachItem(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_RH_AttachItem // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_AttachItem(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_LH_AttachItem // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_DetachItem(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_LH_DetachItem // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_DetachItem(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_RH_DetachItem // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_DestroyItem(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_RH_DestroyItem // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_5(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_RH_UseItem_5 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_4(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_RH_UseItem_4 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_3(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_RH_UseItem_3 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_2(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_RH_UseItem_2 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_DestroyItem(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_LH_DestroyItem // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_5(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_LH_UseItem_5 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_4(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_LH_UseItem_4 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_3(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_LH_UseItem_3 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_2(); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.AnimNotify_LH_UseItem_2 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void ExecuteUbergraph_BP_Anim_Castaway_Base(int32_t EntryPoint); // Function BP_Anim_Castaway_Base.BP_Anim_Castaway_Base_C.ExecuteUbergraph_BP_Anim_Castaway_Base //  // @ game+0x1848130
};

