// AnimBlueprintGeneratedClass BP_Anim_NPC.BP_Anim_NPC_C
// Size: 0x252c (Inherited: 0x660)
struct UBP_Anim_NPC_C : UNPCAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x660(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_CC0F517F411B725672C89F97D055CD8C; // 0x668(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_DB4CA2A8483081005AE969A53CAC797B; // 0x6b0(0x48)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_F15BC1CD4F69693D74DF68BD1C006469; // 0x6f8(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B7D7BFE443C78A4DB09BF2954F9FB2A7; // 0x740(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1590FC9B424009158EB4CD81148B9C41; // 0x780(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3F28B3CF423C1190623B60A13F607335; // 0x7c0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43F9A72248609D19E5705EA6BAB1F30C; // 0x800(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87E5518C4493614D709ADCBB10100CF5; // 0x840(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AFE99B244EDF78E44038A687CE9DACD7; // 0x880(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7C8989714AD1ACE3E3E052B27235B0BB; // 0x8c0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8A25DCAC47B44029B70F88AF3F5A5C54; // 0x900(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3D19FCA04904447F6C076589A599394B; // 0x940(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4610264341D118917106CD823FFFF791; // 0x980(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A746724D4C0CD8B52E10F1BB04DFF69C; // 0x9c0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30C5D665441234F12947C383078A8A68; // 0xa00(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F168FA1B49B5E9B7C45EA2AB87EB52C5; // 0xa40(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F745863A43BD24C6D469ADB62F2DCCEA; // 0xa80(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84433A844303C3523C9CB18CF185EA51; // 0xac0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B26560374147BD1FF497FA98EFD1F5EF; // 0xb00(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3B4D9C0C43527207B43F6D96684982B3; // 0xb40(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_05BE548B4AB21BE8EC9899B205D19AAF; // 0xba0(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A3258A6E475175DA5E5D5EAEB7FA8DD2; // 0xbe8(0x40)
	struct FAnimNode_Root AnimGraphNode_StateResult_994E3755478BD24BF35FA29984048D95; // 0xc28(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_A1A96C8F4FA0C88004FEA9B193BBC6D7; // 0xc70(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_269309D3407497D6420FD886C69BE95B; // 0xcd0(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_0502F6954CD4F84885DE03B203FAA8F6; // 0xd18(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_B18FE85B4ADCBEAB2174A7857612C92D; // 0xd78(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_341236BF4A81EBAA5A49EDB86EC42020; // 0xdc0(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_674A6619431A6BBD4596DABD67671419; // 0xe68(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_CF69FE604FFB8ACD4F7C6A8525896858; // 0xeb0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_86A6275B4A5BA192F44B0FA218DF6A6A; // 0xf10(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_09CEE3C24178A5605CCF648191962615; // 0xf58(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_A291661E44C69BA0E4EF43964E4A6942; // 0xf98(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9927E3AE4B82AE003E8B6681B2E08309; // 0xfd8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_6673CFE14C2EE62CCE3294A742F35812; // 0x1038(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_029EE12A4EF80CF396A5BA8003D57382; // 0x1080(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_4F05CBB143B076B163966AA6906E1FB9; // 0x10e0(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_D238362B487C43917B613DBA962EEC64; // 0x1128(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_B40EA37F4A864F9446DE8997ECE0B8F5; // 0x11d0(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_398B14A14CE7DAC59E4F638FF1F7E2B9; // 0x1218(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_AC3CBAAC4C827FD479924A86438256D2; // 0x1278(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_BC0AAFE64F928C6D83C3CD845DE4392F; // 0x12c0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AEFCE8034CC275366AE4CDA1DE42244B; // 0x1300(0x40)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4E02885E41EFF57B50C89389FF9A70BC; // 0x1340(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_D77106F5421C70FDBB57609104AB457F; // 0x13a0(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_09547AC4474E920370C08B9CCA7EDEFA; // 0x13e8(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_DBBA67C647C2061BFA1797AFE9BF99E0; // 0x1448(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4015BE5C46E0BF7E41E53C9658B209E1; // 0x1490(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_8354546645EA8B119354CEA64CC8BDC0; // 0x1538(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_C763590A483F16E9BD14DBB536CFD110; // 0x1580(0xa8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_B01736E249D02A7A50013BA31AE82AEC; // 0x1628(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_FF79273E485B4C8A75CFCDB0E540C69E; // 0x16d8(0x60)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_C348971345D740C3F82C24BFD13DDA32; // 0x1738(0x60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3605DB2347D87DAB07D71689DAED9555; // 0x1798(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_703687174F6C196F2901F8BAA40C82DD; // 0x1848(0x60)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5E45BFF44F839400DAA435B59106C66D; // 0x18a8(0x70)
	struct FAnimNode_Slot AnimGraphNode_Slot_7C162ECF4702D2CE39493CA7608F24D0; // 0x1918(0x60)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose_D4AF3AA84E5F259FD5772B88A723568C; // 0x1978(0x38)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_705E0F60499C6D0BAE87BE8D0087F8D2; // 0x19b0(0x90)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_38A355404EEEE5988EB14899B8FB3045; // 0x1a40(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18AEA2AD4F158A8E398DEAAC6159E79E; // 0x1af0(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_FF9F244A42EF749107F65C9141FF19E2; // 0x1b38(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3FB73333442254CF3E647297B442A16A; // 0x1be8(0x90)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9FA7439E42A411590479CDAB19464071; // 0x1c78(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_EFB05AEE4D8E1C17D6047FA396129830; // 0x1cc0(0x48)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose_5EE7533F425E2DFA7F2F558B7CAEB50E; // 0x1d08(0x38)
	struct FAnimNode_Slot AnimGraphNode_Slot_DCCF4EB04FDD34507DD0BBB448559B7B; // 0x1d40(0x60)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3D9B5DDE40D2FDE6447ED696604352C6; // 0x1da0(0x70)
	struct FAnimNode_LookAt AnimGraphNode_LookAt_13811D2548C7C738C99252B987D3FEA2; // 0x1e10(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_A3540FCC449ED4AAB0CC35BDA5CCDF47; // 0x1ed0(0x60)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19EA5C084C2AEAF50E64748A67BADB2A; // 0x1f30(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_EDD4330443560D0673BD84AA1D990CEB; // 0x1f78(0x60)
	struct FAnimationNode_TwoWayBlend AnimGraphNode_TwoWayBlend_E696D0D546FDF2507811E296D8BE2B20; // 0x1fd8(0x70)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16533A254AD77BDBF800A094871EAA46; // 0x2048(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_B9902A3344E24EB66E68AC8A1A932B3C; // 0x2090(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_82CD0E0640515F0593CE71ACB0D99445; // 0x20d8(0x60)
	struct FAnimationNode_TwoWayBlend AnimGraphNode_TwoWayBlend_E419C33B4AC3358D589293A0C38A35D5; // 0x2138(0x70)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_DA05FBB04F2EF2BC6D0B1E9DC0803A80; // 0x21a8(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_C64B77DB48A6BF510CA4CC91D39D000B; // 0x2248(0x60)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_44886E69456064337B591C91521B7085; // 0x22a8(0x90)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_652FAB764D849C5724506598AFE546AA; // 0x2338(0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5D029C224624BD4340B5569482C9F3C5; // 0x2380(0x50)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_493028E843E3C45C7ED90F9AB93D4EDC; // 0x23d0(0x90)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_0C52C9BC4B460CA07F71F4B974C83295; // 0x2460(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_27EF6921461329726514F59861EE4F37; // 0x24a8(0x48)
	struct FVector2D LookAtAngleClamp; // 0x24f0(0x08)
	bool AnimgraphStarted; // 0x24f8(0x01)
	char UnknownData_24F9[0x3]; // 0x24f9(0x03)
	float LookAtActivationSpeed; // 0x24fc(0x04)
	float LookAtTargetPositionSpeed; // 0x2500(0x04)
	bool IsPhased; // 0x2504(0x01)
	char UnknownData_2505[0x3]; // 0x2505(0x03)
	float Look At Clamp; // 0x2508(0x04)
	bool Is Playing Sequencer Anim; // 0x250c(0x01)
	char UnknownData_250D[0x3]; // 0x250d(0x03)
	float SequencerBlendWeight; // 0x2510(0x04)
	bool OverrideHeadLookAtOnOff; // 0x2514(0x01)
	char UnknownData_2515[0x3]; // 0x2515(0x03)
	float AnimationBlendWeight; // 0x2518(0x04)
	float FacialOverride; // 0x251c(0x04)
	float HeadRotationX; // 0x2520(0x04)
	float HeadRotationY; // 0x2524(0x04)
	float HeadRotationZ; // 0x2528(0x04)

	void PlayItemAnimation(); // Function BP_Anim_NPC.BP_Anim_NPC_C.PlayItemAnimation // Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_B7D7BFE443C78A4DB09BF2954F9FB2A7(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_B7D7BFE443C78A4DB09BF2954F9FB2A7 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_1590FC9B424009158EB4CD81148B9C41(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_1590FC9B424009158EB4CD81148B9C41 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_3F28B3CF423C1190623B60A13F607335(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_3F28B3CF423C1190623B60A13F607335 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_43F9A72248609D19E5705EA6BAB1F30C(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_43F9A72248609D19E5705EA6BAB1F30C // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_87E5518C4493614D709ADCBB10100CF5(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_87E5518C4493614D709ADCBB10100CF5 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_7C8989714AD1ACE3E3E052B27235B0BB(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_7C8989714AD1ACE3E3E052B27235B0BB // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_3D19FCA04904447F6C076589A599394B(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_3D19FCA04904447F6C076589A599394B // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_A746724D4C0CD8B52E10F1BB04DFF69C(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_A746724D4C0CD8B52E10F1BB04DFF69C // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_30C5D665441234F12947C383078A8A68(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_30C5D665441234F12947C383078A8A68 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_F168FA1B49B5E9B7C45EA2AB87EB52C5(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_F168FA1B49B5E9B7C45EA2AB87EB52C5 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_F745863A43BD24C6D469ADB62F2DCCEA(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_F745863A43BD24C6D469ADB62F2DCCEA // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_84433A844303C3523C9CB18CF185EA51(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_84433A844303C3523C9CB18CF185EA51 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_09CEE3C24178A5605CCF648191962615(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_09CEE3C24178A5605CCF648191962615 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_A291661E44C69BA0E4EF43964E4A6942(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_A291661E44C69BA0E4EF43964E4A6942 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_BC0AAFE64F928C6D83C3CD845DE4392F(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_BC0AAFE64F928C6D83C3CD845DE4392F // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_AEFCE8034CC275366AE4CDA1DE42244B(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_TransitionResult_AEFCE8034CC275366AE4CDA1DE42244B // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_BlendListByBool_38A355404EEEE5988EB14899B8FB3045(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_BlendListByBool_38A355404EEEE5988EB14899B8FB3045 // BlueprintEvent // @ game+0x1848130
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_ModifyBone_493028E843E3C45C7ED90F9AB93D4EDC(); // Function BP_Anim_NPC.BP_Anim_NPC_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Anim_NPC_AnimGraphNode_ModifyBone_493028E843E3C45C7ED90F9AB93D4EDC // BlueprintEvent // @ game+0x1848130
	void AnimNotify_StartLookat(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_StartLookat // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_StopLookAt(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_StopLookAt // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_IdleVariantChange(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_IdleVariantChange // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_InactiveVariantChange(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_InactiveVariantChange // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_InteractVariantChange(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_InteractVariantChange // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void BlueprintInitializeAnimation(); // Function BP_Anim_NPC.BP_Anim_NPC_C.BlueprintInitializeAnimation // Event|Public|BlueprintEvent // @ game+0x1848130
	void AnimNotify_NPCLookAtOn(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_NPCLookAtOn // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_NPCLookAtOff(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_NPCLookAtOff // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_CompletedReactionResponse(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_CompletedReactionResponse // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_EnteredNull(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_EnteredNull // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_EnteredOneShot(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_EnteredOneShot // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_EnteredContinuousOut(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_EnteredContinuousOut // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_EnteredContinuousLoopB(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_EnteredContinuousLoopB // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_EnteredContinuousLoopA(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_EnteredContinuousLoopA // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_EnteredContinuousIn(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_EnteredContinuousIn // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_NPCSelectNewCustomAnim_B(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_NPCSelectNewCustomAnim_B // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_NPCSelectNewCustomAnim_A(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_NPCSelectNewCustomAnim_A // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_NPCDeactivateCustomAnimSequence(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_NPCDeactivateCustomAnimSequence // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_DetachSocketB(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_RH_DetachSocketB // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_DetachSocketB(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_LH_DetachSocketB // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_DetachSocketA(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_RH_DetachSocketA // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_DetachSocketA(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_LH_DetachSocketA // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_11(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_LH_UseItem_11 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_10(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_LH_UseItem_10 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_9(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_LH_UseItem_9 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_8(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_LH_UseItem_8 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_7(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_LH_UseItem_7 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_6(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_LH_UseItem_6 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_11(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_RH_UseItem_11 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_10(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_RH_UseItem_10 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_9(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_RH_UseItem_9 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_8(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_RH_UseItem_8 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_7(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_RH_UseItem_7 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_6(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_RH_UseItem_6 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_AttachItem(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_RH_AttachItem // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_AttachItem(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_LH_AttachItem // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_DetachItem(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_LH_DetachItem // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_DetachItem(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_RH_DetachItem // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_DestroyItem(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_RH_DestroyItem // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_5(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_RH_UseItem_5 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_4(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_RH_UseItem_4 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_3(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_RH_UseItem_3 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_RH_UseItem_2(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_RH_UseItem_2 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_DestroyItem(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_LH_DestroyItem // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_5(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_LH_UseItem_5 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_4(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_LH_UseItem_4 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_3(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_LH_UseItem_3 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_LH_UseItem_2(); // Function BP_Anim_NPC.BP_Anim_NPC_C.AnimNotify_LH_UseItem_2 // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void ExecuteUbergraph_BP_Anim_NPC(int32_t EntryPoint); // Function BP_Anim_NPC.BP_Anim_NPC_C.ExecuteUbergraph_BP_Anim_NPC //  // @ game+0x1848130
};

