// BlueprintGeneratedClass BP_AudioBoatMediumHullAmbi.BP_AudioBoatMediumHullAmbi_C
// Size: 0x718 (Inherited: 0x638)
struct ABP_AudioBoatMediumHullAmbi_C : AShipHullAudio {
	struct UTritonComponent* Triton; // 0x638(0x08)
	struct UShipAudioEmitterComponent* audio_water_laps_FL; // 0x640(0x08)
	struct UShipAudioEmitterComponent* audio_water_laps_FR; // 0x648(0x08)
	struct UShipAudioEmitterComponent* audio_creak_metal2; // 0x650(0x08)
	struct UShipAudioEmitterComponent* audio_creak_metal; // 0x658(0x08)
	struct UShipAudioEmitterComponent* audio_creak_window; // 0x660(0x08)
	struct UShipAudioEmitterComponent* audio_creak_cabin_04; // 0x668(0x08)
	struct UShipAudioEmitterComponent* audio_creak_cabin_03; // 0x670(0x08)
	struct UShipAudioEmitterComponent* audio_creak_cabin_02; // 0x678(0x08)
	struct UShipAudioEmitterComponent* audio_creak_cabin_01; // 0x680(0x08)
	struct UShipAudioEmitterComponent* audio_creak_map_01; // 0x688(0x08)
	struct UShipAudioEmitterComponent* audio_creak_map_continuous; // 0x690(0x08)
	struct UShipAudioEmitterComponent* audio_creak_map_02; // 0x698(0x08)
	struct UShipAudioEmitterComponent* audio_creak_deck_back; // 0x6a0(0x08)
	struct UAudioPortalComponent* DeckGrille; // 0x6a8(0x08)
	struct UAudioPortalComponent* DeckGrille2; // 0x6b0(0x08)
	struct UShipAudioEmitterComponent* audio_creak_mast_rear; // 0x6b8(0x08)
	struct UShipAudioEmitterComponent* audio_wake_stern; // 0x6c0(0x08)
	struct UShipAudioEmitterComponent* audio_wake_bow; // 0x6c8(0x08)
	struct UShipAudioEmitterComponent* audio_wake_side_L; // 0x6d0(0x08)
	struct UShipAudioEmitterComponent* audio_wake_side_R; // 0x6d8(0x08)
	struct UShipAudioEmitterComponent* audio_creak_mast_front_nest; // 0x6e0(0x08)
	struct UShipAudioEmitterComponent* audio_creak_mast_front; // 0x6e8(0x08)
	struct UShipAudioEmitterComponent* audio_creak_FL; // 0x6f0(0x08)
	struct UShipAudioEmitterComponent* audio_creak_FR; // 0x6f8(0x08)
	struct UShipAudioEmitterComponent* audio_creak_rope_front; // 0x700(0x08)
	struct UShipAudioEmitterComponent* audio_creak_smallship_global; // 0x708(0x08)
	struct UAudioPortalComponent* Deckgrille3; // 0x710(0x08)

	void UserConstructionScript(); // Function BP_AudioBoatMediumHullAmbi.BP_AudioBoatMediumHullAmbi_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

