// AnimBlueprintGeneratedClass BP_Anim_Wheel.BP_Anim_Wheel_C
// Size: 0x1010 (Inherited: 0x4a0)
struct UBP_Anim_Wheel_C : UWheelAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4a0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_892B6A7C4B85B67AF6464BA18E8F3C2C; // 0x4a8(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2A80EF124893FAC12AC8A8BF41008B56; // 0x4f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21CCE9AD4BF57BA736F25F95E12A0B01; // 0x530(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_420A13334A6C293921BDD490D607E734; // 0x570(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_0690ECD24CE6389D8F17DC98C79D1280; // 0x5b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F72ED6C647826C68231A5B8E38A021E7; // 0x5f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_D69A499E4634B73C76F9B5A7706CAB4C; // 0x630(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E6460BB0495D3A823EF5D9BC7B37A244; // 0x670(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B211D75C4C7B09769BBA4FB78D2656B2; // 0x6b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_E8A89675475DA7ABCFC2859C568222BD; // 0x6f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C74337C849201E0ABA4A0CBDD6459507; // 0x730(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_EC18207140787920FF0276B07EFB03F1; // 0x770(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_C364794348A9C3084D696695091587E0; // 0x7b0(0x40)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_545465A740F89C2E391B4EA808A0FC3F; // 0x7f0(0x50)
	struct FAnimNode_Root AnimGraphNode_StateResult_5E14F98B488F19A0FCC39BA6444A67FC; // 0x840(0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_26F0FFA447BB35DCEDA057AE6C576772; // 0x888(0x50)
	struct FAnimNode_Root AnimGraphNode_StateResult_65FE90FF4DE45DEDF883B5B52E0B5657; // 0x8d8(0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_33334F9A45500ADB280727B13F259D69; // 0x920(0x50)
	struct FAnimNode_Root AnimGraphNode_StateResult_06DE574C4238AAB4BA787199565725A7; // 0x970(0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_FB0902154D63E3BD877180A50A37AF1A; // 0x9b8(0x50)
	struct FAnimNode_Root AnimGraphNode_StateResult_5102A1DA42ABD0E41F428586689B727D; // 0xa08(0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_FAC6E2854EE497866B40BC8987E087E1; // 0xa50(0x50)
	struct FAnimNode_Root AnimGraphNode_StateResult_8526A7D24D04575947D8E1AE66B1B259; // 0xaa0(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_D4165F1A4ED5A872C75BE48AE852E17B; // 0xae8(0xa8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_03C8E31B4A5FE10716B21EB7651ED4B1; // 0xb90(0x90)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1CFDA46047F20A6031E790B1783DB1A3; // 0xc20(0x48)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_012A8AC4413A87A0DD41079388F1E3D5; // 0xc68(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3229425C45FE80A02002C59DA82C7B00; // 0xcb0(0x90)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_309D671B48784B9F1B05E482521FC5BD; // 0xd40(0x90)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_91FF84C34EB2F91D0C059196B78AA1FE; // 0xdd0(0x90)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3E8D552246D760A7EDFC7DB2E16CA9C6; // 0xe60(0x90)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_41A9D55B421A1C69CCB7BF9070C34B85; // 0xef0(0x90)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_AB135DD947B12E21A9FB21A6A5E947EA; // 0xf80(0x90)

	void ExecuteUbergraph_BP_Anim_Wheel(int32_t EntryPoint); // Function BP_Anim_Wheel.BP_Anim_Wheel_C.ExecuteUbergraph_BP_Anim_Wheel //  // @ game+0x1848130
};

