// BlueprintGeneratedClass BP_AudioBoatSmallHullAmbi.BP_AudioBoatSmallHullAmbi_C
// Size: 0x700 (Inherited: 0x638)
struct ABP_AudioBoatSmallHullAmbi_C : AShipHullAudio {
	struct UTritonComponent* Triton; // 0x638(0x08)
	struct UShipAudioEmitterComponent* audio_wake_stern; // 0x640(0x08)
	struct UShipAudioEmitterComponent* audio_wake_bow; // 0x648(0x08)
	struct UShipAudioEmitterComponent* audio_wake_side_L; // 0x650(0x08)
	struct UShipAudioEmitterComponent* audio_wake_side_R; // 0x658(0x08)
	struct UShipAudioEmitterComponent* audio_creak_nest; // 0x660(0x08)
	struct UShipAudioEmitterComponent* audio_creak_mast; // 0x668(0x08)
	struct UShipAudioEmitterComponent* audio_creak_FL; // 0x670(0x08)
	struct UShipAudioEmitterComponent* audio_creak_FR; // 0x678(0x08)
	struct UShipAudioEmitterComponent* audio_creak_rope_front; // 0x680(0x08)
	struct UShipAudioEmitterComponent* audio_creak_brig_03; // 0x688(0x08)
	struct UShipAudioEmitterComponent* audio_creak_brig_02; // 0x690(0x08)
	struct UShipAudioEmitterComponent* audio_creak_rope_back; // 0x698(0x08)
	struct UShipAudioEmitterComponent* audio_creak_brig_01; // 0x6a0(0x08)
	struct UShipAudioEmitterComponent* audio_creak_cabin_04; // 0x6a8(0x08)
	struct UShipAudioEmitterComponent* audio_creak_cabin_03; // 0x6b0(0x08)
	struct UShipAudioEmitterComponent* audio_creak_cabin_02; // 0x6b8(0x08)
	struct UShipAudioEmitterComponent* audio_creak_cabin_01; // 0x6c0(0x08)
	struct UShipAudioEmitterComponent* audio_creak_smallship_global; // 0x6c8(0x08)
	struct UAudioPortalComponent* DeckGrille; // 0x6d0(0x08)
	struct UAudioPortalComponent* BrigDeck; // 0x6d8(0x08)
	struct UAudioPortalComponent* CaptainsCabin_Left; // 0x6e0(0x08)
	struct UAudioPortalComponent* CaptainsCabin_Right; // 0x6e8(0x08)
	struct UAudioPortalComponent* CaptainsCabin_Back; // 0x6f0(0x08)
	struct UAudioPortalComponent* TopToCaptainsCabin; // 0x6f8(0x08)

	void UserConstructionScript(); // Function BP_AudioBoatSmallHullAmbi.BP_AudioBoatSmallHullAmbi_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

