// AnimBlueprintGeneratedClass BP_Anim_OceanCrawler_Hermit.BP_Anim_OceanCrawler_Hermit_C
// Size: 0x1c88 (Inherited: 0x720)
struct UBP_Anim_OceanCrawler_Hermit_C : UOceanCrawlerAnimationInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x720(0x08)
	struct FAnimNode_Root AnimGraphNode_Root_F7D49BAC4A5036196272C69872EE0BB4; // 0x728(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_D1A9D90D4A7F93B6222071AE34409618; // 0x770(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65F8F9274381AF07697435AF5F3C6CCE; // 0x7b0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8E8AB5AA4C5E9598F2F1728C4DDAD70F; // 0x7f0(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1D9B659D42E2C7BFFF4BE4B41E8ACA78; // 0x830(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_06E25EE14553B0A77B1A99A9B986AD61; // 0x870(0x40)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_D68E89864BCB8101566481A81D480C36; // 0x8b0(0x110)
	struct FAnimNode_Root AnimGraphNode_StateResult_BF535E434269792F08D9C0BBB40CD6C3; // 0x9c0(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9DAC990B4EAA16EF02A58DBE8BD040A6; // 0xa08(0x110)
	struct FAnimNode_Root AnimGraphNode_StateResult_DB09E7BF472D4C671BC986943738B9F9; // 0xb18(0x48)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose_AE50624749D21511ABBCE79E0685D308; // 0xb60(0x38)
	struct FAnimNode_Root AnimGraphNode_StateResult_F17F526A456900E9231CED89943525DF; // 0xb98(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_D5BF77C848D66277BB01BDB7A844499A; // 0xbe0(0xa8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_D5D381634A4C8F94E13B988ED2453ED4; // 0xc88(0x70)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34E3874B4EB44C1A7EC87FA21ECD58DE; // 0xcf8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9D72D0C74A058E75F14F0FA2D522E07C; // 0xd38(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5C67A27F41F07640FA2842B7BFBDC628; // 0xd78(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_BC85E90546CD254952025B8C0F710CC2; // 0xdb8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_B3B5450547D39118081FA6A4CB6C0E1C; // 0xdf8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_885F6C4749C60500304D11A12F8079A0; // 0xe38(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_002134014F950E16113088B50AF957BE; // 0xe78(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_F3577C07499435D4AA22E38223F0507D; // 0xeb8(0x40)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_D58463684E3F6E34EB1DFDA770294B9E; // 0xef8(0x110)
	struct FAnimNode_Root AnimGraphNode_StateResult_8B8DCE84456C6F0941F40EBBDB595579; // 0x1008(0x48)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9FCEF70D4BCD7F4F4B94C5976F7FFD1E; // 0x1050(0x110)
	struct FAnimNode_Root AnimGraphNode_StateResult_663AB92C42D2699D128D15AA2E9A1D53; // 0x1160(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7DDA9DE640B91C596CCA478104377AB5; // 0x11a8(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_BCA3876F4CC54808535FE1ABF6741959; // 0x1250(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3AC6E5024CE808E1408B388D39F94962; // 0x1298(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64C507EE41516104C3D181AACC118C75; // 0x12d8(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_0CD60D0E44D2CD20D7C62A8950F60B60; // 0x1318(0x40)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_1B11DD884B19BB35160FB19EC926AC0D; // 0x1358(0x50)
	struct FAnimNode_Root AnimGraphNode_StateResult_C2B6C4FB474CC93D2B91D3BD6B491B8D; // 0x13a8(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_BBFA08F244336D58CC6EFAAFB8E3CFCF; // 0x13f0(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_66A111A443CA4D8E2FF372B982C8CC12; // 0x1450(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_87C0EE1E494678FA7DD2198312D0D50C; // 0x1498(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_2B87583044DD53563722D6820B70677A; // 0x14f8(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_A4E81CBC45926F6145643B840A261588; // 0x1540(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_0E86AF0B45F9B5999AAFEA9F06A281DB; // 0x15a0(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2C18AEC647C13CE7EFDE9B9D9B455AAB; // 0x15e8(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_7941ABE44DAA00BF581B7D847DAEFE74; // 0x1690(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_747D44704D0340B9792AC2A02D596BBB; // 0x16d8(0x60)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_AAC8B305463FA204903A89A0ADB7C73D; // 0x1738(0x40)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16E1580E4079324C88CA72BDFC61B6B4; // 0x1778(0x40)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_72083CB645F3DF35E68F84900B4C9192; // 0x17b8(0x110)
	struct FAnimNode_Root AnimGraphNode_StateResult_8B2A39F24E0B8A8A0FDBEA8EE4407207; // 0x18c8(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49101C2E45A58AC89BDD27B15B8C73D6; // 0x1910(0x60)
	struct FAnimNode_Root AnimGraphNode_StateResult_E07F6C76478AC952F338A8BD9095508C; // 0x1970(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8191FA674E5181C2EB34F79BACA35371; // 0x19b8(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_9F1BCD33445E1BC2E61D62AF23CC71FD; // 0x1a60(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_EF79ECD4411E47ECE24C89B135AAE93A; // 0x1aa8(0xa8)
	struct FAnimNode_Root AnimGraphNode_StateResult_4FA3549C41E4DFE96034E09E11785CB2; // 0x1b50(0x48)
	struct FAnimNode_Root AnimGraphNode_StateResult_0F98EEC24F76C98072A148AAA6554955; // 0x1b98(0x48)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_0F332C364299A8BA801F309F9CA82FB8; // 0x1be0(0xa8)

	void AnimNotify_NewAttack(); // Function BP_Anim_OceanCrawler_Hermit.BP_Anim_OceanCrawler_Hermit_C.AnimNotify_NewAttack // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_AttackCompleted(); // Function BP_Anim_OceanCrawler_Hermit.BP_Anim_OceanCrawler_Hermit_C.AnimNotify_AttackCompleted // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void AnimNotify_StartingHitReact(); // Function BP_Anim_OceanCrawler_Hermit.BP_Anim_OceanCrawler_Hermit_C.AnimNotify_StartingHitReact // BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void ExecuteUbergraph_BP_Anim_OceanCrawler_Hermit(int32_t EntryPoint); // Function BP_Anim_OceanCrawler_Hermit.BP_Anim_OceanCrawler_Hermit_C.ExecuteUbergraph_BP_Anim_OceanCrawler_Hermit // HasDefaults // @ game+0x1848130
};

