// BlueprintGeneratedClass BP_Beacon.BP_Beacon_C
// Size: 0x858 (Inherited: 0x7f8)
struct ABP_Beacon_C : ABeacon {
	struct UPointLightComponent* PointLight3; // 0x7f8(0x08)
	struct UPointLightComponent* PointLight2; // 0x800(0x08)
	struct UPointLightComponent* PointLight1; // 0x808(0x08)
	struct UParticleSystemComponent* ParticleSystem6; // 0x810(0x08)
	struct UParticleSystemComponent* vfx_candle_01_smoke_tavern; // 0x818(0x08)
	struct UParticleSystemComponent* ParticleSystem5; // 0x820(0x08)
	struct UParticleSystemComponent* ParticleSystem4; // 0x828(0x08)
	struct UParticleSystemComponent* ParticleSystem3; // 0x830(0x08)
	struct UParticleSystemComponent* ParticleSystem2; // 0x838(0x08)
	struct UParticleSystemComponent* ParticleSystem1; // 0x840(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x848(0x08)
	struct UParticleSystemComponent* vfx_candle_01_tavern; // 0x850(0x08)

	void UserConstructionScript(); // Function BP_Beacon.BP_Beacon_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

