// BlueprintGeneratedClass BP_CaptainsBookcase_01.BP_CaptainsBookcase_01_C
// Size: 0x708 (Inherited: 0x6a8)
struct ABP_CaptainsBookcase_01_C : ACaptainsBookcase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x6a8(0x08)
	struct UStaticMeshComponent* OrderOfSouls_ScrollStack; // 0x6b0(0x08)
	struct UStaticMeshComponent* MerchantsAliance_ScrollStack; // 0x6b8(0x08)
	struct UStaticMeshComponent* Mercenary_ScrollStack; // 0x6c0(0x08)
	struct UStaticMeshComponent* Legendary_ScrollStack; // 0x6c8(0x08)
	struct UStaticMeshComponent* GoldHoarder_ScrollStack; // 0x6d0(0x08)
	struct UStaticMeshComponent* MergedBookcaseAndDressing; // 0x6d8(0x08)
	struct UClass* Company_GH; // 0x6e0(0x08)
	struct UClass* Company_MA; // 0x6e8(0x08)
	struct UClass* Company_OoS; // 0x6f0(0x08)
	struct UClass* Company_Leg; // 0x6f8(0x08)
	struct UClass* Company_Merc; // 0x700(0x08)

	void UserConstructionScript(); // Function BP_CaptainsBookcase_01.BP_CaptainsBookcase_01_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void GatherIndicators(); // Function BP_CaptainsBookcase_01.BP_CaptainsBookcase_01_C.GatherIndicators // Event|Protected|BlueprintEvent // @ game+0x1848130
	void ExecuteUbergraph_BP_CaptainsBookcase_01(int32_t EntryPoint); // Function BP_CaptainsBookcase_01.BP_CaptainsBookcase_01_C.ExecuteUbergraph_BP_CaptainsBookcase_01 //  // @ game+0x1848130
};

