// BlueprintGeneratedClass BP_cmn_wooden_foundations_02_a.BP_cmn_wooden_foundations_02_a_C
// Size: 0x4f0 (Inherited: 0x3c8)
struct ABP_cmn_wooden_foundations_02_a_C : AActor {
	struct UStaticMeshComponent* StaticMeshComponent035; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent034; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent033; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent032; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent031; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent030; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent029; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent028; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMeshComponent027; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent026; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent025; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent024; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent023; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent022; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent021; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent020; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent019; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent018; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x4a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x4a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x4b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x4b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x4c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x4c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x4d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x4d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x4e0(0x08)
	struct USceneComponent* SharedRoot; // 0x4e8(0x08)

	void UserConstructionScript(); // Function BP_cmn_wooden_foundations_02_a.BP_cmn_wooden_foundations_02_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

