// BlueprintGeneratedClass BP_cls_shop_bsp_01_a.BP_cls_shop_bsp_01_a_C
// Size: 0x600 (Inherited: 0x3c8)
struct ABP_cls_shop_bsp_01_a_C : AActor {
	struct UWorldLocationPopUpComponent* WorldLocationPopUp; // 0x3c8(0x08)
	struct UStaticMeshComponent* bld_cls_shop_mannequin_01_a1; // 0x3d0(0x08)
	struct UStaticMeshComponent* bld_cls_shop_mannequin_01_a; // 0x3d8(0x08)
	struct UPetHangoutSpotComponent* PetHangoutSpot; // 0x3e0(0x08)
	struct UStaticMeshComponent* bsp_cls_shop_dressing_01_b; // 0x3e8(0x08)
	struct UBoxComponent* Collision_02; // 0x3f0(0x08)
	struct UBoxComponent* Collision_01; // 0x3f8(0x08)
	struct UStaticMeshComponent* bsp_cls_shop_dressing_01_a; // 0x400(0x08)
	struct USpotLightComponent* SpotLight8; // 0x408(0x08)
	struct USpotLightComponent* SpotLight7; // 0x410(0x08)
	struct UChildActorComponent* BP_IslandVanityChest; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x420(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost3; // 0x428(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost2; // 0x430(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost1; // 0x438(0x08)
	struct UChildActorComponent* BP_IslandClothingChest; // 0x440(0x08)
	struct UChildActorComponent* ChildActor1; // 0x448(0x08)
	struct UChildActorComponent* ChildActor; // 0x450(0x08)
	struct UChildActorComponent* wsp_bottle_burner; // 0x458(0x08)
	struct UStaticMeshComponent* NoRain Volume5; // 0x460(0x08)
	struct UStaticMeshComponent* NoRain Volume4; // 0x468(0x08)
	struct UStaticMeshComponent* NoRain Volume3; // 0x470(0x08)
	struct UStaticMeshComponent* NoRain Volume2; // 0x478(0x08)
	struct UStaticMeshComponent* NoRain Volume; // 0x480(0x08)
	struct USpotLightComponent* SpotLight6; // 0x488(0x08)
	struct USpotLightComponent* SpotLight5; // 0x490(0x08)
	struct USpotLightComponent* SpotLight4; // 0x498(0x08)
	struct USpotLightComponent* SpotLight3; // 0x4a0(0x08)
	struct USpotLightComponent* SpotLight2; // 0x4a8(0x08)
	struct USpotLightComponent* SpotLight1; // 0x4b0(0x08)
	struct USpotLightComponent* SpotLight; // 0x4b8(0x08)
	struct UPointLightComponent* PointLight; // 0x4c0(0x08)
	struct UPostProcessComponent* PostProcess; // 0x4c8(0x08)
	struct UBoxComponent* Box; // 0x4d0(0x08)
	struct UChildActorComponent* AudioSpace; // 0x4d8(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x4e0(0x08)
	struct UStaticMeshComponent* cmn_moneybag_01_a; // 0x4e8(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x4f0(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x4f8(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x500(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x508(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x510(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x518(0x08)
	struct UStaticMeshComponent* cmn_barrel_debris_02_a; // 0x520(0x08)
	struct UStaticMeshComponent* cmn_barrel_debris_03_a; // 0x528(0x08)
	struct UStaticMeshComponent* cmn_barrel_debris_01_a; // 0x530(0x08)
	struct UStaticMeshComponent* bld_shop_drapes_02_a; // 0x538(0x08)
	struct UStaticMeshComponent* bld_cls_shop_hanging_cloth_03_a; // 0x540(0x08)
	struct UStaticMeshComponent* bld_enc_shop_rug_01_a; // 0x548(0x08)
	struct UStaticMeshComponent* bld_cls_shop_hanging_rope_01_a; // 0x550(0x08)
	struct UStaticMeshComponent* bld_cls_shop_hanging_cloth_02_a; // 0x558(0x08)
	struct UStaticMeshComponent* bld_cls_shp_dye_pot_lid_01_c; // 0x560(0x08)
	struct UStaticMeshComponent* bld_cls_shp_dye_pot_lid_01_b; // 0x568(0x08)
	struct UStaticMeshComponent* bld_cls_shp_dye_pot_01_c; // 0x570(0x08)
	struct UStaticMeshComponent* bld_cls_shp_dye_pot_01_b; // 0x578(0x08)
	struct UStaticMeshComponent* bld_shop_drapes_01_a; // 0x580(0x08)
	struct UStaticMeshComponent* bld_shop_rug_01_a; // 0x588(0x08)
	struct UStaticMeshComponent* bld_shop_table_01_a; // 0x590(0x08)
	struct UStaticMeshComponent* bld_cls_shp_sign_01_a; // 0x598(0x08)
	struct UStaticMeshComponent* bld_cls_shp_porch_mat_01_a; // 0x5a0(0x08)
	struct UStaticMeshComponent* bld_cls_shp_stairs_01_a; // 0x5a8(0x08)
	struct UStaticMeshComponent* bld_cls_shop_door_01_a; // 0x5b0(0x08)
	struct UStaticMeshComponent* bld_cls_shop_window_01_a2; // 0x5b8(0x08)
	struct UStaticMeshComponent* bld_cls_shop_window_01_a1; // 0x5c0(0x08)
	struct UStaticMeshComponent* bld_cls_shop_window_01_a; // 0x5c8(0x08)
	struct UStaticMeshComponent* bld_cls_shp_clothes_lines_01_a; // 0x5d0(0x08)
	struct UStaticMeshComponent* bld_cls_shp_hanging_cloth_01_a; // 0x5d8(0x08)
	struct UStaticMeshComponent* bld_cls_shp_side_roof_01_a; // 0x5e0(0x08)
	struct UStaticMeshComponent* bld_cls_shp_main_roof_01_a; // 0x5e8(0x08)
	struct UStaticMeshComponent* bld_cls_shop_01_a; // 0x5f0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x5f8(0x08)

	void UserConstructionScript(); // Function BP_cls_shop_bsp_01_a.BP_cls_shop_bsp_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

