// BlueprintGeneratedClass BP_CastawayCamp_01.BP_CastawayCamp_01_C
// Size: 0x7e8 (Inherited: 0x3c8)
struct ABP_CastawayCamp_01_C : AActor {
	struct UBoxComponent* RowboatCollision; // 0x3c8(0x08)
	struct UWorldLocationPopUpComponent* WorldLocationPopUp; // 0x3d0(0x08)
	struct UStaticMeshComponent* wsp_cave_rock_small__a; // 0x3d8(0x08)
	struct UStaticMeshComponent* wsp_cave_rock_large__c; // 0x3e0(0x08)
	struct UDecalComponent* Decal12; // 0x3e8(0x08)
	struct UBoxComponent* NavMesh Blocker; // 0x3f0(0x08)
	struct UStaticMeshComponent* mainClothShadowOnly; // 0x3f8(0x08)
	struct USpotLightComponent* SpotLight; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x408(0x08)
	struct UBoxComponent* chestCollision; // 0x410(0x08)
	struct USkeletalMeshComponent* shp_chest_com_01_a; // 0x418(0x08)
	struct USkeletalMeshComponent* bld_castawaycamp_clothdoor_01_a_skel; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x428(0x08)
	struct UStaticMeshComponent* gmp_tal_questbook_smp_static_01_a_PLACEHOLDER5; // 0x430(0x08)
	struct UStaticMeshComponent* gmp_tal_questbook_smp_static_01_a_PLACEHOLDER4; // 0x438(0x08)
	struct UStaticMeshComponent* gmp_tal_questbook_smp_static_01_a_PLACEHOLDER3; // 0x440(0x08)
	struct UStaticMeshComponent* gmp_tal_questbook_smp_static_01_a_PLACEHOLDER2; // 0x448(0x08)
	struct UStaticMeshComponent* gmp_tal_questbook_smp_static_01_a_PLACEHOLDER1; // 0x450(0x08)
	struct UBeachNPCSpawnFlowLocationComponent* BeachNPCSpawnFlowLocation4; // 0x458(0x08)
	struct UBeachNPCSpawnFlowLocationComponent* BeachNPCSpawnFlowLocation3; // 0x460(0x08)
	struct UBeachNPCSpawnFlowLocationComponent* BeachNPCSpawnFlowLocation2; // 0x468(0x08)
	struct UBeachNPCSpawnFlowLocationComponent* BeachNPCSpawnFlowLocation1; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x478(0x08)
	struct UStaticMeshComponent* cmn_looted__box_01_b; // 0x480(0x08)
	struct UChildActorComponent* Audio; // 0x488(0x08)
	struct UPointLightComponent* PointLight4; // 0x490(0x08)
	struct UPointLightComponent* PointLight3; // 0x498(0x08)
	struct UPointLightComponent* PointLight2; // 0x4a0(0x08)
	struct UPointLightComponent* PointLight1; // 0x4a8(0x08)
	struct UPointLightComponent* PointLight; // 0x4b0(0x08)
	struct UStaticMeshComponent* wpn_cutlass_gho_01_a; // 0x4b8(0x08)
	struct UStaticMeshComponent* skd_pincher_sword_01_a; // 0x4c0(0x08)
	struct UStaticMeshComponent* gmp_effigy_sunken_pearl_01_a; // 0x4c8(0x08)
	struct UStaticMeshComponent* gmp_effigy_dark_brethren_01_a; // 0x4d0(0x08)
	struct UStaticMeshComponent* gmp_effigy_captain_damned_01_a; // 0x4d8(0x08)
	struct UStaticMeshComponent* gmp_effigy_pirates_life_01_a; // 0x4e0(0x08)
	struct UDecalComponent* Decal11; // 0x4e8(0x08)
	struct UDecalComponent* Decal10; // 0x4f0(0x08)
	struct UDecalComponent* Decal9; // 0x4f8(0x08)
	struct UDecalComponent* Decal8; // 0x500(0x08)
	struct UDecalComponent* Decal7; // 0x508(0x08)
	struct UDecalComponent* Decal6; // 0x510(0x08)
	struct UDecalComponent* Decal5; // 0x518(0x08)
	struct UDecalComponent* Decal4; // 0x520(0x08)
	struct UDecalComponent* Decal3; // 0x528(0x08)
	struct UDecalComponent* Decal2; // 0x530(0x08)
	struct UDecalComponent* Decal1; // 0x538(0x08)
	struct UDecalComponent* Decal; // 0x540(0x08)
	struct UStaticMeshComponent* shp_wreck_beam_01_b; // 0x548(0x08)
	struct UStaticMeshComponent* shp_wreck_beam_01_a; // 0x550(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x558(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x560(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x568(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x570(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x578(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x580(0x08)
	struct UStaticMeshComponent* castawaycamp_hut_01_a; // 0x588(0x08)
	struct UStaticMeshComponent* gmp_castawayCloth_01_a; // 0x590(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0143; // 0x598(0x08)
	struct UParticleSystemComponent* ParticleSystemComponent02; // 0x5a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0139; // 0x5a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0138; // 0x5b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0137; // 0x5b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0136; // 0x5c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0135; // 0x5c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0134; // 0x5d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0132; // 0x5d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0131; // 0x5e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0130; // 0x5e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0129; // 0x5f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0128; // 0x5f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0127; // 0x600(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0124; // 0x608(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0123; // 0x610(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0121; // 0x618(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0119; // 0x620(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0117; // 0x628(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0116; // 0x630(0x08)
	struct UStaticMeshComponent* StaticMeshComponent095; // 0x638(0x08)
	struct UStaticMeshComponent* StaticMeshComponent094; // 0x640(0x08)
	struct UStaticMeshComponent* StaticMeshComponent093; // 0x648(0x08)
	struct UStaticMeshComponent* StaticMeshComponent092; // 0x650(0x08)
	struct UStaticMeshComponent* StaticMeshComponent091; // 0x658(0x08)
	struct UStaticMeshComponent* StaticMeshComponent090; // 0x660(0x08)
	struct UStaticMeshComponent* StaticMeshComponent089; // 0x668(0x08)
	struct UStaticMeshComponent* StaticMeshComponent088; // 0x670(0x08)
	struct UStaticMeshComponent* StaticMeshComponent087; // 0x678(0x08)
	struct UStaticMeshComponent* StaticMeshComponent086; // 0x680(0x08)
	struct UStaticMeshComponent* StaticMeshComponent085; // 0x688(0x08)
	struct UStaticMeshComponent* StaticMeshComponent084; // 0x690(0x08)
	struct UStaticMeshComponent* StaticMeshComponent083; // 0x698(0x08)
	struct UStaticMeshComponent* StaticMeshComponent082; // 0x6a0(0x08)
	struct UPointLightComponent* LightComponent01; // 0x6a8(0x08)
	struct UPointLightComponent* LightComponent0; // 0x6b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent051; // 0x6b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent050; // 0x6c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent049; // 0x6c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent048; // 0x6d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent047; // 0x6d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent046; // 0x6e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent045; // 0x6e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent044; // 0x6f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent043; // 0x6f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent042; // 0x700(0x08)
	struct UStaticMeshComponent* StaticMeshComponent041; // 0x708(0x08)
	struct UStaticMeshComponent* StaticMeshComponent039; // 0x710(0x08)
	struct UStaticMeshComponent* StaticMeshComponent038; // 0x718(0x08)
	struct UStaticMeshComponent* StaticMeshComponent037; // 0x720(0x08)
	struct UStaticMeshComponent* StaticMeshComponent036; // 0x728(0x08)
	struct UStaticMeshComponent* StaticMeshComponent035; // 0x730(0x08)
	struct UStaticMeshComponent* StaticMeshComponent034; // 0x738(0x08)
	struct UStaticMeshComponent* StaticMeshComponent033; // 0x740(0x08)
	struct UStaticMeshComponent* StaticMeshComponent032; // 0x748(0x08)
	struct UStaticMeshComponent* StaticMeshComponent031; // 0x750(0x08)
	struct UStaticMeshComponent* StaticMeshComponent028; // 0x758(0x08)
	struct UStaticMeshComponent* StaticMeshComponent027; // 0x760(0x08)
	struct UStaticMeshComponent* StaticMeshComponent026; // 0x768(0x08)
	struct UStaticMeshComponent* StaticMeshComponent025; // 0x770(0x08)
	struct UStaticMeshComponent* StaticMeshComponent024; // 0x778(0x08)
	struct UStaticMeshComponent* StaticMeshComponent023; // 0x780(0x08)
	struct UStaticMeshComponent* StaticMeshComponent019; // 0x788(0x08)
	struct UStaticMeshComponent* StaticMeshComponent018; // 0x790(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0x798(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0x7a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x7a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x7b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x7b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x7c0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x7c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x7d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x7d8(0x08)
	struct USceneComponent* SharedRoot; // 0x7e0(0x08)

	void UserConstructionScript(); // Function BP_CastawayCamp_01.BP_CastawayCamp_01_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

