// BlueprintGeneratedClass BP_EmissaryTable_GoldHoarder_01.BP_EmissaryTable_GoldHoarder_01_C
// Size: 0x750 (Inherited: 0x638)
struct ABP_EmissaryTable_GoldHoarder_01_C : ABP_EmissaryTable_01_C {
	struct UPointLightComponent* PointLight1; // 0x638(0x08)
	struct UPointLightComponent* PointLight; // 0x640(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x648(0x08)
	struct UParticleSystemComponent* ParticleSystem2; // 0x650(0x08)
	struct UParticleSystemComponent* ParticleSystem1; // 0x658(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x660(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x668(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x670(0x08)
	struct UEmissaryShipAffiliationTrackerComponent* EmissaryShipAffiliationTracker; // 0x678(0x08)
	struct UStaticMeshComponent* trs_gold_ingot_01_a5; // 0x680(0x08)
	struct UStaticMeshComponent* frt_coin_01_a12; // 0x688(0x08)
	struct UStaticMeshComponent* frt_coin_01_a11; // 0x690(0x08)
	struct UStaticMeshComponent* frt_coin_01_a10; // 0x698(0x08)
	struct UStaticMeshComponent* frt_coin_01_a9; // 0x6a0(0x08)
	struct UStaticMeshComponent* frt_coin_01_a8; // 0x6a8(0x08)
	struct UStaticMeshComponent* trs_gold_ingot_01_c2; // 0x6b0(0x08)
	struct UStaticMeshComponent* frt_coin_01_a7; // 0x6b8(0x08)
	struct UStaticMeshComponent* frt_coin_01_a6; // 0x6c0(0x08)
	struct UStaticMeshComponent* frt_coin_01_a5; // 0x6c8(0x08)
	struct UStaticMeshComponent* frt_coin_01_a4; // 0x6d0(0x08)
	struct UStaticMeshComponent* frt_coin_01_a3; // 0x6d8(0x08)
	struct UStaticMeshComponent* trs_gold_ingot_01_c1; // 0x6e0(0x08)
	struct UStaticMeshComponent* frt_coin_01_a2; // 0x6e8(0x08)
	struct UStaticMeshComponent* frt_coin_01_a1; // 0x6f0(0x08)
	struct UStaticMeshComponent* trs_gold_ingot_01_a4; // 0x6f8(0x08)
	struct UStaticMeshComponent* trs_gold_ingot_01_a3; // 0x700(0x08)
	struct UStaticMeshComponent* trs_gold_ingot_01_a2; // 0x708(0x08)
	struct UStaticMeshComponent* trs_gold_ingot_01_a1; // 0x710(0x08)
	struct UStaticMeshComponent* trs_money_sack_medium_01_a; // 0x718(0x08)
	struct UStaticMeshComponent* trs_gold_ingot_01_c; // 0x720(0x08)
	struct UStaticMeshComponent* trs_gold_ingot_01_b; // 0x728(0x08)
	struct UStaticMeshComponent* trs_gold_ingot_01_a; // 0x730(0x08)
	struct UStaticMeshComponent* frt_coin_01_a; // 0x738(0x08)
	struct UStaticMeshComponent* cap_desk_model_gld_01_a; // 0x740(0x08)
	struct UStaticMeshComponent* con_cover_page_gld_01_a; // 0x748(0x08)

	void UserConstructionScript(); // Function BP_EmissaryTable_GoldHoarder_01.BP_EmissaryTable_GoldHoarder_01_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

