// BlueprintGeneratedClass BP_EmissaryTable_01.BP_EmissaryTable_01_C
// Size: 0x638 (Inherited: 0x5e0)
struct ABP_EmissaryTable_01_C : AEmissaryVoteInteractionActor {
	struct UEmissaryActiveTableVisualiserComponent* EmissaryActiveTableVisualiser; // 0x5e0(0x08)
	struct UVoteAudioComponent* VoteAudio; // 0x5e8(0x08)
	struct UStaticMeshVoteVisualiserComponent* StaticMeshVoteVisualiser; // 0x5f0(0x08)
	struct UInlineVotingInteractionComponent* InlineVotingInteraction; // 0x5f8(0x08)
	struct UActionRulesComponent* ActionRules; // 0x600(0x08)
	struct UStaticMeshComponent* VoteIndicator4; // 0x608(0x08)
	struct UStaticMeshComponent* VoteIndicator3; // 0x610(0x08)
	struct UStaticMeshComponent* VoteIndicator2; // 0x618(0x08)
	struct UStaticMeshComponent* VoteIndicator1; // 0x620(0x08)
	struct UStaticMeshComponent* bld_emissary_table_01_a; // 0x628(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x630(0x08)

	void UserConstructionScript(); // Function BP_EmissaryTable_01.BP_EmissaryTable_01_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

