// BlueprintGeneratedClass BP_EmissaryTable_MerchantAlliance_01.BP_EmissaryTable_MerchantAlliance_01_C
// Size: 0x6b0 (Inherited: 0x638)
struct ABP_EmissaryTable_MerchantAlliance_01_C : ABP_EmissaryTable_01_C {
	struct UPointLightComponent* PointLight1; // 0x638(0x08)
	struct UPointLightComponent* PointLight; // 0x640(0x08)
	struct UParticleSystemComponent* ParticleSystem3; // 0x648(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x650(0x08)
	struct UParticleSystemComponent* ParticleSystem2; // 0x658(0x08)
	struct UParticleSystemComponent* ParticleSystem1; // 0x660(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x668(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x670(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x678(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x680(0x08)
	struct UEmissaryShipAffiliationTrackerComponent* EmissaryShipAffiliationTracker; // 0x688(0x08)
	struct UStaticMeshComponent* bld_shop_wood_box_03_a; // 0x690(0x08)
	struct UStaticMeshComponent* bld_shop_wood_box_01_a; // 0x698(0x08)
	struct UStaticMeshComponent* bld_emissary_table_dressing_mrh_01_a; // 0x6a0(0x08)
	struct UStaticMeshComponent* con_cover_page_mrh_01_a; // 0x6a8(0x08)

	void UserConstructionScript(); // Function BP_EmissaryTable_MerchantAlliance_01.BP_EmissaryTable_MerchantAlliance_01_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

