// BlueprintGeneratedClass BP_EmissaryTable_OrderOfSouls_01.BP_EmissaryTable_OrderOfSouls_01_C
// Size: 0x6a8 (Inherited: 0x638)
struct ABP_EmissaryTable_OrderOfSouls_01_C : ABP_EmissaryTable_01_C {
	struct UPointLightComponent* PointLight; // 0x638(0x08)
	struct UEmissaryShipAffiliationTrackerComponent* EmissaryShipAffiliationTracker; // 0x640(0x08)
	struct UParticleSystemComponent* vfx_enchanting_open_chest_ambient; // 0x648(0x08)
	struct UStaticMeshComponent* con_cover_page_oos_01_a; // 0x650(0x08)
	struct UStaticMeshComponent* bld_shop_bone_oos_07_a; // 0x658(0x08)
	struct UStaticMeshComponent* bld_shop_bone_oos_08_a; // 0x660(0x08)
	struct UStaticMeshComponent* bld_shop_bone_oos_05_a; // 0x668(0x08)
	struct UStaticMeshComponent* bld_shop_bone_oos_03_a; // 0x670(0x08)
	struct UStaticMeshComponent* bld_shop_bone_oos_02_a; // 0x678(0x08)
	struct UStaticMeshComponent* cap_cabin_books_03_a1; // 0x680(0x08)
	struct UStaticMeshComponent* cap_cabin_books_02_a; // 0x688(0x08)
	struct UStaticMeshComponent* cap_cabin_books_03_a; // 0x690(0x08)
	struct UStaticMeshComponent* cap_cabin_books_aged_02_a; // 0x698(0x08)
	struct UStaticMeshComponent* cap_desk_model_oos_01_a; // 0x6a0(0x08)

	void UserConstructionScript(); // Function BP_EmissaryTable_OrderOfSouls_01.BP_EmissaryTable_OrderOfSouls_01_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

