// BlueprintGeneratedClass BP_FactionEmissaryTable_Reapers.BP_FactionEmissaryTable_Reapers_C
// Size: 0x740 (Inherited: 0x638)
struct ABP_FactionEmissaryTable_Reapers_C : ABP_EmissaryTable_01_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x638(0x08)
	struct UStaticMeshComponent* cap_desk_model_fac_shield_reaper_01_a; // 0x640(0x08)
	struct UPointLightComponent* PointLight2; // 0x648(0x08)
	struct UPointLightComponent* PointLight1; // 0x650(0x08)
	struct UPointLightComponent* PointLight; // 0x658(0x08)
	struct UParticleSystemComponent* ParticleSystem6; // 0x660(0x08)
	struct UParticleSystemComponent* ParticleSystem5; // 0x668(0x08)
	struct UParticleSystemComponent* ParticleSystem4; // 0x670(0x08)
	struct UParticleSystemComponent* ParticleSystem3; // 0x678(0x08)
	struct UParticleSystemComponent* ParticleSystem2; // 0x680(0x08)
	struct UParticleSystemComponent* ParticleSystem1; // 0x688(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x690(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x698(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x6a0(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x6a8(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x6b0(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x6b8(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x6c0(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x6c8(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x6d0(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x6d8(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x6e0(0x08)
	struct UStaticMeshComponent* Hourglass; // 0x6e8(0x08)
	struct UStaticMeshComponent* HourglassStand; // 0x6f0(0x08)
	struct UChildActorComponent* FactionVote; // 0x6f8(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x700(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x708(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x710(0x08)
	struct UStaticMeshComponent* cmp_papers_reaper_02_a; // 0x718(0x08)
	struct UStaticMeshComponent* cmp_papers_reaper_01_a; // 0x720(0x08)
	struct UEmissaryShipAffiliationTrackerComponent* EmissaryShipAffiliationTracker; // 0x728(0x08)
	struct UStaticMesh* NewTableMesh; // 0x730(0x08)
	struct UMaterialInstanceDynamic* HourglassGlassMaterial; // 0x738(0x08)

	void UserConstructionScript(); // Function BP_FactionEmissaryTable_Reapers.BP_FactionEmissaryTable_Reapers_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void ReceiveBeginPlay(); // Function BP_FactionEmissaryTable_Reapers.BP_FactionEmissaryTable_Reapers_C.ReceiveBeginPlay // Event|Public|BlueprintEvent // @ game+0x1848130
	void ExecuteUbergraph_BP_FactionEmissaryTable_Reapers(int32_t EntryPoint); // Function BP_FactionEmissaryTable_Reapers.BP_FactionEmissaryTable_Reapers_C.ExecuteUbergraph_BP_FactionEmissaryTable_Reapers //  // @ game+0x1848130
};

