// BlueprintGeneratedClass BP_FishCreature.BP_FishCreature_C
// Size: 0x4e8 (Inherited: 0x3c8)
struct ABP_FishCreature_C : AActor {
	struct USceneComponent* DefaultSceneRoot; // 0x3c8(0x08)
	char CreatureType; // 0x3d0(0x01)
	char NumOfCreatures; // 0x3d1(0x01)
	char UnknownData_3D2[0x2]; // 0x3d2(0x02)
	float BoundsBias; // 0x3d4(0x04)
	struct UStaticMeshComponent* StaticMeshComponent; // 0x3d8(0x08)
	struct UMaterialInstanceDynamic* currMaterial; // 0x3e0(0x08)
	struct TArray<struct UMaterialInstanceDynamic*> MaterialInstance; // 0x3e8(0x10)
	float Seed; // 0x3f8(0x04)
	float SwimSpeed; // 0x3fc(0x04)
	float circlingSpeed; // 0x400(0x04)
	char CirclingDirection; // 0x404(0x01)
	char UnknownData_405[0x3]; // 0x405(0x03)
	float CirclingRadius; // 0x408(0x04)
	float SwimDeformation; // 0x40c(0x04)
	float mud; // 0x410(0x04)
	float shoalSpeed; // 0x414(0x04)
	struct FVector2D ShoalingSpread; // 0x418(0x08)
	float ShoalingHeight; // 0x420(0x04)
	float fishSpeed; // 0x424(0x04)
	struct FVector2D FishSpread; // 0x428(0x08)
	float FishHeight; // 0x430(0x04)
	float RandomSpread; // 0x434(0x04)
	float HueVariance; // 0x438(0x04)
	float smoothness; // 0x43c(0x04)
	struct TArray<struct UStaticMesh*> SelectedCreatureType; // 0x440(0x10)
	struct TArray<struct UStaticMesh*> Fish_04; // 0x450(0x10)
	struct TArray<struct UStaticMesh*> Fish_05; // 0x460(0x10)
	float Size; // 0x470(0x04)
	float SizeVariance; // 0x474(0x04)
	float SimSpeed; // 0x478(0x04)
	struct FVector BBox; // 0x47c(0x0c)
	struct TArray<struct UStaticMesh*> Fish_07; // 0x488(0x10)
	float DrawDistance; // 0x498(0x04)
	char UnknownData_49C[0x4]; // 0x49c(0x04)
	struct TArray<struct UStaticMesh*> Clown_01; // 0x4a0(0x10)
	float SizeCompensation; // 0x4b0(0x04)
	char UnknownData_4B4[0x4]; // 0x4b4(0x04)
	struct TArray<struct UStaticMesh*> Splashtail; // 0x4b8(0x10)
	struct TArray<struct UStaticMesh*> Pondie; // 0x4c8(0x10)
	struct FLinearColor FishDistribution; // 0x4d8(0x10)

	void ConfigureMaterialInstance(); // Function BP_FishCreature.BP_FishCreature_C.ConfigureMaterialInstance // Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void CreateCreature(); // Function BP_FishCreature.BP_FishCreature_C.CreateCreature // Public|HasDefaults|BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void UserConstructionScript(); // Function BP_FishCreature.BP_FishCreature_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

