// BlueprintGeneratedClass BP_FactionHourglass.BP_FactionHourglass_C
// Size: 0x560 (Inherited: 0x4c0)
struct ABP_FactionHourglass_C : AFactionVoteInteractionActor {
	struct UMaterialManipulationComponent* MaterialManipulation; // 0x4c0(0x08)
	struct UExplosionComponent* Explosion; // 0x4c8(0x08)
	struct UFactionVoteAudioComponent* FactionVoteAudio; // 0x4d0(0x08)
	struct UFactionInteractionVoteComponent* FactionInteractionVote; // 0x4d8(0x08)
	struct UStaticMeshComponent* HourglassStand; // 0x4e0(0x08)
	struct UFactionParticleComponent* ParticlesFactionG; // 0x4e8(0x08)
	struct UFactionParticleComponent* ParticlesFactionB; // 0x4f0(0x08)
	struct UFactionFlipMeshComponent* FactionFlipMesh; // 0x4f8(0x08)
	struct UStaticMeshComponent* FH_VoteIndicator4; // 0x500(0x08)
	struct UStaticMeshComponent* PL_VoteIndicator4; // 0x508(0x08)
	struct UStaticMeshComponent* FH_VoteIndicator3; // 0x510(0x08)
	struct UStaticMeshComponent* PL_VoteIndicator3; // 0x518(0x08)
	struct UStaticMeshComponent* FH_VoteIndicator2; // 0x520(0x08)
	struct UStaticMeshComponent* PL_VoteIndicator2; // 0x528(0x08)
	struct UStaticMeshComponent* FH_VoteIndicator1; // 0x530(0x08)
	struct UStaticMeshComponent* PL_VoteIndicator1; // 0x538(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x540(0x08)
	struct UEmissaryActiveTableVisualiserComponent* EmissaryActiveTableVisualiser; // 0x548(0x08)
	struct UStaticMeshVoteVisualiserComponent* StaticMeshVoteVisualiser; // 0x550(0x08)
	struct UActionRulesComponent* ActionRules; // 0x558(0x08)

	void UserConstructionScript(); // Function BP_FactionHourglass.BP_FactionHourglass_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

