// BlueprintGeneratedClass BP_FactionOutpostTable.BP_FactionOutpostTable_C
// Size: 0x640 (Inherited: 0x5f8)
struct ABP_FactionOutpostTable_C : AFactionOutpostVoteInteractionActor {
	struct UVoteAudioComponent* VoteAudio; // 0x5f8(0x08)
	struct UStaticMeshVoteVisualiserComponent* StaticMeshVoteVisualiser; // 0x600(0x08)
	struct UInlineVotingInteractionComponent* InlineVotingInteraction; // 0x608(0x08)
	struct UActionRulesComponent* ActionRules; // 0x610(0x08)
	struct UStaticMeshComponent* VoteIndicator4; // 0x618(0x08)
	struct UStaticMeshComponent* VoteIndicator3; // 0x620(0x08)
	struct UStaticMeshComponent* VoteIndicator2; // 0x628(0x08)
	struct UStaticMeshComponent* VoteIndicator1; // 0x630(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x638(0x08)

	void UserConstructionScript(); // Function BP_FactionOutpostTable.BP_FactionOutpostTable_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

