// BlueprintGeneratedClass BP_LargeShip_StandardHull_Damage.BP_LargeShip_StandardHull_Damage_C
// Size: 0x768 (Inherited: 0x658)
struct ABP_LargeShip_StandardHull_Damage_C : ABP_HullDamage_C {
	struct UStaticMeshComponent* projectile_collision; // 0x658(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_16; // 0x660(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_15; // 0x668(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_14; // 0x670(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_13; // 0x678(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_12; // 0x680(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_11; // 0x688(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_09; // 0x690(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_08; // 0x698(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_07; // 0x6a0(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_06; // 0x6a8(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_05; // 0x6b0(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_04; // 0x6b8(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_03; // 0x6c0(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_02; // 0x6c8(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_01; // 0x6d0(0x08)
	struct UStaticMeshComponent* largeship_standardhull_upper_01_a; // 0x6d8(0x08)
	struct UChildActorComponent* Damage_Zone_Lower_09; // 0x6e0(0x08)
	struct UChildActorComponent* Damage_Zone_Lower_08; // 0x6e8(0x08)
	struct UChildActorComponent* Damage_Zone_Lower_07; // 0x6f0(0x08)
	struct UChildActorComponent* Damage_Zone_Lower_06; // 0x6f8(0x08)
	struct UChildActorComponent* Damage_Zone_Lower_17; // 0x700(0x08)
	struct UChildActorComponent* Damage_Zone_Lower_16; // 0x708(0x08)
	struct UChildActorComponent* Damage_Zone_Lower_15; // 0x710(0x08)
	struct UChildActorComponent* Damage_Zone_Lower_14; // 0x718(0x08)
	struct UChildActorComponent* Damage_Zone_Lower_13; // 0x720(0x08)
	struct UChildActorComponent* Damage_Zone_Lower_12; // 0x728(0x08)
	struct UChildActorComponent* Damage_Zone_Lower_11; // 0x730(0x08)
	struct UChildActorComponent* Damage_Zone_Lower_05; // 0x738(0x08)
	struct UChildActorComponent* Damage_Zone_Lower_04; // 0x740(0x08)
	struct UChildActorComponent* Damage_Zone_Lower_03; // 0x748(0x08)
	struct UChildActorComponent* Damage_Zone_Lower_02; // 0x750(0x08)
	struct UChildActorComponent* Damage_Zone_Lower_01; // 0x758(0x08)
	struct UStaticMeshComponent* largeship_standardhull_lower_01_a; // 0x760(0x08)

	void UserConstructionScript(); // Function BP_LargeShip_StandardHull_Damage.BP_LargeShip_StandardHull_Damage_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

