// BlueprintGeneratedClass BP_LargeShip_StandardHull_Art_Interior_Brig_Deck.BP_LargeShip_StandardHull_Art_Interior_Brig_Deck_C
// Size: 0x4a8 (Inherited: 0x3c8)
struct ABP_LargeShip_StandardHull_Art_Interior_Brig_Deck_C : AActor {
	struct UHitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x3c8(0x08)
	struct UStaticMeshComponent* shp_int_brig_cell_02_a; // 0x3d0(0x08)
	struct UStaticMeshComponent* shp_int_brig_beam_01_a6; // 0x3d8(0x08)
	struct UStaticMeshComponent* shp_int_brig_beam_01_b6; // 0x3e0(0x08)
	struct UStaticMeshComponent* shp_int_brig_beam_01_a8; // 0x3e8(0x08)
	struct UStaticMeshComponent* shp_int_brig_beam_01_b5; // 0x3f0(0x08)
	struct UStaticMeshComponent* shp_int_brig_beam_01_a3; // 0x3f8(0x08)
	struct UStaticMeshComponent* shp_int_brig_beam_01_b1; // 0x400(0x08)
	struct UStaticMeshComponent* shp_int_brig_beam_01_a1; // 0x408(0x08)
	struct UStaticMeshComponent* shp_int_brig_beam_01_b; // 0x410(0x08)
	struct UStaticMeshComponent* shp_int_brig_beam_01_b2; // 0x418(0x08)
	struct UStaticMeshComponent* shp_int_brig_beam_01_b4; // 0x420(0x08)
	struct UStaticMeshComponent* shp_int_brig_beam_01_b3; // 0x428(0x08)
	struct UStaticMeshComponent* shp_int_brig_beam_01_b7; // 0x430(0x08)
	struct UMergedStaticMeshComponent* MergedStaticMesh; // 0x438(0x08)
	struct UStaticMeshComponent* shp_int_brig_stairs_01_a; // 0x440(0x08)
	struct UStaticMeshComponent* shp_int_map_pillar_01_a7; // 0x448(0x08)
	struct UStaticMeshComponent* shp_int_map_pillar_01_a6; // 0x450(0x08)
	struct UStaticMeshComponent* shp_int_brig_beam_01_a5; // 0x458(0x08)
	struct UStaticMeshComponent* shp_int_brig_beam_01_a4; // 0x460(0x08)
	struct UStaticMeshComponent* shp_int_map_pillar_01_a5; // 0x468(0x08)
	struct UStaticMeshComponent* shp_int_map_pillar_01_a4; // 0x470(0x08)
	struct UStaticMeshComponent* shp_int_map_pillar_01_a3; // 0x478(0x08)
	struct UStaticMeshComponent* shp_int_map_pillar_01_a2; // 0x480(0x08)
	struct UStaticMeshComponent* shp_int_map_pillar_01_a1; // 0x488(0x08)
	struct UStaticMeshComponent* shp_int_map_pillar_01_a; // 0x490(0x08)
	struct UMergedStaticMeshComponent* MergedStaticMesh_col; // 0x498(0x08)
	struct UStaticMeshComponent* shp_interior_brig_deck_01_a; // 0x4a0(0x08)

	void UserConstructionScript(); // Function BP_LargeShip_StandardHull_Art_Interior_Brig_Deck.BP_LargeShip_StandardHull_Art_Interior_Brig_Deck_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

