// BlueprintGeneratedClass BP_LargeShip_StandardHull_Art.BP_LargeShip_StandardHull_Art_C
// Size: 0x6b0 (Inherited: 0x3c8)
struct ABP_LargeShip_StandardHull_Art_C : AActor {
	struct UHitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x3c8(0x08)
	struct UPostProcessComponent* BattleBoundsPostProcess; // 0x3d0(0x08)
	struct UBoxComponent* BattleBounds_PP_Volume; // 0x3d8(0x08)
	struct UStaticMeshComponent* shp_hatch_01_a; // 0x3e0(0x08)
	struct UPostProcessComponent* FirePostProcess; // 0x3e8(0x08)
	struct UBoxComponent* Fire_PP_Volume; // 0x3f0(0x08)
	struct UChildActorComponent* StaticDoors; // 0x3f8(0x08)
	struct UPostProcessComponent* PostProcess2; // 0x400(0x08)
	struct UBoxComponent* captains_PP_Volume_window; // 0x408(0x08)
	struct UStaticMeshComponent* shp_hull_rain_occlusion; // 0x410(0x08)
	struct USurfaceWaterComponent* SurfaceWater; // 0x418(0x08)
	struct UStaticMeshComponent* shp_captain_cabin_window_glass_ext_01_a_02; // 0x420(0x08)
	struct UStaticMeshComponent* shp_captain_cabin_window_glass_ext_01_a_05; // 0x428(0x08)
	struct UStaticMeshComponent* shp_captain_cabin_window_glass_ext_01_a_04; // 0x430(0x08)
	struct UStaticMeshComponent* shp_captain_cabin_window_glass_ext_01_a_03; // 0x438(0x08)
	struct UStaticMeshComponent* shp_captain_cabin_window_glass_ext_01_a_06; // 0x440(0x08)
	struct UStaticMeshComponent* shp_captains_cabin_window_feature_glass_ext_01_a; // 0x448(0x08)
	struct UMergedStaticMeshComponent* Merged_ExteriorGlass; // 0x450(0x08)
	struct UPostProcessComponent* PostProcess1; // 0x458(0x08)
	struct UBoxComponent* Ship_PP_Volume_A; // 0x460(0x08)
	struct UPostProcessComponent* PostProcess; // 0x468(0x08)
	struct UBoxComponent* Captain_PP_volume; // 0x470(0x08)
	struct UStaticMeshComponent* shp_deck_forecastle_steps_01_a; // 0x478(0x08)
	struct UStaticMeshComponent* shp_balustrade_forecastle_02_a; // 0x480(0x08)
	struct UStaticMeshComponent* shp_balustrade_forecastle_02_a1; // 0x488(0x08)
	struct UStaticMeshComponent* shp_hatch_02_a; // 0x490(0x08)
	struct UStaticMeshComponent* shp_captain_cabin_window_01_a_02; // 0x498(0x08)
	struct UStaticMeshComponent* shp_captain_cabin_window_01_a_06; // 0x4a0(0x08)
	struct UStaticMeshComponent* shp_captain_cabin_window_01_a_03; // 0x4a8(0x08)
	struct UStaticMeshComponent* shp_captain_cabin_window_01_a_04; // 0x4b0(0x08)
	struct UStaticMeshComponent* shp_captain_cabin_window_01_a_05; // 0x4b8(0x08)
	struct UStaticMeshComponent* shp_hull_hatch_01_a_01; // 0x4c0(0x08)
	struct UStaticMeshComponent* shp_hull_hatch_01_a_03; // 0x4c8(0x08)
	struct UStaticMeshComponent* shp_hull_hatch_01_a_02; // 0x4d0(0x08)
	struct UStaticMeshComponent* shp_hull_hatch_01_a_04; // 0x4d8(0x08)
	struct UStaticMeshComponent* shp_hull_hatch_01_a_05; // 0x4e0(0x08)
	struct UStaticMeshComponent* shp_hull_hatch_01_a_06; // 0x4e8(0x08)
	struct UStaticMeshComponent* shp_hull_hatch_01_a_07; // 0x4f0(0x08)
	struct UStaticMeshComponent* shp_hull_hatch_01_a_08; // 0x4f8(0x08)
	struct UStaticMeshComponent* shp_hull_hatch_01_a_09; // 0x500(0x08)
	struct UStaticMeshComponent* shp_hull_hatch_01_a_12; // 0x508(0x08)
	struct UStaticMeshComponent* shp_hull_hatch_01_a_11; // 0x510(0x08)
	struct UStaticMeshComponent* shp_hull_hatch_01_a_13; // 0x518(0x08)
	struct UStaticMeshComponent* shp_hull_shelf_01_a_06; // 0x520(0x08)
	struct UStaticMeshComponent* shp_hull_shelf_01_a_01; // 0x528(0x08)
	struct UStaticMeshComponent* shp_hull_shelf_01_a_02; // 0x530(0x08)
	struct UStaticMeshComponent* shp_hull_shelf_01_a_03; // 0x538(0x08)
	struct UStaticMeshComponent* shp_hull_shelf_01_a_04; // 0x540(0x08)
	struct UStaticMeshComponent* shp_hull_shelf_01_a_05; // 0x548(0x08)
	struct UStaticMeshComponent* shp_captains_cabin_window_feature_01_a; // 0x550(0x08)
	struct UStaticMeshComponent* shp_sterncastle_wheel_balustrade_01_a; // 0x558(0x08)
	struct UStaticMeshComponent* shp_balustrade_long_01_a_01; // 0x560(0x08)
	struct UStaticMeshComponent* shp_balustrade_long_01_a_02; // 0x568(0x08)
	struct UStaticMeshComponent* shp_balustrade_long_01_a_03; // 0x570(0x08)
	struct UStaticMeshComponent* shp_balustrade_long_01_a_04; // 0x578(0x08)
	struct UStaticMeshComponent* shp_deck_sterncastle_flagpole_01_a; // 0x580(0x08)
	struct UStaticMeshComponent* shp_balustrade_forecastle_curve_01_a_02; // 0x588(0x08)
	struct UStaticMeshComponent* shp_captains_cabin_balcony_bannister_01_a; // 0x590(0x08)
	struct UStaticMeshComponent* shp_balustrade_forecastle_curve_01_a_01; // 0x598(0x08)
	struct UStaticMeshComponent* cmn_driftwood_01_a; // 0x5a0(0x08)
	struct UStaticMeshComponent* shp_rear_window_01_a; // 0x5a8(0x08)
	struct UStaticMeshComponent* shp_captain_cabin_side_door_porch_01_a; // 0x5b0(0x08)
	struct UStaticMeshComponent* cmn_driftwood_01_a2; // 0x5b8(0x08)
	struct UMergedStaticMeshComponent* MergedStaticMesh_col; // 0x5c0(0x08)
	struct UStaticMeshComponent* shp_galleon_harpoon_placement_01_a; // 0x5c8(0x08)
	struct UStaticMeshComponent* shp_balustrade_cap_01_a_01; // 0x5d0(0x08)
	struct UStaticMeshComponent* shp_balustrade_cap_01_a_02; // 0x5d8(0x08)
	struct UStaticMeshComponent* shp_balustrade_cap_01_a_03; // 0x5e0(0x08)
	struct UStaticMeshComponent* shp_balustrade_cap_01_a_04; // 0x5e8(0x08)
	struct UStaticMeshComponent* shp_balustrade_cap_01_a_3; // 0x5f0(0x08)
	struct UStaticMeshComponent* shp_balustrade_cap_01_a_2; // 0x5f8(0x08)
	struct UStaticMeshComponent* shp_balustrade_cap_01_a_4; // 0x600(0x08)
	struct UStaticMeshComponent* shp_balustrade_cap_01_a; // 0x608(0x08)
	struct UStaticMeshComponent* shp_hull_rudder_hinge_01_a; // 0x610(0x08)
	struct UStaticMeshComponent* shp_rope_rigging_rear_01_a; // 0x618(0x08)
	struct UStaticMeshComponent* shp_rope_coil_01_a; // 0x620(0x08)
	struct UStaticMeshComponent* shp_rope_coil_02_a; // 0x628(0x08)
	struct UStaticMeshComponent* shp_rope_coil_04_a_03; // 0x630(0x08)
	struct UStaticMeshComponent* shp_rope_coil_04_a_04; // 0x638(0x08)
	struct UStaticMeshComponent* shp_rope_coil_04_a_05; // 0x640(0x08)
	struct UStaticMeshComponent* shp_mast_trim_01_a; // 0x648(0x08)
	struct UStaticMeshComponent* shp_mast_trim_01_a1; // 0x650(0x08)
	struct UStaticMeshComponent* shp_mast_trim_01_a2; // 0x658(0x08)
	struct UStaticMeshComponent* shp_capstan_trim_01_a; // 0x660(0x08)
	struct UMergedStaticMeshComponent* MergedStaticMesh; // 0x668(0x08)
	struct UStaticMeshComponent* cmn_walk_plank_01_a1; // 0x670(0x08)
	struct UStaticMeshComponent* cmn_walk_plank_01_a; // 0x678(0x08)
	struct UChildActorComponent* Interior_Captains_Cabin; // 0x680(0x08)
	struct UChildActorComponent* Interior_Brig_Deck; // 0x688(0x08)
	struct UChildActorComponent* Interior_Map_Deck; // 0x690(0x08)
	struct UStaticMeshComponent* shp_stern_staircase_01_a_02; // 0x698(0x08)
	struct UStaticMeshComponent* shp_stern_staircase_01_a_01; // 0x6a0(0x08)
	struct UStaticMeshComponent* shp_galleon_main_deck_01_a; // 0x6a8(0x08)

	void UserConstructionScript(); // Function BP_LargeShip_StandardHull_Art.BP_LargeShip_StandardHull_Art_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

