// BlueprintGeneratedClass BP_LargeShipTemplate.BP_LargeShipTemplate_C
// Size: 0x1df8 (Inherited: 0x1890)
struct ABP_LargeShipTemplate_C : AShip {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1890(0x08)
	struct UShipRowboatPersistenceComponent* ShipRowboatPersistence; // 0x1898(0x08)
	struct UHarpoonItemLocationComponent* HarpoonItemLocation1; // 0x18a0(0x08)
	struct UHarpoonItemLocationComponent* HarpoonItemLocation; // 0x18a8(0x08)
	struct UFactionParticleComponent* FactionGBowParticles; // 0x18b0(0x08)
	struct UFactionParticleComponent* FactionBBowParticles; // 0x18b8(0x08)
	struct USplashProbeVFXComponent* VFX_SplashProbe_Both_Splashes_Details; // 0x18c0(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_rectangle_surface_Huge_Bottom; // 0x18c8(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_rectangle_surface_Huge_Top; // 0x18d0(0x08)
	struct USplashProbeVFXComponent* VFX_SplashProbe_Both_Splashes_Second; // 0x18d8(0x08)
	struct USplashProbeVFXComponent* VFX_SplashProbe_OnShip_Splashes; // 0x18e0(0x08)
	struct USplashProbeVFXComponent* VFX_SplashProbe_Offship_Splashes; // 0x18e8(0x08)
	struct USplashProbeVFXComponent* VFX_SplashProbe_Underwater; // 0x18f0(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_rectangle_S_Local; // 0x18f8(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_rectangle_S_Local3; // 0x1900(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_rectangle_S_Local2; // 0x1908(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_cannon_Local8; // 0x1910(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_cannon_Local6; // 0x1918(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_cannon_Local7; // 0x1920(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_cannon_Local5; // 0x1928(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_cannon_Local2; // 0x1930(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_cannon_Local4; // 0x1938(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_cannon_Local3; // 0x1940(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_captain_Local; // 0x1948(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_cannon_Local1; // 0x1950(0x08)
	struct USceneComponent* VFX_Scene; // 0x1958(0x08)
	struct UShipFactionCustomisation* ShipFactionCustomisation; // 0x1960(0x08)
	struct UBP_ShipTrinketMountpointManagerComponent_Large_C* ShipTrinketMountpointManagerComponent_Large; // 0x1968(0x08)
	struct UChildActorComponent* CaptainsLog; // 0x1970(0x08)
	struct UChildActorComponent* ShipsCrest; // 0x1978(0x08)
	struct UChildActorComponent* Rugs; // 0x1980(0x08)
	struct UChildActorComponent* Drapes; // 0x1988(0x08)
	struct UChildActorComponent* Bed; // 0x1990(0x08)
	struct UChildActorComponent* Chandelier; // 0x1998(0x08)
	struct UChildActorComponent* Curtains; // 0x19a0(0x08)
	struct UChildActorComponent* Chair; // 0x19a8(0x08)
	struct UChildActorComponent* VoyageTable; // 0x19b0(0x08)
	struct UShipStorageJettisonComponent* ShipStorageJettison; // 0x19b8(0x08)
	struct USkeletalMeshComponent* Seagull3; // 0x19c0(0x08)
	struct USkeletalMeshComponent* Seagull2; // 0x19c8(0x08)
	struct USeagullManagerComponent* SeagullManager; // 0x19d0(0x08)
	struct USkeletalMeshComponent* Seagull1; // 0x19d8(0x08)
	struct UStaticMeshComponent* Rat3; // 0x19e0(0x08)
	struct UStaticMeshComponent* Rat2; // 0x19e8(0x08)
	struct UStaticMeshComponent* Rat1; // 0x19f0(0x08)
	struct UBP_BedComponent_C* BP_BedComponent; // 0x19f8(0x08)
	struct URatManagerComponent* RatManager; // 0x1a00(0x08)
	struct UBP_SeatComponent_C* Seat_BottomDeckBarrel_5; // 0x1a08(0x08)
	struct UBP_SeatComponent_C* Seat_BottomDeckBarrel_4; // 0x1a10(0x08)
	struct UBP_SeatComponent_C* Seat_BottomDeckBarrel_3; // 0x1a18(0x08)
	struct UBP_SeatComponent_C* Seat_Cabin_Chest; // 0x1a20(0x08)
	struct UBP_SeatComponent_C* Seat_Platform_Starboard; // 0x1a28(0x08)
	struct UBP_SeatComponent_C* Seat_Platform_Port; // 0x1a30(0x08)
	struct UBP_SeatComponent_C* Seat_Bannister_Bow_3; // 0x1a38(0x08)
	struct UBP_SeatComponent_C* Seat_Bannister_Bow; // 0x1a40(0x08)
	struct UBP_SeatComponent_C* Seat_BottomDeckBarrel; // 0x1a48(0x08)
	struct UBP_SeatComponent_C* Seat_MapTable_Cooking; // 0x1a50(0x08)
	struct UBP_SeatComponent_C* Seat_MapTable; // 0x1a58(0x08)
	struct UBP_SeatComponent_C* Seat_Balcony_Rear_Starboard; // 0x1a60(0x08)
	struct UBP_SeatComponent_C* Seat_Balcony_Rear_Port; // 0x1a68(0x08)
	struct UBP_SeatComponent_C* Seat_Plank_Port; // 0x1a70(0x08)
	struct UBP_SeatComponent_C* Seat_Hatch_2; // 0x1a78(0x08)
	struct UBP_SeatComponent_C* Seat_Plank_Starboard; // 0x1a80(0x08)
	struct UBP_SeatComponent_C* Seat_CaptainsChair; // 0x1a88(0x08)
	struct UAIRegionComponent* AIRegion; // 0x1a90(0x08)
	struct UNamedPointsComponent* NamedPoints; // 0x1a98(0x08)
	struct UChildActorComponent* BP_ShipStorageBarrelTwo6; // 0x1aa0(0x08)
	struct UChildActorComponent* BP_ShipStorageBarrelThree4; // 0x1aa8(0x08)
	struct UChildActorComponent* BP_ShipStorageBarrelThree3; // 0x1ab0(0x08)
	struct UChildActorComponent* BP_ShipStorageBarrelTwo5; // 0x1ab8(0x08)
	struct UChildActorComponent* BP_ShipStorageBarrelTwo4; // 0x1ac0(0x08)
	struct UChildActorComponent* BP_ShipStorageBarrelTwo3; // 0x1ac8(0x08)
	struct UChildActorComponent* BP_ShipStorageBarrelTwo2; // 0x1ad0(0x08)
	struct UChildActorComponent* BP_ShipStorageBarrelTwo1; // 0x1ad8(0x08)
	struct UChildActorComponent* BP_ShipStorageBarrelTwo; // 0x1ae0(0x08)
	struct UChildActorComponent* BP_ShipStorageBarrelThree2; // 0x1ae8(0x08)
	struct UChildActorComponent* BP_ShipStorageBarrelThree1; // 0x1af0(0x08)
	struct UChildActorComponent* BP_ShipStorageBarrelThree; // 0x1af8(0x08)
	struct UStaticMeshComponent* shp_galleon_ladder_gap_hits_01_a; // 0x1b00(0x08)
	struct UStaticMeshComponent* shp_flag_hole_01_a; // 0x1b08(0x08)
	struct UChildActorComponent* BP_EmissaryFlag; // 0x1b10(0x08)
	struct UEmissaryFlotsamItemSpawnComponent* EmissaryFlotsamItemSpawner; // 0x1b18(0x08)
	struct UChildActorComponent* BP_LargeShip_CageLatch_03_a; // 0x1b20(0x08)
	struct UChildActorComponent* BP_LargeShip_CageLatch_03_b; // 0x1b28(0x08)
	struct UChildActorComponent* BP_WaterBarrel; // 0x1b30(0x08)
	struct UChildActorComponent* BP_Shroudbreaker; // 0x1b38(0x08)
	struct UChildActorComponent* BP_ShipPetChest; // 0x1b40(0x08)
	struct UPetHangoutSpotComponent* PetHangoutSpot; // 0x1b48(0x08)
	struct UChildActorComponent* ShipStorageBarrelFood2; // 0x1b50(0x08)
	struct UChildActorComponent* BP_HarpoonLauncher1; // 0x1b58(0x08)
	struct UChildActorComponent* BP_HarpoonLauncher; // 0x1b60(0x08)
	struct UChildActorComponent* RowboatMountpoint; // 0x1b68(0x08)
	struct UShipTelemetryComponent* ShipTelemetry; // 0x1b70(0x08)
	struct UChildActorComponent* BP_ShipVanityChest; // 0x1b78(0x08)
	struct UChildActorComponent* BP_Bell; // 0x1b80(0x08)
	struct UChildActorComponent* ShipStorageBarrel_LowestDeck17; // 0x1b88(0x08)
	struct UChildActorComponent* ShipStorageBarrel_LowestDeck16; // 0x1b90(0x08)
	struct UChildActorComponent* ShipStorageBarrel_LowestDeck15; // 0x1b98(0x08)
	struct UChildActorComponent* BP_WeaponsChest; // 0x1ba0(0x08)
	struct UChildActorComponent* BP_EquipmentChest; // 0x1ba8(0x08)
	struct UChildActorComponent* BP_ClothingChest; // 0x1bb0(0x08)
	struct UShipPointParticleComponent* VFX_Drips; // 0x1bb8(0x08)
	struct UBoxComponent* RammingSpurZone; // 0x1bc0(0x08)
	struct UStaticMeshComponent* shp_shark_hits_01_a; // 0x1bc8(0x08)
	struct UChildActorComponent* ShipStorageBarrel_Cannonball3; // 0x1bd0(0x08)
	struct UChildActorComponent* BP_AmmoChest; // 0x1bd8(0x08)
	struct UChildActorComponent* ShipStorageBarrel_Grog; // 0x1be0(0x08)
	struct UChildActorComponent* ShipStorageBarrel_Food; // 0x1be8(0x08)
	struct UChildActorComponent* Lanterns; // 0x1bf0(0x08)
	struct UTeleportLocationComponent* TeleportLocation11_TopDeck_NearWheel; // 0x1bf8(0x08)
	struct UTeleportLocationComponent* TeleportLocation_09_BottomDeck_OutsideBrig; // 0x1c00(0x08)
	struct UTeleportLocationComponent* TeleportLocation_08_BottomDeck_FacingStairs; // 0x1c08(0x08)
	struct UTeleportLocationComponent* TeleportLocation_07_MiddleDeck_BackOfShip; // 0x1c10(0x08)
	struct UTeleportLocationComponent* TeleportLocation_06_MiddleDeck_FrontOfShip; // 0x1c18(0x08)
	struct UTeleportLocationComponent* TeleportLocation_05_TopDeck_NearCannons; // 0x1c20(0x08)
	struct UTeleportLocationComponent* TeleportLocation_04_TopDeck_FrontOfShip; // 0x1c28(0x08)
	struct UTeleportLocationComponent* TeleportLocation_03_TopDeck_BackOfShip; // 0x1c30(0x08)
	struct UTeleportLocationComponent* TeleportLocation_02_TopDeck_NearLadder; // 0x1c38(0x08)
	struct UTeleportLocationComponent* TeleportLocation_01_CaptainsCabin; // 0x1c40(0x08)
	struct URiggingSystemComponent* MainRigging; // 0x1c48(0x08)
	struct URiggingSystemComponent* ControlsRigging; // 0x1c50(0x08)
	struct UChildActorComponent* MapTable; // 0x1c58(0x08)
	struct UChildActorComponent* ShipsCompass; // 0x1c60(0x08)
	struct UChildActorComponent* Figurehead; // 0x1c68(0x08)
	struct UChildActorComponent* ShipStorageBarrel_LowestDeck13; // 0x1c70(0x08)
	struct UChildActorComponent* ShipStorageBarrel_BottomOfLowestStairs2; // 0x1c78(0x08)
	struct UChildActorComponent* ShipStorageBarrel_BottomOfLowestStairs1; // 0x1c80(0x08)
	struct USceneComponent* LowerDeckBarrels; // 0x1c88(0x08)
	struct UChildActorComponent* ShipStorageBarrel_NearLowerStairs5; // 0x1c90(0x08)
	struct UChildActorComponent* ShipStorageBarrel_Cannonball2; // 0x1c98(0x08)
	struct UChildActorComponent* ShipStorageBarrel_Cannonball1; // 0x1ca0(0x08)
	struct UChildActorComponent* ShipStorageBarrel_NearLowerStairs6; // 0x1ca8(0x08)
	struct UChildActorComponent* ShipStorageBarrel_NearLowerStairs4; // 0x1cb0(0x08)
	struct UChildActorComponent* ShipStorageBarrel_NearLowerStairs3; // 0x1cb8(0x08)
	struct UChildActorComponent* ShipStorageBarrel_NearLowerStairs2; // 0x1cc0(0x08)
	struct UChildActorComponent* ShipStorageBarrel_NearLowerStairs1; // 0x1cc8(0x08)
	struct UChildActorComponent* ShipStorageBarrel_BehindStairs5; // 0x1cd0(0x08)
	struct UChildActorComponent* CannonRight4; // 0x1cd8(0x08)
	struct UChildActorComponent* CannonRight3; // 0x1ce0(0x08)
	struct UChildActorComponent* CannonRight2; // 0x1ce8(0x08)
	struct UChildActorComponent* CannonRight1; // 0x1cf0(0x08)
	struct UChildActorComponent* CannonLeft4; // 0x1cf8(0x08)
	struct UChildActorComponent* CannonLeft3; // 0x1d00(0x08)
	struct UChildActorComponent* CannonLeft2; // 0x1d08(0x08)
	struct UChildActorComponent* CannonLeft1; // 0x1d10(0x08)
	struct UChildActorComponent* LadderStbd; // 0x1d18(0x08)
	struct UChildActorComponent* LadderPort; // 0x1d20(0x08)
	struct UChildActorComponent* Hull; // 0x1d28(0x08)
	struct UChildActorComponent* MastForeSailAngleRight; // 0x1d30(0x08)
	struct UChildActorComponent* MastForeSailAngleLeft; // 0x1d38(0x08)
	struct USceneComponent* MiddleDeckBarrels; // 0x1d40(0x08)
	struct UChildActorComponent* MastMainSailAngleRight; // 0x1d48(0x08)
	struct UChildActorComponent* MastMizzenSailAngleRight; // 0x1d50(0x08)
	struct UChildActorComponent* MastMizzenSailAngleLeft; // 0x1d58(0x08)
	struct UChildActorComponent* MastForeSailHoistRight; // 0x1d60(0x08)
	struct UChildActorComponent* MastForeSailHoistLeft; // 0x1d68(0x08)
	struct UChildActorComponent* MastMizzenSailHoistRight; // 0x1d70(0x08)
	struct UChildActorComponent* MastMizzenSailHoistLeft; // 0x1d78(0x08)
	struct UChildActorComponent* MastMainSailHoistRight; // 0x1d80(0x08)
	struct UChildActorComponent* MastMainSailHoistLeft; // 0x1d88(0x08)
	struct UChildActorComponent* Capstan; // 0x1d90(0x08)
	struct UChildActorComponent* MastFore; // 0x1d98(0x08)
	struct UChildActorComponent* MastMain; // 0x1da0(0x08)
	struct UChildActorComponent* MastMizzen; // 0x1da8(0x08)
	struct UChildActorComponent* Anchor; // 0x1db0(0x08)
	struct UChildActorComponent* Rudder; // 0x1db8(0x08)
	struct UChildActorComponent* Wheel; // 0x1dc0(0x08)
	struct UChildActorComponent* AudioBoat; // 0x1dc8(0x08)
	struct UChildActorComponent* MastMainSailAngleLeft; // 0x1dd0(0x08)
	char Timeline_Disable_Secondary__Direction_FB2965C04D191887E0A8AE9EBF5C5978; // 0x1dd8(0x01)
	char UnknownData_1DD9[0x7]; // 0x1dd9(0x07)
	struct UTimelineComponent* Timeline_Disable_Secondary; // 0x1de0(0x08)
	char Timeline_DisableSplash1__Direction_6B41A1B3430D6C615C4EFEB03700C527; // 0x1de8(0x01)
	char UnknownData_1DE9[0x7]; // 0x1de9(0x07)
	struct UTimelineComponent* Timeline_DisableSplash1; // 0x1df0(0x08)

	void IsPlayerOnShip(bool PlayerOnShip); // Function BP_LargeShipTemplate.BP_LargeShipTemplate_C.IsPlayerOnShip // Private|HasOutParms|BlueprintCallable|BlueprintEvent // @ game+0x1848130
	char GetPxActorCapacityForPhysXAggregate(); // Function BP_LargeShipTemplate.BP_LargeShipTemplate_C.GetPxActorCapacityForPhysXAggregate // Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const // @ game+0x1848130
	void SetupMastControls(struct UChildActorComponent* LeftHoist, struct UChildActorComponent* RightHoist, struct UChildActorComponent* LeftAngle, struct UChildActorComponent* RightAngle, struct FName RiggingGroupName); // Function BP_LargeShipTemplate.BP_LargeShipTemplate_C.SetupMastControls // Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void UserConstructionScript(); // Function BP_LargeShipTemplate.BP_LargeShipTemplate_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void Timeline_DisableSplash1__FinishedFunc(); // Function BP_LargeShipTemplate.BP_LargeShipTemplate_C.Timeline_DisableSplash1__FinishedFunc // BlueprintEvent // @ game+0x1848130
	void Timeline_DisableSplash1__UpdateFunc(); // Function BP_LargeShipTemplate.BP_LargeShipTemplate_C.Timeline_DisableSplash1__UpdateFunc // BlueprintEvent // @ game+0x1848130
	void Timeline_Disable_Secondary__FinishedFunc(); // Function BP_LargeShipTemplate.BP_LargeShipTemplate_C.Timeline_Disable_Secondary__FinishedFunc // BlueprintEvent // @ game+0x1848130
	void Timeline_Disable_Secondary__UpdateFunc(); // Function BP_LargeShipTemplate.BP_LargeShipTemplate_C.Timeline_Disable_Secondary__UpdateFunc // BlueprintEvent // @ game+0x1848130
	void OnPlayerShipBeginSurface(); // Function BP_LargeShipTemplate.BP_LargeShipTemplate_C.OnPlayerShipBeginSurface // Event|Public|BlueprintEvent // @ game+0x1848130
	void OnPlayerShipDive(); // Function BP_LargeShipTemplate.BP_LargeShipTemplate_C.OnPlayerShipDive // Event|Public|BlueprintEvent // @ game+0x1848130
	void OnPlayerShipSailing(); // Function BP_LargeShipTemplate.BP_LargeShipTemplate_C.OnPlayerShipSailing // Event|Public|BlueprintEvent // @ game+0x1848130
	void ExecuteUbergraph_BP_LargeShipTemplate(int32_t EntryPoint); // Function BP_LargeShipTemplate.BP_LargeShipTemplate_C.ExecuteUbergraph_BP_LargeShipTemplate //  // @ game+0x1848130
};

