// BlueprintGeneratedClass BP_LargeShipLanterns.BP_LargeShipLanterns_C
// Size: 0x448 (Inherited: 0x3c8)
struct ABP_LargeShipLanterns_C : AActor {
	struct UChildActorComponent* Railing_BowRightBack; // 0x3c8(0x08)
	struct UChildActorComponent* Railing_BowLeftBack; // 0x3d0(0x08)
	struct UChildActorComponent* Railing_Stern; // 0x3d8(0x08)
	struct UChildActorComponent* Cabin_Lantern; // 0x3e0(0x08)
	struct UChildActorComponent* BrigDeck_StairsRight; // 0x3e8(0x08)
	struct UChildActorComponent* BrigDeck_StairsLeft; // 0x3f0(0x08)
	struct UChildActorComponent* BrigDeck_OutsideBrig; // 0x3f8(0x08)
	struct UChildActorComponent* BrigDeck_InsideBrig; // 0x400(0x08)
	struct UChildActorComponent* MapDeck_RearStairs; // 0x408(0x08)
	struct UChildActorComponent* MapDeck_BowRight; // 0x410(0x08)
	struct UChildActorComponent* MapDeck_BowLeft; // 0x418(0x08)
	struct UChildActorComponent* MapDeck_Galley; // 0x420(0x08)
	struct UChildActorComponent* MapDeck_MapTable; // 0x428(0x08)
	struct UChildActorComponent* MapDeck_MainStairs; // 0x430(0x08)
	struct UChildActorComponent* Cabin_Entrance; // 0x438(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x440(0x08)

	void UserConstructionScript(); // Function BP_LargeShipLanterns.BP_LargeShipLanterns_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

