// BlueprintGeneratedClass BP_MediumShipTemplate.BP_MediumShipTemplate_C
// Size: 0x1c88 (Inherited: 0x1890)
struct ABP_MediumShipTemplate_C : AShip {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1890(0x08)
	struct UShipRowboatPersistenceComponent* ShipRowboatPersistence; // 0x1898(0x08)
	struct UHarpoonItemLocationComponent* HarpoonItemLocation1; // 0x18a0(0x08)
	struct UHarpoonItemLocationComponent* HarpoonItemLocation; // 0x18a8(0x08)
	struct UFactionParticleComponent* FactionGBowParticles; // 0x18b0(0x08)
	struct UFactionParticleComponent* FactionBBowParticles; // 0x18b8(0x08)
	struct USplashProbeVFXComponent* VFX_SplashProbe_Both_Splashes_Details; // 0x18c0(0x08)
	struct USplashProbeVFXComponent* VFX_SplashProbe_Both_Splashes_Second; // 0x18c8(0x08)
	struct USplashProbeVFXComponent* VFX_SplashProbe_OnShip_Splashes; // 0x18d0(0x08)
	struct USplashProbeVFXComponent* VFX_SplashProbe_Offship_Splashes; // 0x18d8(0x08)
	struct USplashProbeVFXComponent* VFX_SplashProbe_Underwater; // 0x18e0(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_rectangle_Local_VS1; // 0x18e8(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_cannon_Local4; // 0x18f0(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_cannon_Local3; // 0x18f8(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_cannon_Local2; // 0x1900(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_cannon_Local1; // 0x1908(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_rectangle_Local_VS3; // 0x1910(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_rectangle_Local_VS2; // 0x1918(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_rectangle_surface_Huge_Bottom; // 0x1920(0x08)
	struct UParticleSystemComponent* vfx_playerships_bubbles_rectangle_surface_Huge_Top; // 0x1928(0x08)
	struct USceneComponent* VFX_Scene; // 0x1930(0x08)
	struct UShipFactionCustomisation* ShipFactionCustomisation; // 0x1938(0x08)
	struct UBP_ShipTrinketMountpointManagerComponent_Medium_C* ShipTrinketMountpointManagerComponent_Medium; // 0x1940(0x08)
	struct UChildActorComponent* CaptainsLog; // 0x1948(0x08)
	struct UChildActorComponent* ShipsCrest; // 0x1950(0x08)
	struct UChildActorComponent* Rugs; // 0x1958(0x08)
	struct UChildActorComponent* Drapes; // 0x1960(0x08)
	struct UChildActorComponent* Bed; // 0x1968(0x08)
	struct UShipStorageJettisonComponent* ShipStorageJettison; // 0x1970(0x08)
	struct UChildActorComponent* VoyageTable; // 0x1978(0x08)
	struct UStaticMeshComponent* Rat3; // 0x1980(0x08)
	struct UStaticMeshComponent* Rat2; // 0x1988(0x08)
	struct UStaticMeshComponent* Rat1; // 0x1990(0x08)
	struct UBP_BedComponent_C* BP_BedComponent; // 0x1998(0x08)
	struct URatManagerComponent* RatManager; // 0x19a0(0x08)
	struct UBP_SeatComponent_C* Seat_Port_Rear_3; // 0x19a8(0x08)
	struct UBP_SeatComponent_C* Seat_Starboard_Rear_3; // 0x19b0(0x08)
	struct UBP_SeatComponent_C* Seat_MapTable_3; // 0x19b8(0x08)
	struct UBP_SeatComponent_C* Seat_MapTable; // 0x19c0(0x08)
	struct UBP_SeatComponent_C* Seat_Barrel_Front; // 0x19c8(0x08)
	struct UBP_SeatComponent_C* Seat_Bed_End; // 0x19d0(0x08)
	struct UBP_SeatComponent_C* Seat_Starboard_Front; // 0x19d8(0x08)
	struct UBP_SeatComponent_C* Seat_Port_Front; // 0x19e0(0x08)
	struct UBP_SeatComponent_C* Seat_Starboard_Mid; // 0x19e8(0x08)
	struct UBP_SeatComponent_C* Seat_Port_Mid; // 0x19f0(0x08)
	struct UBP_SeatComponent_C* Seat_Starboard_Rear; // 0x19f8(0x08)
	struct UBP_SeatComponent_C* Seat_Port_Rear; // 0x1a00(0x08)
	struct UAIRegionComponent* AIRegion; // 0x1a08(0x08)
	struct UNamedPointsComponent* NamedPoints; // 0x1a10(0x08)
	struct UStaticMeshComponent* shp_mid_ladder_gap_hits_01_a; // 0x1a18(0x08)
	struct UStaticMeshComponent* shp_flag_hole_01_a; // 0x1a20(0x08)
	struct UChildActorComponent* BP_EmissaryFlag; // 0x1a28(0x08)
	struct UEmissaryFlotsamItemSpawnComponent* EmissaryFlotsamItemSpawner; // 0x1a30(0x08)
	struct UChildActorComponent* BP_LargeShip_CageLatch_03_b; // 0x1a38(0x08)
	struct UChildActorComponent* BP_WaterBarrel; // 0x1a40(0x08)
	struct UChildActorComponent* BP_MediumShip_ServingHatch_Left; // 0x1a48(0x08)
	struct UChildActorComponent* BP_MediumShip_ServingHatch_Right; // 0x1a50(0x08)
	struct UChildActorComponent* BP_Shroudbreaker; // 0x1a58(0x08)
	struct UChildActorComponent* BP_ShipPetChest; // 0x1a60(0x08)
	struct UPetHangoutSpotComponent* PetHangoutSpot; // 0x1a68(0x08)
	struct UChildActorComponent* BP_HarpoonLauncher1; // 0x1a70(0x08)
	struct UChildActorComponent* BP_HarpoonLauncher; // 0x1a78(0x08)
	struct UChildActorComponent* RowboatMountpoint; // 0x1a80(0x08)
	struct UShipTelemetryComponent* ShipTelemetry; // 0x1a88(0x08)
	struct UTeleportLocationComponent* TeleportLocation_06; // 0x1a90(0x08)
	struct UTeleportLocationComponent* TeleportLocation_05; // 0x1a98(0x08)
	struct UTeleportLocationComponent* TeleportLocation_04; // 0x1aa0(0x08)
	struct UTeleportLocationComponent* TeleportLocation_03; // 0x1aa8(0x08)
	struct UTeleportLocationComponent* TeleportLocation_02; // 0x1ab0(0x08)
	struct UChildActorComponent* StorageBarrel_LowerDeck17; // 0x1ab8(0x08)
	struct UChildActorComponent* Figurehead; // 0x1ac0(0x08)
	struct UChildActorComponent* BP_MediumShip_StandardHull_Art_Interior_Lower_Deck; // 0x1ac8(0x08)
	struct UChildActorComponent* StorageBarrel_LowerDeck16; // 0x1ad0(0x08)
	struct UChildActorComponent* StorageBarrel_LowerDeck15; // 0x1ad8(0x08)
	struct UChildActorComponent* StorageBarrel_LowerDeck14; // 0x1ae0(0x08)
	struct UChildActorComponent* StorageBarrel_LowerDeck13; // 0x1ae8(0x08)
	struct UChildActorComponent* StorageBarrel_LowerDeck11; // 0x1af0(0x08)
	struct UChildActorComponent* StorageBarrel_LowerDeck9; // 0x1af8(0x08)
	struct UChildActorComponent* ShipStorageBarrel_Food2; // 0x1b00(0x08)
	struct UChildActorComponent* StorageBarrel_LowerDeck7; // 0x1b08(0x08)
	struct UChildActorComponent* StorageBarrel_LowerDeck2; // 0x1b10(0x08)
	struct UChildActorComponent* ShipStorageBarrel_Cannonball3; // 0x1b18(0x08)
	struct UChildActorComponent* StorageBarrel_LowerDeck1; // 0x1b20(0x08)
	struct UChildActorComponent* CannonLeft2; // 0x1b28(0x08)
	struct UChildActorComponent* CannonRight2; // 0x1b30(0x08)
	struct UChildActorComponent* LadderStbd; // 0x1b38(0x08)
	struct UChildActorComponent* MastSecondarySailAngleLeft; // 0x1b40(0x08)
	struct UChildActorComponent* MastSecondarySailAngleRight; // 0x1b48(0x08)
	struct UChildActorComponent* MastSecondarySailHoistRight; // 0x1b50(0x08)
	struct UChildActorComponent* MastSecondarySailHoistLeft; // 0x1b58(0x08)
	struct URiggingSystemComponent* ControlsRigging; // 0x1b60(0x08)
	struct UChildActorComponent* MastSecondary; // 0x1b68(0x08)
	struct UChildActorComponent* BP_ShipVanityChest; // 0x1b70(0x08)
	struct UChildActorComponent* Lanterns; // 0x1b78(0x08)
	struct UChildActorComponent* ShipStorageBarrel_Food; // 0x1b80(0x08)
	struct UChildActorComponent* ShipStorageBarrel_Cannonball2; // 0x1b88(0x08)
	struct UChildActorComponent* ShipStorageBarrel_Cannonball1; // 0x1b90(0x08)
	struct UChildActorComponent* BP_EquipmentChest; // 0x1b98(0x08)
	struct UChildActorComponent* BP_ClothingChest; // 0x1ba0(0x08)
	struct UChildActorComponent* BP_WeaponsChest; // 0x1ba8(0x08)
	struct UChildActorComponent* BP_MediumMapTable; // 0x1bb0(0x08)
	struct UChildActorComponent* Capstan; // 0x1bb8(0x08)
	struct UChildActorComponent* GrogBarrel; // 0x1bc0(0x08)
	struct UChildActorComponent* MastMainSailAngleLeft; // 0x1bc8(0x08)
	struct UChildActorComponent* ShipStorageBarrel_Wood; // 0x1bd0(0x08)
	struct UBoxComponent* RammingSpurZone; // 0x1bd8(0x08)
	struct UStaticMeshComponent* shp_shark_hits_01_a; // 0x1be0(0x08)
	struct UChildActorComponent* BP_AmmoChest; // 0x1be8(0x08)
	struct UTeleportLocationComponent* TeleportLocation_01; // 0x1bf0(0x08)
	struct URiggingSystemComponent* MainRigging; // 0x1bf8(0x08)
	struct UChildActorComponent* ShipsCompass; // 0x1c00(0x08)
	struct UChildActorComponent* CannonRight1; // 0x1c08(0x08)
	struct UChildActorComponent* CannonLeft1; // 0x1c10(0x08)
	struct UChildActorComponent* LadderPort; // 0x1c18(0x08)
	struct UChildActorComponent* Hull; // 0x1c20(0x08)
	struct UChildActorComponent* MastMainSailAngleRight; // 0x1c28(0x08)
	struct UChildActorComponent* MastMainSailHoistRight; // 0x1c30(0x08)
	struct UChildActorComponent* MastMainSailHoistLeft; // 0x1c38(0x08)
	struct UChildActorComponent* MastMain; // 0x1c40(0x08)
	struct UChildActorComponent* Anchor; // 0x1c48(0x08)
	struct UChildActorComponent* Rudder; // 0x1c50(0x08)
	struct UChildActorComponent* Wheel; // 0x1c58(0x08)
	struct UChildActorComponent* AudioBoat; // 0x1c60(0x08)
	char Timeline_Disable_Secondary__Direction_4D07E5D94B11FB7BFCD31080D1D1A104; // 0x1c68(0x01)
	char UnknownData_1C69[0x7]; // 0x1c69(0x07)
	struct UTimelineComponent* Timeline_Disable_Secondary; // 0x1c70(0x08)
	char Timeline_DisableSplash__Direction_F1180A934213087B71070ABD22B1621C; // 0x1c78(0x01)
	char UnknownData_1C79[0x7]; // 0x1c79(0x07)
	struct UTimelineComponent* Timeline_DisableSplash; // 0x1c80(0x08)

	void IsPlayerOnShip(bool IsPlayerOnShip); // Function BP_MediumShipTemplate.BP_MediumShipTemplate_C.IsPlayerOnShip // Public|HasOutParms|BlueprintCallable|BlueprintEvent // @ game+0x1848130
	char GetPxActorCapacityForPhysXAggregate(); // Function BP_MediumShipTemplate.BP_MediumShipTemplate_C.GetPxActorCapacityForPhysXAggregate // Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const // @ game+0x1848130
	void SetupMastControls(struct UChildActorComponent* LeftHoist, struct UChildActorComponent* RightHoist, struct UChildActorComponent* LeftAngle, struct UChildActorComponent* RightAngle, struct FName RiggingGroupName); // Function BP_MediumShipTemplate.BP_MediumShipTemplate_C.SetupMastControls // Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void UserConstructionScript(); // Function BP_MediumShipTemplate.BP_MediumShipTemplate_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void Timeline_DisableSplash__FinishedFunc(); // Function BP_MediumShipTemplate.BP_MediumShipTemplate_C.Timeline_DisableSplash__FinishedFunc // BlueprintEvent // @ game+0x1848130
	void Timeline_DisableSplash__UpdateFunc(); // Function BP_MediumShipTemplate.BP_MediumShipTemplate_C.Timeline_DisableSplash__UpdateFunc // BlueprintEvent // @ game+0x1848130
	void Timeline_Disable_Secondary__FinishedFunc(); // Function BP_MediumShipTemplate.BP_MediumShipTemplate_C.Timeline_Disable_Secondary__FinishedFunc // BlueprintEvent // @ game+0x1848130
	void Timeline_Disable_Secondary__UpdateFunc(); // Function BP_MediumShipTemplate.BP_MediumShipTemplate_C.Timeline_Disable_Secondary__UpdateFunc // BlueprintEvent // @ game+0x1848130
	void OnPlayerShipBeginSurface(); // Function BP_MediumShipTemplate.BP_MediumShipTemplate_C.OnPlayerShipBeginSurface // Event|Public|BlueprintEvent // @ game+0x1848130
	void OnPlayerShipDive(); // Function BP_MediumShipTemplate.BP_MediumShipTemplate_C.OnPlayerShipDive // Event|Public|BlueprintEvent // @ game+0x1848130
	void OnPlayerShipSailing(); // Function BP_MediumShipTemplate.BP_MediumShipTemplate_C.OnPlayerShipSailing // Event|Public|BlueprintEvent // @ game+0x1848130
	void ExecuteUbergraph_BP_MediumShipTemplate(int32_t EntryPoint); // Function BP_MediumShipTemplate.BP_MediumShipTemplate_C.ExecuteUbergraph_BP_MediumShipTemplate //  // @ game+0x1848130
};

