// BlueprintGeneratedClass BP_MediumShipLanterns.BP_MediumShipLanterns_C
// Size: 0x410 (Inherited: 0x3c8)
struct ABP_MediumShipLanterns_C : AActor {
	struct UChildActorComponent* brig_new_4; // 0x3c8(0x08)
	struct UChildActorComponent* brig_new_3; // 0x3d0(0x08)
	struct UChildActorComponent* brig_new; // 0x3d8(0x08)
	struct UChildActorComponent* Railing_Wheel; // 0x3e0(0x08)
	struct UChildActorComponent* Cabin_QuestTable; // 0x3e8(0x08)
	struct UChildActorComponent* Railing_BowRightFront; // 0x3f0(0x08)
	struct UChildActorComponent* Railing_BowLeftFront; // 0x3f8(0x08)
	struct UChildActorComponent* CabinQuestTable; // 0x400(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x408(0x08)

	void UserConstructionScript(); // Function BP_MediumShipLanterns.BP_MediumShipLanterns_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

