// BlueprintGeneratedClass BP_MediumShip_StandardHull_Art_Interior_Lower_Deck.BP_MediumShip_StandardHull_Art_Interior_Lower_Deck_C
// Size: 0x488 (Inherited: 0x3c8)
struct ABP_MediumShip_StandardHull_Art_Interior_Lower_Deck_C : AActor {
	struct UHitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x3c8(0x08)
	struct UChildActorComponent* BP_CookingPot2; // 0x3d0(0x08)
	struct UStaticMeshComponent* cap_inkwell_01_a; // 0x3d8(0x08)
	struct UChildActorComponent* CaptainsBookcase; // 0x3e0(0x08)
	struct UChildActorComponent* BP_MediumShip_LowerDeck_Dressing_01_a; // 0x3e8(0x08)
	struct UStaticMeshComponent* cap_cage_03_a; // 0x3f0(0x08)
	struct UChildActorComponent* BP_CookingPot; // 0x3f8(0x08)
	struct UStaticMeshComponent* shp_kitchen_shelf_02_a; // 0x400(0x08)
	struct UStaticMeshComponent* shp_kitchen_extractor_01_a; // 0x408(0x08)
	struct UStaticMeshComponent* shp_mid_lower_deck_rope_01_a; // 0x410(0x08)
	struct UStaticMeshComponent* cap_cabin_map_rolls_01_a; // 0x418(0x08)
	struct UMergedStaticMeshComponent* MergedStaticMesh; // 0x420(0x08)
	struct UStaticMeshComponent* shp_item_shelf_01_a1; // 0x428(0x08)
	struct UStaticMeshComponent* shp_cooker_02_a; // 0x430(0x08)
	struct UStaticMeshComponent* shp_item_shelf_01_a; // 0x438(0x08)
	struct UStaticMeshComponent* cap_cabin_trunk_01_a; // 0x440(0x08)
	struct UStaticMeshComponent* cap_skull_candle_01_a; // 0x448(0x08)
	struct UMergedStaticMeshComponent* MergedStaticMesh_col; // 0x450(0x08)
	struct UPostProcessComponent* PostProcess; // 0x458(0x08)
	struct UBoxComponent* PP_collision; // 0x460(0x08)
	struct UStaticMeshComponent* shp_mid_brig_01_a; // 0x468(0x08)
	struct UStaticMeshComponent* shp_mid_stairs_01_a; // 0x470(0x08)
	struct UStaticMeshComponent* shp_mid_lower_deck_01_a; // 0x478(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x480(0x08)

	void UserConstructionScript(); // Function BP_MediumShip_StandardHull_Art_Interior_Lower_Deck.BP_MediumShip_StandardHull_Art_Interior_Lower_Deck_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

