// BlueprintGeneratedClass BP_MediumShip_StandardHull_Damage.BP_MediumShip_StandardHull_Damage_C
// Size: 0x6f8 (Inherited: 0x658)
struct ABP_MediumShip_StandardHull_Damage_C : ABP_HullDamage_C {
	struct UStaticMeshComponent* projectile_collision; // 0x658(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_20; // 0x660(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_19; // 0x668(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_18; // 0x670(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_17; // 0x678(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_16; // 0x680(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_14; // 0x688(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_13; // 0x690(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_12; // 0x698(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_11; // 0x6a0(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_09; // 0x6a8(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_08; // 0x6b0(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_07; // 0x6b8(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_06; // 0x6c0(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_05; // 0x6c8(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_04; // 0x6d0(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_03; // 0x6d8(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_02; // 0x6e0(0x08)
	struct UChildActorComponent* Damage_Zone_Middle_01; // 0x6e8(0x08)
	struct UStaticMeshComponent* shp_mid_hull_damage_01_a; // 0x6f0(0x08)

	void UserConstructionScript(); // Function BP_MediumShip_StandardHull_Damage.BP_MediumShip_StandardHull_Damage_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

