// BlueprintGeneratedClass BP_MediumShip_StandardHull_Art.BP_MediumShip_StandardHull_Art_C
// Size: 0x408 (Inherited: 0x3c8)
struct ABP_MediumShip_StandardHull_Art_C : AActor {
	struct UHitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x3c8(0x08)
	struct UPostProcessComponent* BattleBoundsPostProcess; // 0x3d0(0x08)
	struct UBoxComponent* BattleBounds_PP_Volume; // 0x3d8(0x08)
	struct UPostProcessComponent* FirePostProcess; // 0x3e0(0x08)
	struct UBoxComponent* Fire_PP_Volume; // 0x3e8(0x08)
	struct USurfaceWaterComponent* SurfaceWater; // 0x3f0(0x08)
	struct UStaticMeshComponent* shp_small_rain_occlusion; // 0x3f8(0x08)
	struct UStaticMeshComponent* shp_galleon_main_deck_01_a; // 0x400(0x08)

	void UserConstructionScript(); // Function BP_MediumShip_StandardHull_Art.BP_MediumShip_StandardHull_Art_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

