// BlueprintGeneratedClass BP_out_shop_wsp_01_a.BP_out_shop_wsp_01_a_C
// Size: 0x5f8 (Inherited: 0x3c8)
struct ABP_out_shop_wsp_01_a_C : AActor {
	struct UWorldLocationPopUpComponent* WorldLocationPopUp; // 0x3c8(0x08)
	struct UPetHangoutSpotComponent* PetHangoutSpot1; // 0x3d0(0x08)
	struct UPetHangoutSpotComponent* PetHangoutSpot; // 0x3d8(0x08)
	struct UStaticMeshComponent* bld_out_shop_supports_01; // 0x3e0(0x08)
	struct UStaticMeshComponent* bld_out_shop_steps_01; // 0x3e8(0x08)
	struct UStaticMeshComponent* bld_out_shop_roof_01; // 0x3f0(0x08)
	struct UStaticMeshComponent* bld_out_shop_rail_01; // 0x3f8(0x08)
	struct UStaticMeshComponent* bld_out_shop_decking_01; // 0x400(0x08)
	struct UStaticMeshComponent* bld_out_shop_front_sign_01_a; // 0x408(0x08)
	struct UStaticMeshComponent* shp_anchor_01_a; // 0x410(0x08)
	struct UChildActorComponent* BP_OutpostCrate_bld_shop_wood_box_03_a_3; // 0x418(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost_4; // 0x420(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost_3; // 0x428(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost; // 0x430(0x08)
	struct USpotLightComponent* SpotLight3; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x440(0x08)
	struct UChildActorComponent* ChildActor1; // 0x448(0x08)
	struct UChildActorComponent* ChildActor; // 0x450(0x08)
	struct UChildActorComponent* wsp_light_large_pot; // 0x458(0x08)
	struct USpotLightComponent* SpotLight2; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x468(0x08)
	struct UStaticMeshComponent* tls_wld_Orb_light_a; // 0x470(0x08)
	struct UChildActorComponent* wsp_bottle_burner; // 0x478(0x08)
	struct UChildActorComponent* wsp_light_plate_a; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x488(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a_7; // 0x490(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a_4; // 0x498(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a_3; // 0x4a0(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a_2; // 0x4a8(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a_6; // 0x4b0(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a_5; // 0x4b8(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a_8; // 0x4c0(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a_9; // 0x4c8(0x08)
	struct UStaticMeshComponent* wsp_bush_08_c; // 0x4d0(0x08)
	struct UStaticMeshComponent* wsp_vine_01_d; // 0x4d8(0x08)
	struct UStaticMeshComponent* wsp_vine_01_a; // 0x4e0(0x08)
	struct UStaticMeshComponent* wsp_vine_02_b; // 0x4e8(0x08)
	struct UStaticMeshComponent* wsp_vine_02_d; // 0x4f0(0x08)
	struct UStaticMeshComponent* wsp_bush_fern_01_a; // 0x4f8(0x08)
	struct UChildActorComponent* BP_OutpostCrate_bld_shop_wood_box_01_a; // 0x500(0x08)
	struct UChildActorComponent* BP_OutpostCrate_bld_shop_wood_box_02_a; // 0x508(0x08)
	struct UChildActorComponent* BP_OutpostCrate_bld_shop_wood_box_03_a; // 0x510(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x518(0x08)
	struct UParticleSystemComponent* vfx_tavern_candle_looping_01; // 0x520(0x08)
	struct USpotLightComponent* SpotLight1; // 0x528(0x08)
	struct UPointLightComponent* PointLight2; // 0x530(0x08)
	struct UPointLightComponent* PointLight; // 0x538(0x08)
	struct USpotLightComponent* SpotLight; // 0x540(0x08)
	struct UStaticMeshComponent* shp_rope_coil_03_a; // 0x548(0x08)
	struct UStaticMeshComponent* bld_out_shop_workbench_01_a; // 0x550(0x08)
	struct UStaticMeshComponent* cmn_lantern_01_a; // 0x558(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x560(0x08)
	struct UStaticMeshComponent* cmn_bucket_01_a1; // 0x568(0x08)
	struct UStaticMeshComponent* shp_rope_coil_02_a; // 0x570(0x08)
	struct UStaticMeshComponent* shp_int_hook_01_a; // 0x578(0x08)
	struct UStaticMeshComponent* shp_kitchen_shelf_01_a; // 0x580(0x08)
	struct UStaticMeshComponent* cmn_bucket_01_a; // 0x588(0x08)
	struct UStaticMeshComponent* bld_shop_wood_box_03_a1; // 0x590(0x08)
	struct UStaticMeshComponent* shp_rope_coil_05_a; // 0x598(0x08)
	struct UStaticMeshComponent* bld_out_shop_hatch_01_a; // 0x5a0(0x08)
	struct UStaticMeshComponent* bld_out_shop_drapes_rear_01_a; // 0x5a8(0x08)
	struct UStaticMeshComponent* bld_out_shop_hanging_wood_01_a; // 0x5b0(0x08)
	struct UStaticMeshComponent* bld_out_shop_hook_bands_01_a; // 0x5b8(0x08)
	struct UStaticMeshComponent* bld_out_shop_plank_netting_01_a; // 0x5c0(0x08)
	struct UStaticMeshComponent* bld_out_shop_barrel_netting_01_a; // 0x5c8(0x08)
	struct UStaticMeshComponent* bld_out_shop_drapes_front_01_a; // 0x5d0(0x08)
	struct UStaticMeshComponent* bld_out_shop_winch_01_a; // 0x5d8(0x08)
	struct UStaticMeshComponent* bld_out_shop_roof_beam_01_a; // 0x5e0(0x08)
	struct UStaticMeshComponent* bld_out_shop_roof_barrels_01_a; // 0x5e8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x5f0(0x08)

	void UserConstructionScript(); // Function BP_out_shop_wsp_01_a.BP_out_shop_wsp_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

