// BlueprintGeneratedClass BP_onboarding_intro_tavern_table.BP_onboarding_intro_tavern_table_C
// Size: 0x420 (Inherited: 0x3c8)
struct ABP_onboarding_intro_tavern_table_C : AActor {
	struct UParticleSystemComponent* Candle VFX; // 0x3c8(0x08)
	struct UOnboardingIntroLocationComponent* OnboardingIntroLocation; // 0x3d0(0x08)
	struct UStaticMeshComponent* Table; // 0x3d8(0x08)
	struct UStaticMeshComponent* Tankard 2; // 0x3e0(0x08)
	struct UStaticMeshComponent* Plate 2; // 0x3e8(0x08)
	struct UStaticMeshComponent* Candle 3; // 0x3f0(0x08)
	struct UStaticMeshComponent* Candle 2; // 0x3f8(0x08)
	struct UStaticMeshComponent* Tankard 1; // 0x400(0x08)
	struct UStaticMeshComponent* Plate 1; // 0x408(0x08)
	struct UStaticMeshComponent* Candle 1; // 0x410(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x418(0x08)

	void UserConstructionScript(); // Function BP_onboarding_intro_tavern_table.BP_onboarding_intro_tavern_table_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

