// BlueprintGeneratedClass BP_prem_shop_wld_01_a.BP_prem_shop_wld_01_a_C
// Size: 0x7b0 (Inherited: 0x3c8)
struct ABP_prem_shop_wld_01_a_C : AActor {
	struct UWorldLocationPopUpComponent* WorldLocationPopUp; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x3d0(0x08)
	struct UPointLightComponent* PointLight1; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x3e8(0x08)
	struct UPetHangoutSpotComponent* PetHangoutSpot; // 0x3f0(0x08)
	struct UCompanyRegionComponent* CompanyRegion; // 0x3f8(0x08)
	struct UStaticMeshComponent* tls_wld_torch_skull_b; // 0x400(0x08)
	struct UStaticMeshComponent* tls_wld_Orb_light_a; // 0x408(0x08)
	struct UPointLightComponent* PointLight15; // 0x410(0x08)
	struct USpotLightComponent* SpotLight3; // 0x418(0x08)
	struct UPointLightComponent* PointLight14; // 0x420(0x08)
	struct UPointLightComponent* PointLight13; // 0x428(0x08)
	struct UPointLightComponent* PointLight12; // 0x430(0x08)
	struct UPointLightComponent* PointLight10; // 0x438(0x08)
	struct USpotLightComponent* SpotLight2; // 0x440(0x08)
	struct UPointLightComponent* PointLight9; // 0x448(0x08)
	struct UPointLightComponent* PointLight7; // 0x450(0x08)
	struct USpotLightComponent* SpotLight1; // 0x458(0x08)
	struct UPointLightComponent* PointLight6; // 0x460(0x08)
	struct UPointLightComponent* PointLight5; // 0x468(0x08)
	struct UPointLightComponent* PointLight3; // 0x470(0x08)
	struct UPointLightComponent* PointLight; // 0x478(0x08)
	struct USpotLightComponent* SpotLight; // 0x480(0x08)
	struct UStaticMeshComponent* AnimalSack; // 0x488(0x08)
	struct UStaticMeshComponent* Pot; // 0x490(0x08)
	struct UStaticMeshComponent* Banana_Sack; // 0x498(0x08)
	struct UStaticMeshComponent* Boat2; // 0x4a0(0x08)
	struct UStaticMeshComponent* fod_banana_01_a; // 0x4a8(0x08)
	struct UStaticMeshComponent* Book3; // 0x4b0(0x08)
	struct UStaticMeshComponent* Book2; // 0x4b8(0x08)
	struct UChildActorComponent* ChildActor1; // 0x4c0(0x08)
	struct UStaticMeshComponent* RopeExterior; // 0x4c8(0x08)
	struct UParticleSystemComponent* ParticleSystem3; // 0x4d0(0x08)
	struct UStaticMeshComponent* Bottle5; // 0x4d8(0x08)
	struct UStaticMeshComponent* Mannequin2; // 0x4e0(0x08)
	struct UStaticMeshComponent* Book; // 0x4e8(0x08)
	struct UStaticMeshComponent* Sidetable; // 0x4f0(0x08)
	struct UStaticMeshComponent* Moneysack2; // 0x4f8(0x08)
	struct UStaticMeshComponent* Moneysack1; // 0x500(0x08)
	struct UStaticMeshComponent* DrapesRoof; // 0x508(0x08)
	struct UStaticMeshComponent* Dreamcatcher4; // 0x510(0x08)
	struct UStaticMeshComponent* WoodPole2; // 0x518(0x08)
	struct UStaticMeshComponent* WoodPole1; // 0x520(0x08)
	struct UStaticMeshComponent* Ladder4; // 0x528(0x08)
	struct UStaticMeshComponent* Shelf1; // 0x530(0x08)
	struct UStaticMeshComponent* Bananas1; // 0x538(0x08)
	struct UStaticMeshComponent* Dreamcatcher2; // 0x540(0x08)
	struct UStaticMeshComponent* Ladder3; // 0x548(0x08)
	struct UStaticMeshComponent* Ladder2; // 0x550(0x08)
	struct UStaticMeshComponent* Platform; // 0x558(0x08)
	struct UStaticMeshComponent* Ladder1; // 0x560(0x08)
	struct UStaticMeshComponent* Collar1; // 0x568(0x08)
	struct UStaticMeshComponent* Hooks2; // 0x570(0x08)
	struct UStaticMeshComponent* Hooks1; // 0x578(0x08)
	struct UStaticMeshComponent* Dreamcatcher3; // 0x580(0x08)
	struct UStaticMeshComponent* Sack_Banana2; // 0x588(0x08)
	struct UStaticMeshComponent* Sack_Banana; // 0x590(0x08)
	struct UStaticMeshComponent* Sack_Banana3; // 0x598(0x08)
	struct UStaticMeshComponent* Mannequin; // 0x5a0(0x08)
	struct UStaticMeshComponent* Dreamcatcher1; // 0x5a8(0x08)
	struct UChildActorComponent* BP_wil_monkey_big_04; // 0x5b0(0x08)
	struct UChildActorComponent* BP_wil_parrot_04; // 0x5b8(0x08)
	struct UStaticMeshComponent* bld_shop_sign_ancient_01_a; // 0x5c0(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x5c8(0x08)
	struct UStaticMeshComponent* cmn_bottle_01_a; // 0x5d0(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x5d8(0x08)
	struct UStaticMeshComponent* bld_shop_wood_box_03_a; // 0x5e0(0x08)
	struct UStaticMeshComponent* cmn_animal_cage_01_a; // 0x5e8(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x5f0(0x08)
	struct UStaticMeshComponent* bld_cls_shop_bird_cage_01_a; // 0x5f8(0x08)
	struct UStaticMeshComponent* bld_cls_shp_dye_pot_01_a1; // 0x600(0x08)
	struct UStaticMeshComponent* cmn_moneybag_01_a2; // 0x608(0x08)
	struct UStaticMeshComponent* cmn_bird_cage_01_a; // 0x610(0x08)
	struct UStaticMeshComponent* bld_prem_shop_rope_details_01_d; // 0x618(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x620(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x628(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x630(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x638(0x08)
	struct UParticleSystemComponent* ParticleSystem1; // 0x640(0x08)
	struct UPointLightComponent* PointLight8; // 0x648(0x08)
	struct UChildActorComponent* bp_lantern_hook_01_a; // 0x650(0x08)
	struct UChildActorComponent* AudioSpace; // 0x658(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a4; // 0x660(0x08)
	struct UStaticMeshComponent* bld_enc_shop_sign_01_a; // 0x668(0x08)
	struct UStaticMeshComponent* cap_cage_01_a; // 0x670(0x08)
	struct UStaticMeshComponent* shp_kra_shark_rug_01_a; // 0x678(0x08)
	struct UStaticMeshComponent* bld_pot_shop_table_wld_01_a; // 0x680(0x08)
	struct UStaticMeshComponent* bld_pot_shop_window_01_a1; // 0x688(0x08)
	struct UStaticMeshComponent* bld_prem_shop_wilds_details_01_a; // 0x690(0x08)
	struct UStaticMeshComponent* bld_prem_shop_01_a; // 0x698(0x08)
	struct UStaticMeshComponent* bld_int_large_shelf_03_a1; // 0x6a0(0x08)
	struct UStaticMeshComponent* bld_int_large_shelf_03_a; // 0x6a8(0x08)
	struct UStaticMeshComponent* cap_cabin_books_aged_03_a; // 0x6b0(0x08)
	struct UStaticMeshComponent* cap_cabin_books_02_a; // 0x6b8(0x08)
	struct UStaticMeshComponent* cap_cabin_books_03_a; // 0x6c0(0x08)
	struct UStaticMeshComponent* trs_coins_01_a_coin_2; // 0x6c8(0x08)
	struct UStaticMeshComponent* cmn_broken_shovel_01_a; // 0x6d0(0x08)
	struct UStaticMeshComponent* cmn_clay_vase_01_b; // 0x6d8(0x08)
	struct UStaticMeshComponent* trs_plate_01_a; // 0x6e0(0x08)
	struct UStaticMeshComponent* gmp_dice_kra_01_a; // 0x6e8(0x08)
	struct UStaticMeshComponent* gmp_dice_01_e; // 0x6f0(0x08)
	struct UStaticMeshComponent* gmp_dice_01_d; // 0x6f8(0x08)
	struct UStaticMeshComponent* bld_enc_shop_pin_board_01_a; // 0x700(0x08)
	struct UStaticMeshComponent* bld_enc_shop_burner_pot_01_a; // 0x708(0x08)
	struct UStaticMeshComponent* bld_int_large_sideboard_03_a; // 0x710(0x08)
	struct UStaticMeshComponent* cmn_moneybag_01_a; // 0x718(0x08)
	struct UStaticMeshComponent* cmn_step_ladder_01_a; // 0x720(0x08)
	struct UStaticMeshComponent* cmn_candle_01_e; // 0x728(0x08)
	struct UStaticMeshComponent* cap_skull_candle_01_a; // 0x730(0x08)
	struct UStaticMeshComponent* bld_par_weathervane_01_b; // 0x738(0x08)
	struct UStaticMeshComponent* bld_tvn_post_01_c; // 0x740(0x08)
	struct UStaticMeshComponent* cap_cabin_curtain_03_a; // 0x748(0x08)
	struct UStaticMeshComponent* bld_int_small_shelves_01_a; // 0x750(0x08)
	struct UStaticMeshComponent* bld_pot_shop_door_frame_01_a; // 0x758(0x08)
	struct UStaticMeshComponent* bld_pot_shop_roof_beam_01_a; // 0x760(0x08)
	struct UStaticMeshComponent* bld_pot_shop_chimney_01_a; // 0x768(0x08)
	struct UStaticMeshComponent* bld_pot_gate_01_a; // 0x770(0x08)
	struct UStaticMeshComponent* bld_pot_fence_01_a; // 0x778(0x08)
	struct UStaticMeshComponent* bld_pot_shop_window_01_a3; // 0x780(0x08)
	struct UStaticMeshComponent* bld_pot_hatch_01_a; // 0x788(0x08)
	struct UStaticMeshComponent* bld_pot_shop_door_01_a; // 0x790(0x08)
	struct UStaticMeshComponent* bld_pot_shop_window_01_a2; // 0x798(0x08)
	struct UStaticMeshComponent* bld_pot_shop_window_01_a; // 0x7a0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x7a8(0x08)

	void UserConstructionScript(); // Function BP_prem_shop_wld_01_a.BP_prem_shop_wld_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

