// BlueprintGeneratedClass BP_shop_gld_01_a.BP_shop_gld_01_a_C
// Size: 0x4d0 (Inherited: 0x3c8)
struct ABP_shop_gld_01_a_C : AActor {
	struct UWorldLocationPopUpComponent* WorldLocationPopUp; // 0x3c8(0x08)
	struct UCompanyRegionComponent* CompanyRegion; // 0x3d0(0x08)
	struct USpotLightComponent* SpotLight5; // 0x3d8(0x08)
	struct USpotLightComponent* SpotLight4; // 0x3e0(0x08)
	struct UPointLightComponent* PointLight4; // 0x3e8(0x08)
	struct USpotLightComponent* SpotLight3; // 0x3f0(0x08)
	struct USpotLightComponent* SpotLight2; // 0x3f8(0x08)
	struct USpotLightComponent* SpotLight1; // 0x400(0x08)
	struct USpotLightComponent* SpotLight; // 0x408(0x08)
	struct UPointLightComponent* PointLight3; // 0x410(0x08)
	struct UPointLightComponent* PointLight2; // 0x418(0x08)
	struct UParticleSystemComponent* ParticleSystem2; // 0x420(0x08)
	struct UParticleSystemComponent* ParticleSystem1; // 0x428(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x430(0x08)
	struct UParticleSystemComponent* vfx_torch_02_weak; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x440(0x08)
	struct UStaticMeshComponent* wsp_light_source_plate_a; // 0x448(0x08)
	struct UStaticMeshComponent* wsp_light_source_pot_a1; // 0x450(0x08)
	struct UStaticMeshComponent* wsp_light_source_pot_a; // 0x458(0x08)
	struct UPointLightComponent* PointLight1; // 0x460(0x08)
	struct UPointLightComponent* PointLight; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x470(0x08)
	struct UStaticMeshComponent* tls_wld_orb_light_c; // 0x478(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_a; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x4a0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x4a8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x4b0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x4b8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x4c0(0x08)
	struct USceneComponent* SharedRoot; // 0x4c8(0x08)

	void UserConstructionScript(); // Function BP_shop_gld_01_a.BP_shop_gld_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

