// BlueprintGeneratedClass BP_shop_oos_01_a.BP_shop_oos_01_a_C
// Size: 0x5a0 (Inherited: 0x3c8)
struct ABP_shop_oos_01_a_C : AActor {
	struct UWorldLocationPopUpComponent* WorldLocationPopUp; // 0x3c8(0x08)
	struct UStaticMeshComponent* wsp_Oos_shop_dressing_01_a; // 0x3d0(0x08)
	struct UBoxComponent* Collision_01; // 0x3d8(0x08)
	struct UPointLightComponent* PointLight2; // 0x3e0(0x08)
	struct UParticleSystemComponent* vfx_candle_01_magic_blue2; // 0x3e8(0x08)
	struct UParticleSystemComponent* vfx_candle_01_magic_blue1; // 0x3f0(0x08)
	struct UStaticMeshComponent* cmn_candle_01_e; // 0x3f8(0x08)
	struct UStaticMeshComponent* bld_shop_bone_oos_04_a; // 0x400(0x08)
	struct UStaticMeshComponent* cmn_skeleton_head_chicken_01_a; // 0x408(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_a5; // 0x410(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_a4; // 0x418(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_a3; // 0x420(0x08)
	struct UChildActorComponent* MagicBox; // 0x428(0x08)
	struct UStaticMeshComponent* bld_int_small_sideboard_01_a; // 0x430(0x08)
	struct UStaticMeshComponent* bld_flag_post_oos_01_a; // 0x438(0x08)
	struct UParticleSystemComponent* vfx_mist_furnace_pirate_hideout; // 0x440(0x08)
	struct UParticleSystemComponent* vfx_dust_01_air; // 0x448(0x08)
	struct UParticleSystemComponent* vfx_candle_01_smoke_tavern1; // 0x450(0x08)
	struct UParticleSystemComponent* vfx_candle_01_magic_blue; // 0x458(0x08)
	struct UStaticMeshComponent* bld_shop_bone_oos_02_a2; // 0x460(0x08)
	struct UStaticMeshComponent* bld_shop_bone_oos_05_a1; // 0x468(0x08)
	struct UStaticMeshComponent* bld_shop_bone_oos_08_a; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x478(0x08)
	struct UStaticMeshComponent* bld_shop_table_cloth_oos_01_a; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x488(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_a2; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x498(0x08)
	struct UStaticMeshComponent* bld_shop_cloth_walls_oos_01_a; // 0x4a0(0x08)
	struct USpotLightComponent* SpotLight6; // 0x4a8(0x08)
	struct USpotLightComponent* SpotLight5; // 0x4b0(0x08)
	struct USpotLightComponent* SpotLight4; // 0x4b8(0x08)
	struct USpotLightComponent* SpotLight3; // 0x4c0(0x08)
	struct USpotLightComponent* SpotLight2; // 0x4c8(0x08)
	struct UPostProcessComponent* PostProcess; // 0x4d0(0x08)
	struct UBoxComponent* Box; // 0x4d8(0x08)
	struct USpotLightComponent* SpotLight1; // 0x4e0(0x08)
	struct UChildActorComponent* ChildActor1; // 0x4e8(0x08)
	struct UChildActorComponent* ChildActor; // 0x4f0(0x08)
	struct USpotLightComponent* SpotLight; // 0x4f8(0x08)
	struct UPointLightComponent* PointLight5; // 0x500(0x08)
	struct UChildActorComponent* wsp_light_large_pot; // 0x508(0x08)
	struct UParticleSystemComponent* vfx_magic_fire_pot; // 0x510(0x08)
	struct UPointLightComponent* PointLight1; // 0x518(0x08)
	struct UPointLightComponent* PointLight; // 0x520(0x08)
	struct UCompanyRegionComponent* CompanyRegion; // 0x528(0x08)
	struct UStaticMeshComponent* bld_shop_entrance_oos_01_a; // 0x530(0x08)
	struct UStaticMeshComponent* bld_shop_pillar_symbols_oos_01_a; // 0x538(0x08)
	struct UStaticMeshComponent* bld_enc_shop_kettle_01_a; // 0x540(0x08)
	struct UStaticMeshComponent* bld_int_stool_01_a; // 0x548(0x08)
	struct UStaticMeshComponent* bld_enc_shop_burner_pot_01_a; // 0x550(0x08)
	struct UStaticMeshComponent* cmn_barrel_salvage_01_d; // 0x558(0x08)
	struct UStaticMeshComponent* cap_skull_candle_01_a; // 0x560(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_a1; // 0x568(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_a; // 0x570(0x08)
	struct UStaticMeshComponent* bld_shop_curtain_oos_01_a; // 0x578(0x08)
	struct UStaticMeshComponent* bld_shop_table_oos_01_a; // 0x580(0x08)
	struct UStaticMeshComponent* bld_shop_skull_crate_oos_01_a; // 0x588(0x08)
	struct UStaticMeshComponent* bld_shop_skull_barrel_oos_01_a; // 0x590(0x08)
	struct USceneComponent* SharedRoot; // 0x598(0x08)

	void Set Magic Box Hidden(bool Is Hidden); // Function BP_shop_oos_01_a.BP_shop_oos_01_a_C.Set Magic Box Hidden // Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
	void UserConstructionScript(); // Function BP_shop_oos_01_a.BP_shop_oos_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

