// BlueprintGeneratedClass BP_shop_mrh_01_a.BP_shop_mrh_01_a_C
// Size: 0x508 (Inherited: 0x3c8)
struct ABP_shop_mrh_01_a_C : AActor {
	struct UWorldLocationPopUpComponent* WorldLocationPopUp; // 0x3c8(0x08)
	struct UChildActorComponent* CommodityManifestBook; // 0x3d0(0x08)
	struct UStaticMeshComponent* bld_prem_shop_plinth_01_b; // 0x3d8(0x08)
	struct UParticleSystemComponent* vfx_candle_01_tavern_02; // 0x3e0(0x08)
	struct UParticleSystemComponent* vfx_candle_01_flickering_tavern_small_02; // 0x3e8(0x08)
	struct UStaticMeshComponent* cmn_candle_01_b; // 0x3f0(0x08)
	struct UStaticMeshComponent* cmn_candle_01_d_02; // 0x3f8(0x08)
	struct UPointLightComponent* PointLight3; // 0x400(0x08)
	struct UParticleSystemComponent* vfx_candle_01_tavern1; // 0x408(0x08)
	struct UParticleSystemComponent* vfx_candle_01_flickering_tavern_small; // 0x410(0x08)
	struct UStaticMeshComponent* cmn_candle_01_c; // 0x418(0x08)
	struct UStaticMeshComponent* cmn_candle_01_d; // 0x420(0x08)
	struct UStaticMeshComponent* cmp_ships_manifest_mrh_01_e; // 0x428(0x08)
	struct UPetHangoutSpotComponent* PetHangoutSpot; // 0x430(0x08)
	struct UStaticMeshComponent* bld_shop_mrh_01_b; // 0x438(0x08)
	struct UStaticMeshComponent* bld_shop_mrh_01_f; // 0x440(0x08)
	struct UStaticMeshComponent* bld_shop_mrh_01_e; // 0x448(0x08)
	struct UStaticMeshComponent* bld_shop_mrh_01_d; // 0x450(0x08)
	struct UStaticMeshComponent* bld_shop_mrh_01_c; // 0x458(0x08)
	struct USpotLightComponent* SpotLight4; // 0x460(0x08)
	struct USpotLightComponent* SpotLight3; // 0x468(0x08)
	struct UCompanyRegionComponent* CompanyRegion; // 0x470(0x08)
	struct USpotLightComponent* SpotLight2; // 0x478(0x08)
	struct USpotLightComponent* SpotLight1; // 0x480(0x08)
	struct UPointLightComponent* PointLight2; // 0x488(0x08)
	struct UChildActorComponent* ChildActor; // 0x490(0x08)
	struct UPointLightComponent* PointLight1; // 0x498(0x08)
	struct UChildActorComponent* bp_light_volume_sphere_orange_a; // 0x4a0(0x08)
	struct UPointLightComponent* PointLight; // 0x4a8(0x08)
	struct UChildActorComponent* tls_wld_Orb_light_a; // 0x4b0(0x08)
	struct USpotLightComponent* SpotLight; // 0x4b8(0x08)
	struct UParticleSystemComponent* vfx_candle_01_tavern; // 0x4c0(0x08)
	struct UStaticMeshComponent* bld_shop_globe_mrh_01_a; // 0x4c8(0x08)
	struct UStaticMeshComponent* bld_par_lantern_01_a; // 0x4d0(0x08)
	struct UStaticMeshComponent* bld_shop_blackboard_mch_01_a; // 0x4d8(0x08)
	struct UStaticMeshComponent* bld_shop_map_board_mch_01_a; // 0x4e0(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x4e8(0x08)
	struct UStaticMeshComponent* bld_shop_wood_box_03_a; // 0x4f0(0x08)
	struct UStaticMeshComponent* bld_shop_wood_box_01_a; // 0x4f8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x500(0x08)

	void UserConstructionScript(); // Function BP_shop_mrh_01_a.BP_shop_mrh_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

