// BlueprintGeneratedClass BP_SmallShipLanterns.BP_SmallShipLanterns_C
// Size: 0x408 (Inherited: 0x3c8)
struct ABP_SmallShipLanterns_C : AActor {
	struct UChildActorComponent* Railing_Wheel; // 0x3c8(0x08)
	struct UChildActorComponent* BottomDeckFront; // 0x3d0(0x08)
	struct UChildActorComponent* BottomDeckBrig; // 0x3d8(0x08)
	struct UChildActorComponent* CabinMapTable; // 0x3e0(0x08)
	struct UChildActorComponent* Railing_BowRightFront; // 0x3e8(0x08)
	struct UChildActorComponent* Railing_BowLeftFront; // 0x3f0(0x08)
	struct UChildActorComponent* CabinQuestTable; // 0x3f8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x400(0x08)

	void UserConstructionScript(); // Function BP_SmallShipLanterns.BP_SmallShipLanterns_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

