// BlueprintGeneratedClass BP_SovereignHut.BP_SovereignHut_C
// Size: 0x898 (Inherited: 0x3c8)
struct ABP_SovereignHut_C : AActor {
	struct UBP_SeatComponent_C* Seat_PullyArm_5; // 0x3c8(0x08)
	struct UBP_SeatComponent_C* Seat_PullyArm_4; // 0x3d0(0x08)
	struct UBP_SeatComponent_C* Seat_PullyArm_2; // 0x3d8(0x08)
	struct UBP_SeatComponent_C* Seat_Hut_4; // 0x3e0(0x08)
	struct UBP_SeatComponent_C* Seat_Hut_3; // 0x3e8(0x08)
	struct UBP_SeatComponent_C* Seat_Hut_2; // 0x3f0(0x08)
	struct UBP_SeatComponent_C* Seat_PullyArm_3; // 0x3f8(0x08)
	struct UBP_SeatComponent_C* Seat_Lookout_3; // 0x400(0x08)
	struct UBP_SeatComponent_C* Seat_Lookout_2; // 0x408(0x08)
	struct UStaticMeshComponent* gmp_fishing_rod_elb_02_a; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMesh76; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMesh75; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMesh74; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMesh73; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMesh72; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMesh71; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMesh52; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMesh50; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMesh46; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMesh44; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMesh42; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMesh41; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMesh40; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMesh19; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMesh18; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x4a0(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x4a8(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x4b0(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x4b8(0x08)
	struct UStaticMeshComponent* shp_int_hook_01_a; // 0x4c0(0x08)
	struct UStaticMeshComponent* cmn_man_cage_rope_knot_a; // 0x4c8(0x08)
	struct UStaticMeshComponent* act_bracket_01_c; // 0x4d0(0x08)
	struct UStaticMeshComponent* StaticMesh24; // 0x4d8(0x08)
	struct UParticleSystemComponent* ParticleSystem13; // 0x4e0(0x08)
	struct UParticleSystemComponent* vfx_dust_motes; // 0x4e8(0x08)
	struct UPostProcessComponent* PostProcess1; // 0x4f0(0x08)
	struct UCapsuleComponent* Capsule1; // 0x4f8(0x08)
	struct UPostProcessComponent* PostProcess2; // 0x500(0x08)
	struct UCapsuleComponent* Capsule; // 0x508(0x08)
	struct UChildActorComponent* ChildActor3; // 0x510(0x08)
	struct UChildActorComponent* ChildActor2; // 0x518(0x08)
	struct USpotLightComponent* SpotLight10; // 0x520(0x08)
	struct USpotLightComponent* SpotLight9; // 0x528(0x08)
	struct UPointLightComponent* PointLight9; // 0x530(0x08)
	struct USpotLightComponent* SpotLight8; // 0x538(0x08)
	struct UParticleSystemComponent* ParticleSystem12; // 0x540(0x08)
	struct UParticleSystemComponent* ParticleSystem11; // 0x548(0x08)
	struct USpotLightComponent* SpotLight; // 0x550(0x08)
	struct UStaticMeshComponent* StaticMesh23; // 0x558(0x08)
	struct UStaticMeshComponent* bld_par_lantern_01_a; // 0x560(0x08)
	struct UChildActorComponent* ChildActor1; // 0x568(0x08)
	struct UChildActorComponent* ChildActor; // 0x570(0x08)
	struct UParticleSystemComponent* ParticleSystem10; // 0x578(0x08)
	struct UParticleSystemComponent* ParticleSystem9; // 0x580(0x08)
	struct UParticleSystemComponent* ParticleSystem8; // 0x588(0x08)
	struct UParticleSystemComponent* ParticleSystem7; // 0x590(0x08)
	struct UParticleSystemComponent* ParticleSystem6; // 0x598(0x08)
	struct UParticleSystemComponent* ParticleSystem5; // 0x5a0(0x08)
	struct UParticleSystemComponent* ParticleSystem4; // 0x5a8(0x08)
	struct UParticleSystemComponent* ParticleSystem3; // 0x5b0(0x08)
	struct UParticleSystemComponent* ParticleSystem2; // 0x5b8(0x08)
	struct UParticleSystemComponent* ParticleSystem1; // 0x5c0(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x5c8(0x08)
	struct UParticleSystemComponent* vfx_candle_01_flickering_tavern; // 0x5d0(0x08)
	struct UChildActorComponent* BP_Candle_Light_01_a; // 0x5d8(0x08)
	struct UPointLightComponent* PointLight8; // 0x5e0(0x08)
	struct UPointLightComponent* PointLight7; // 0x5e8(0x08)
	struct UPointLightComponent* PointLight6; // 0x5f0(0x08)
	struct UPointLightComponent* PointLight5; // 0x5f8(0x08)
	struct UPointLightComponent* PointLight4; // 0x600(0x08)
	struct UPointLightComponent* PointLight3; // 0x608(0x08)
	struct UStaticMeshComponent* StaticMesh70; // 0x610(0x08)
	struct UStaticMeshComponent* StaticMesh69; // 0x618(0x08)
	struct UStaticMeshComponent* StaticMesh61; // 0x620(0x08)
	struct UStaticMeshComponent* StaticMesh60; // 0x628(0x08)
	struct UStaticMeshComponent* StaticMesh59; // 0x630(0x08)
	struct UStaticMeshComponent* StaticMesh58; // 0x638(0x08)
	struct UStaticMeshComponent* StaticMesh51; // 0x640(0x08)
	struct UStaticMeshComponent* StaticMesh45; // 0x648(0x08)
	struct UStaticMeshComponent* StaticMesh43; // 0x650(0x08)
	struct UStaticMeshComponent* StaticMesh34; // 0x658(0x08)
	struct UStaticMeshComponent* StaticMesh21; // 0x660(0x08)
	struct UStaticMeshComponent* cmn_candle_01_a; // 0x668(0x08)
	struct UStaticMeshComponent* StaticMesh31; // 0x670(0x08)
	struct UStaticMeshComponent* StaticMesh28; // 0x678(0x08)
	struct UStaticMeshComponent* trs_candlestick_02_a; // 0x680(0x08)
	struct UStaticMeshComponent* trs_candlestick_03_a1; // 0x688(0x08)
	struct UStaticMeshComponent* trs_candlestick_03_a; // 0x690(0x08)
	struct UStaticMeshComponent* volumetric_sphere; // 0x698(0x08)
	struct USpotLightComponent* SpotLight7; // 0x6a0(0x08)
	struct USpotLightComponent* SpotLight6; // 0x6a8(0x08)
	struct UPointLightComponent* PointLight2; // 0x6b0(0x08)
	struct UPointLightComponent* PointLight1; // 0x6b8(0x08)
	struct UPointLightComponent* PointLight; // 0x6c0(0x08)
	struct USpotLightComponent* SpotLight4; // 0x6c8(0x08)
	struct USpotLightComponent* SpotLight3; // 0x6d0(0x08)
	struct USpotLightComponent* SpotLight2; // 0x6d8(0x08)
	struct USpotLightComponent* SpotLight1; // 0x6e0(0x08)
	struct UPostProcessComponent* PostProcess; // 0x6e8(0x08)
	struct UBoxComponent* Box; // 0x6f0(0x08)
	struct UStaticMeshComponent* cap_candle_chandelier_candle_flames_01_a; // 0x6f8(0x08)
	struct UStaticMeshComponent* bld_sovereign_cloth_02_a; // 0x700(0x08)
	struct UStaticMeshComponent* bld_sovereign_cloth_01_a; // 0x708(0x08)
	struct UStaticMeshComponent* bld_sovereign_hut_ropes_01_a; // 0x710(0x08)
	struct UStaticMeshComponent* StaticMesh68; // 0x718(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x720(0x08)
	struct UStaticMeshComponent* bld_sovereign_hut_mechanism_01_a; // 0x728(0x08)
	struct UStaticMeshComponent* bld_sovereign_hut_Base_01_a; // 0x730(0x08)
	struct UStaticMeshComponent* StaticMesh67; // 0x738(0x08)
	struct UStaticMeshComponent* StaticMesh65; // 0x740(0x08)
	struct UStaticMeshComponent* StaticMesh66; // 0x748(0x08)
	struct UStaticMeshComponent* StaticMesh64; // 0x750(0x08)
	struct UStaticMeshComponent* StaticMesh63; // 0x758(0x08)
	struct UStaticMeshComponent* bld_jetty_support_c; // 0x760(0x08)
	struct UStaticMeshComponent* StaticMesh22; // 0x768(0x08)
	struct UStaticMeshComponent* bld_sovereign_hut_crest_01_a; // 0x770(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x778(0x08)
	struct UStaticMeshComponent* StaticMesh62; // 0x780(0x08)
	struct UCompanyRegionComponent* CompanyRegion; // 0x788(0x08)
	struct UWorldLocationPopUpComponent* WorldLocationPopUp; // 0x790(0x08)
	struct UStaticMeshComponent* StaticMesh57; // 0x798(0x08)
	struct UStaticMeshComponent* StaticMesh56; // 0x7a0(0x08)
	struct UStaticMeshComponent* StaticMesh55; // 0x7a8(0x08)
	struct UStaticMeshComponent* StaticMesh54; // 0x7b0(0x08)
	struct UStaticMeshComponent* StaticMesh53; // 0x7b8(0x08)
	struct UStaticMeshComponent* StaticMesh49; // 0x7c0(0x08)
	struct UStaticMeshComponent* StaticMesh48; // 0x7c8(0x08)
	struct UStaticMeshComponent* StaticMesh47; // 0x7d0(0x08)
	struct UStaticMeshComponent* StaticMesh39; // 0x7d8(0x08)
	struct UStaticMeshComponent* StaticMesh38; // 0x7e0(0x08)
	struct UStaticMeshComponent* StaticMesh37; // 0x7e8(0x08)
	struct UStaticMeshComponent* StaticMesh36; // 0x7f0(0x08)
	struct UStaticMeshComponent* StaticMesh35; // 0x7f8(0x08)
	struct UStaticMeshComponent* StaticMesh33; // 0x800(0x08)
	struct UStaticMeshComponent* StaticMesh32; // 0x808(0x08)
	struct UStaticMeshComponent* StaticMesh30; // 0x810(0x08)
	struct UStaticMeshComponent* StaticMesh29; // 0x818(0x08)
	struct UStaticMeshComponent* StaticMesh27; // 0x820(0x08)
	struct UStaticMeshComponent* StaticMesh26; // 0x828(0x08)
	struct UStaticMeshComponent* StaticMesh25; // 0x830(0x08)
	struct UStaticMeshComponent* StaticMesh20; // 0x838(0x08)
	struct UStaticMeshComponent* StaticMesh17; // 0x840(0x08)
	struct UStaticMeshComponent* StaticMesh16; // 0x848(0x08)
	struct UStaticMeshComponent* StaticMesh15; // 0x850(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x858(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x860(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x868(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x870(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x878(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x880(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x888(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x890(0x08)

	void UserConstructionScript(); // Function BP_SovereignHut.BP_SovereignHut_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

