// BlueprintGeneratedClass BP_SmallShip_StandardHull_Art_Interior_Lower_Deck.BP_SmallShip_StandardHull_Art_Interior_Lower_Deck_C
// Size: 0x408 (Inherited: 0x3c8)
struct ABP_SmallShip_StandardHull_Art_Interior_Lower_Deck_C : AActor {
	struct UHitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x3c8(0x08)
	struct UChildActorComponent* BP_CookingPot2; // 0x3d0(0x08)
	struct UChildActorComponent* BP_CookingPot; // 0x3d8(0x08)
	struct UStaticMeshComponent* shp_kitchen_extractor_01_a; // 0x3e0(0x08)
	struct UStaticMeshComponent* shp_cooker_02_a; // 0x3e8(0x08)
	struct UStaticMeshComponent* shp_small_lower_deck_rope_01_a; // 0x3f0(0x08)
	struct UStaticMeshComponent* shp_small_lower_deck_01_a; // 0x3f8(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x400(0x08)

	void UserConstructionScript(); // Function BP_SmallShip_StandardHull_Art_Interior_Lower_Deck.BP_SmallShip_StandardHull_Art_Interior_Lower_Deck_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

