// BlueprintGeneratedClass BP_SmallShip_StandardHull_Art.BP_SmallShip_StandardHull_Art_C
// Size: 0x498 (Inherited: 0x3c8)
struct ABP_SmallShip_StandardHull_Art_C : AActor {
	struct UHitRegSnapshotRedirectImpactToReplicatedMovementAttachParentComponent* HitRegSnapshotRedirectImpactToReplicatedMovementAttachParent; // 0x3c8(0x08)
	struct UPostProcessComponent* BattleBoundsPostProcess; // 0x3d0(0x08)
	struct UBoxComponent* BattleBounds_PP_Volume; // 0x3d8(0x08)
	struct UStaticMeshComponent* cap_inkwell_01_a; // 0x3e0(0x08)
	struct UChildActorComponent* CaptainsBookcase; // 0x3e8(0x08)
	struct UStaticMeshComponent* shp_item_shelf_01_a1; // 0x3f0(0x08)
	struct UStaticMeshComponent* cap_book_stand_01_b; // 0x3f8(0x08)
	struct UPostProcessComponent* FirePostProcess; // 0x400(0x08)
	struct UBoxComponent* Fire_PP_Volume; // 0x408(0x08)
	struct UStaticMeshComponent* cap_cage_03_c; // 0x410(0x08)
	struct UStaticMeshComponent* shp_item_shelf_01_a; // 0x418(0x08)
	struct USurfaceWaterComponent* SurfaceWater; // 0x420(0x08)
	struct UStaticMeshComponent* shp_small_rain_occlusion; // 0x428(0x08)
	struct UStaticMeshComponent* shp_small_canopy_01_a1; // 0x430(0x08)
	struct UStaticMeshComponent* shp_small_hatch_01_a; // 0x438(0x08)
	struct UPostProcessComponent* PostProcess2; // 0x440(0x08)
	struct UBoxComponent* Below_Deck; // 0x448(0x08)
	struct UPostProcessComponent* PostProcess1; // 0x450(0x08)
	struct UBoxComponent* Map_Deck_B; // 0x458(0x08)
	struct UPostProcessComponent* PostProcess; // 0x460(0x08)
	struct UBoxComponent* Map_Deck; // 0x468(0x08)
	struct UStaticMeshComponent* shp_small_hull_rope_01_a; // 0x470(0x08)
	struct UMergedStaticMeshComponent* MergedStaticMesh; // 0x478(0x08)
	struct UChildActorComponent* BP_SmallShip_StandardHull_Art_Interior_Lower_Deck; // 0x480(0x08)
	struct UStaticMeshComponent* shp_small_stairs_01_a; // 0x488(0x08)
	struct UStaticMeshComponent* shp_small_main_deck_01_a; // 0x490(0x08)

	void UserConstructionScript(); // Function BP_SmallShip_StandardHull_Art.BP_SmallShip_StandardHull_Art_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

