// BlueprintGeneratedClass BP_trn_shop_wsp_01_a.BP_trn_shop_wsp_01_a_C
// Size: 0x648 (Inherited: 0x3c8)
struct ABP_trn_shop_wsp_01_a_C : AActor {
	struct UWorldLocationPopUpComponent* WorldLocationPopUp; // 0x3c8(0x08)
	struct UPetHangoutSpotComponent* PetHangoutSpot; // 0x3d0(0x08)
	struct UStaticMeshComponent* wsp_trn_shop_dressing_01_b; // 0x3d8(0x08)
	struct UStaticMeshComponent* wsp_trn_shop_dressing_01_a; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMesh35; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMesh34; // 0x3f0(0x08)
	struct UStaticMeshComponent* bld_trn_shop_hanging_sign_01_a; // 0x3f8(0x08)
	struct USpotLightComponent* SpotLight3; // 0x400(0x08)
	struct UChildActorComponent* BP_MusicBox; // 0x408(0x08)
	struct UChildActorComponent* BP_IslandEquipmentChest; // 0x410(0x08)
	struct UChildActorComponent* wsp_bottle_burner; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMesh33; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMesh32; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMesh31; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMesh30; // 0x438(0x08)
	struct USpotLightComponent* SpotLight2; // 0x440(0x08)
	struct UPointLightComponent* PointLight4; // 0x448(0x08)
	struct UPointLightComponent* PointLight; // 0x450(0x08)
	struct USpotLightComponent* SpotLight1; // 0x458(0x08)
	struct UPostProcessComponent* PostProcess; // 0x460(0x08)
	struct UBoxComponent* Box; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMesh29; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMesh28; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMesh27; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMesh26; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMesh25; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMesh24; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x4a0(0x08)
	struct UParticleSystemComponent* ParticleSystem3; // 0x4a8(0x08)
	struct UParticleSystemComponent* ParticleSystem2; // 0x4b0(0x08)
	struct UParticleSystemComponent* ParticleSystem1; // 0x4b8(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x4c0(0x08)
	struct UPointLightComponent* PointLight3; // 0x4c8(0x08)
	struct UPointLightComponent* PointLight2; // 0x4d0(0x08)
	struct UPointLightComponent* PointLight1; // 0x4d8(0x08)
	struct USpotLightComponent* SpotLight; // 0x4e0(0x08)
	struct UStaticMeshComponent* cmn_wheel_01_a__cmn_wheel_01_a; // 0x4e8(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x4f0(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x4f8(0x08)
	struct UChildActorComponent* AudioSpace; // 0x500(0x08)
	struct UStaticMeshComponent* wsp_vine_02_g; // 0x508(0x08)
	struct UStaticMeshComponent* wsp_vine_01_a; // 0x510(0x08)
	struct UStaticMeshComponent* wsp_vine_01_b; // 0x518(0x08)
	struct UStaticMeshComponent* wsp_vine_01_d; // 0x520(0x08)
	struct UStaticMeshComponent* wsp_vine_02_d; // 0x528(0x08)
	struct UStaticMeshComponent* wsp_plant_ball_01_a; // 0x530(0x08)
	struct UStaticMeshComponent* wsp_bush_08_c; // 0x538(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x540(0x08)
	struct UStaticMeshComponent* tls_shovel_01_a; // 0x548(0x08)
	struct UStaticMeshComponent* bld_cls_shop_hanging_cloth_03_a; // 0x550(0x08)
	struct UStaticMeshComponent* bld_out_shop_roof_ship_wheel_01_a; // 0x558(0x08)
	struct UStaticMeshComponent* bld_shop_drapes_03_a; // 0x560(0x08)
	struct UStaticMeshComponent* cmn_oar_01_a; // 0x568(0x08)
	struct UStaticMeshComponent* cap_cabin_curtain_03_a; // 0x570(0x08)
	struct UStaticMeshComponent* cap_cabinet_01_a; // 0x578(0x08)
	struct UStaticMeshComponent* bld_tvn_animal_rug_01_a; // 0x580(0x08)
	struct USkeletalMeshComponent* msc_voice_box_01_a; // 0x588(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x590(0x08)
	struct UStaticMeshComponent* bld_shop_wood_box_03_a1; // 0x598(0x08)
	struct UStaticMeshComponent* bld_shop_wood_box_01_a; // 0x5a0(0x08)
	struct UStaticMeshComponent* cmn_rowboat_oar_01_a; // 0x5a8(0x08)
	struct UStaticMeshComponent* bld_int_small_shelf_01_a; // 0x5b0(0x08)
	struct UStaticMeshComponent* bld_int_small_shelves_03_a; // 0x5b8(0x08)
	struct UStaticMeshComponent* bld_int_small_sideboard_01_a; // 0x5c0(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x5c8(0x08)
	struct UStaticMeshComponent* cmn_lantern_01_a; // 0x5d0(0x08)
	struct UStaticMeshComponent* bld_shop_drapes_04_a; // 0x5d8(0x08)
	struct UStaticMeshComponent* bld_shop_drapes_02_a; // 0x5e0(0x08)
	struct UStaticMeshComponent* cmn_looted_box_01_a; // 0x5e8(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_a; // 0x5f0(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a; // 0x5f8(0x08)
	struct UStaticMeshComponent* shp_kitchen_shelf_02_a; // 0x600(0x08)
	struct UStaticMeshComponent* bld_shop_table_01_a; // 0x608(0x08)
	struct UStaticMeshComponent* bld_trn_roof_beam_01_a; // 0x610(0x08)
	struct UStaticMeshComponent* bld_trn_shop_window_01_b2; // 0x618(0x08)
	struct UStaticMeshComponent* bld_trn_shop_window_01_b1; // 0x620(0x08)
	struct UStaticMeshComponent* bld_trn_shop_window_01_b; // 0x628(0x08)
	struct UStaticMeshComponent* bld_trn_shop_door_01_a; // 0x630(0x08)
	struct UStaticMeshComponent* bld_trn_shop_01_a; // 0x638(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x640(0x08)

	void UserConstructionScript(); // Function BP_trn_shop_wsp_01_a.BP_trn_shop_wsp_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

