// BlueprintGeneratedClass BP_tavern_BSP_01_b.BP_tavern_BSP_01_b_C
// Size: 0xb18 (Inherited: 0x3c8)
struct ABP_tavern_BSP_01_b_C : AActor {
	struct UBP_SeatComponent_C* Seat_Bannister_Outside_4; // 0x3c8(0x08)
	struct UBP_SeatComponent_C* Seat_Bannister_Outside_3; // 0x3d0(0x08)
	struct UBP_SeatComponent_C* Seat_Bannister_Outside_2; // 0x3d8(0x08)
	struct UChildActorComponent* TavernTrinketMountpoints; // 0x3e0(0x08)
	struct USpotLightComponent* SpotLight9; // 0x3e8(0x08)
	struct UStaticMeshComponent* Stool_IntroTable_4; // 0x3f0(0x08)
	struct UStaticMeshComponent* Stool_IntroTable_3; // 0x3f8(0x08)
	struct UStaticMeshComponent* Stool_IntroTable_2; // 0x400(0x08)
	struct UStaticMeshComponent* tls_lantern_01_e; // 0x408(0x08)
	struct USpotLightComponent* SpotLight8; // 0x410(0x08)
	struct UBoxComponent* NavMeshBlocker8; // 0x418(0x08)
	struct USpotLightComponent* SpotLight7; // 0x420(0x08)
	struct UPetHangoutSpotComponent* PetHangoutSpot; // 0x428(0x08)
	struct UStaticMeshComponent* RainBlockerUnderground; // 0x430(0x08)
	struct UBoxComponent* NavMeshBlocker7; // 0x438(0x08)
	struct UBoxComponent* NavMeshBlocker6; // 0x440(0x08)
	struct UBoxComponent* NavMesh Blocker5; // 0x448(0x08)
	struct UBoxComponent* NavMesh Blocker4; // 0x450(0x08)
	struct UBoxComponent* NavMesh Blocker3; // 0x458(0x08)
	struct UBoxComponent* NavMesh Blocker2; // 0x460(0x08)
	struct UBoxComponent* NavMesh Blocker; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x470(0x08)
	struct UBoxComponent* Roof_collison; // 0x478(0x08)
	struct UChildActorComponent* Onboarding Intro Table; // 0x480(0x08)
	struct USpotLightComponent* SpotLight6; // 0x488(0x08)
	struct USpotLightComponent* SpotLight5; // 0x490(0x08)
	struct UStaticMeshComponent* bld_tvn_entrance_01_a; // 0x498(0x08)
	struct UChildActorComponent* BP_MusicBox; // 0x4a0(0x08)
	struct UChildActorComponent* BP_Island_Bell; // 0x4a8(0x08)
	struct UStaticMeshComponent* cmn_wooden_crate_01_b; // 0x4b0(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x4b8(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x4c0(0x08)
	struct UChildActorComponent* BP_OutpostCrate_cmn_wooden_crate_01_a; // 0x4c8(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost_12; // 0x4d0(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost_11; // 0x4d8(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost_10; // 0x4e0(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost_9; // 0x4e8(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost_8; // 0x4f0(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost_7; // 0x4f8(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost_6; // 0x500(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost_5; // 0x508(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost_4; // 0x510(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost_3; // 0x518(0x08)
	struct UChildActorComponent* BP_IslandStorageBarrel_Outpost_2; // 0x520(0x08)
	struct UStaticMeshComponent* Rain_Blocker; // 0x528(0x08)
	struct UStaticMeshComponent* cmn_wheel_01_a__cmn_wheel_01_a; // 0x530(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x538(0x08)
	struct USpotLightComponent* SpotLight2; // 0x540(0x08)
	struct USpotLightComponent* SpotLight; // 0x548(0x08)
	struct UPointLightComponent* PointLight10; // 0x550(0x08)
	struct UPointLightComponent* PointLight9; // 0x558(0x08)
	struct UPointLightComponent* PointLight3; // 0x560(0x08)
	struct UChildActorComponent* ChildActor8; // 0x568(0x08)
	struct UChildActorComponent* ChildActor7; // 0x570(0x08)
	struct UChildActorComponent* ChildActor5; // 0x578(0x08)
	struct UChildActorComponent* ChildActor4; // 0x580(0x08)
	struct UChildActorComponent* ChildActor3; // 0x588(0x08)
	struct UChildActorComponent* ChildActor2; // 0x590(0x08)
	struct UChildActorComponent* ChildActor1; // 0x598(0x08)
	struct UChildActorComponent* ChildActor; // 0x5a0(0x08)
	struct UStaticMeshComponent* StaticMesh58; // 0x5a8(0x08)
	struct UStaticMeshComponent* shp_int_hook_01_a; // 0x5b0(0x08)
	struct UStaticMeshComponent* shp_fry_pan_01_a1; // 0x5b8(0x08)
	struct UStaticMeshComponent* cmn_animal_cage_01_a; // 0x5c0(0x08)
	struct UStaticMeshComponent* cmn_pirate_grave_01_c; // 0x5c8(0x08)
	struct UStaticMeshComponent* cmn_pirate_grave_01_a; // 0x5d0(0x08)
	struct UStaticMeshComponent* cmn_bottle_01_a; // 0x5d8(0x08)
	struct UPointLightComponent* PointLight12; // 0x5e0(0x08)
	struct UParticleSystemComponent* ParticleSystem12; // 0x5e8(0x08)
	struct UParticleSystemComponent* ParticleSystem8; // 0x5f0(0x08)
	struct UStaticMeshComponent* StaticMesh49; // 0x5f8(0x08)
	struct UStaticMeshComponent* StaticMesh48; // 0x600(0x08)
	struct UStaticMeshComponent* StaticMesh47; // 0x608(0x08)
	struct UPointLightComponent* PointLight5; // 0x610(0x08)
	struct UStaticMeshComponent* StaticMesh46; // 0x618(0x08)
	struct UStaticMeshComponent* StaticMesh45; // 0x620(0x08)
	struct UStaticMeshComponent* StaticMesh42; // 0x628(0x08)
	struct UStaticMeshComponent* StaticMesh41; // 0x630(0x08)
	struct UStaticMeshComponent* StaticMesh40; // 0x638(0x08)
	struct UStaticMeshComponent* StaticMesh39; // 0x640(0x08)
	struct UStaticMeshComponent* cap_cabin_books_03_a; // 0x648(0x08)
	struct UStaticMeshComponent* cap_cabin_books_01_a; // 0x650(0x08)
	struct UStaticMeshComponent* cap_cabin_books_aged_01_a; // 0x658(0x08)
	struct UStaticMeshComponent* cap_cabin_books_02_a; // 0x660(0x08)
	struct UStaticMeshComponent* StaticMesh35; // 0x668(0x08)
	struct UStaticMeshComponent* StaticMesh34; // 0x670(0x08)
	struct UStaticMeshComponent* StaticMesh32; // 0x678(0x08)
	struct UStaticMeshComponent* StaticMesh22; // 0x680(0x08)
	struct UStaticMeshComponent* StaticMesh20; // 0x688(0x08)
	struct UStaticMeshComponent* StaticMesh19; // 0x690(0x08)
	struct UStaticMeshComponent* StaticMesh16; // 0x698(0x08)
	struct UStaticMeshComponent* StaticMesh15; // 0x6a0(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x6a8(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x6b0(0x08)
	struct UStaticMeshComponent* cap_book_stand_01_a; // 0x6b8(0x08)
	struct UStaticMeshComponent* shp_rifle_rack_01_a; // 0x6c0(0x08)
	struct UStaticMeshComponent* shp_pistol_rack_01_a; // 0x6c8(0x08)
	struct UChildActorComponent* bp_lantern_hook_01_a2; // 0x6d0(0x08)
	struct UChildActorComponent* bp_lantern_hook_01_a; // 0x6d8(0x08)
	struct UPointLightComponent* PointLight11; // 0x6e0(0x08)
	struct USpotLightComponent* SpotLight4; // 0x6e8(0x08)
	struct USpotLightComponent* SpotLight3; // 0x6f0(0x08)
	struct USpotLightComponent* SpotLight1; // 0x6f8(0x08)
	struct UPointLightComponent* PointLight8; // 0x700(0x08)
	struct UPointLightComponent* PointLight7; // 0x708(0x08)
	struct UPointLightComponent* PointLight2; // 0x710(0x08)
	struct UChildActorComponent* BP_Tavern_B_AudioLayer; // 0x718(0x08)
	struct UPostProcessComponent* Post_Interior; // 0x720(0x08)
	struct UBoxComponent* PostProcess; // 0x728(0x08)
	struct UPointLightComponent* PointLight1; // 0x730(0x08)
	struct UPointLightComponent* PointLight6; // 0x738(0x08)
	struct UPointLightComponent* PointLight4; // 0x740(0x08)
	struct UPointLightComponent* PointLight; // 0x748(0x08)
	struct UParticleSystemComponent* vfx_fireplace_tavern; // 0x750(0x08)
	struct UStaticMeshComponent* cap_skull_candle_01_a; // 0x758(0x08)
	struct UStaticMeshComponent* StaticMesh54; // 0x760(0x08)
	struct UStaticMeshComponent* StaticMesh50; // 0x768(0x08)
	struct UStaticMeshComponent* StaticMesh44; // 0x770(0x08)
	struct UStaticMeshComponent* StaticMesh43; // 0x778(0x08)
	struct UStaticMeshComponent* gmp_mess_bot_01_a; // 0x780(0x08)
	struct UStaticMeshComponent* StaticMesh38; // 0x788(0x08)
	struct UStaticMeshComponent* fod_rum_01_a; // 0x790(0x08)
	struct UStaticMeshComponent* StaticMesh36; // 0x798(0x08)
	struct UStaticMeshComponent* shp_rope_coil_02_a; // 0x7a0(0x08)
	struct UStaticMeshComponent* shp_rope_coil_03_a; // 0x7a8(0x08)
	struct UStaticMeshComponent* StaticMesh31; // 0x7b0(0x08)
	struct UStaticMeshComponent* StaticMesh30; // 0x7b8(0x08)
	struct UStaticMeshComponent* StaticMesh29; // 0x7c0(0x08)
	struct UStaticMeshComponent* StaticMesh27; // 0x7c8(0x08)
	struct UStaticMeshComponent* shp_fry_pan_01_a; // 0x7d0(0x08)
	struct UStaticMeshComponent* StaticMesh23; // 0x7d8(0x08)
	struct UStaticMeshComponent* StaticMesh21; // 0x7e0(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x7e8(0x08)
	struct UParticleSystemComponent* ParticleSystem10; // 0x7f0(0x08)
	struct UStaticMeshComponent* cmn_step_ladder_01_a; // 0x7f8(0x08)
	struct UStaticMeshComponent* cmn_rowboat_oar_01_a; // 0x800(0x08)
	struct UStaticMeshComponent* shp_kitchen_table_01_a; // 0x808(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x810(0x08)
	struct UStaticMeshComponent* shp_kitchen_shelf_02_a; // 0x818(0x08)
	struct UStaticMeshComponent* cmn_wheel_01_a; // 0x820(0x08)
	struct USpotLightComponent* Light_fire; // 0x828(0x08)
	struct UParticleSystemComponent* ParticleSystem5; // 0x830(0x08)
	struct UParticleSystemComponent* ParticleSystem3; // 0x838(0x08)
	struct UPointLightComponent* Light_candle_5; // 0x840(0x08)
	struct UStaticMeshComponent* candle; // 0x848(0x08)
	struct USpotLightComponent* light_ceiling_4; // 0x850(0x08)
	struct USpotLightComponent* light_ceiling_5; // 0x858(0x08)
	struct UPointLightComponent* Light_candle_6; // 0x860(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x868(0x08)
	struct UPointLightComponent* Light_candle_7; // 0x870(0x08)
	struct UPointLightComponent* Light_candle_4; // 0x878(0x08)
	struct UPointLightComponent* Light_candle; // 0x880(0x08)
	struct UParticleSystemComponent* ParticleSystem9; // 0x888(0x08)
	struct UParticleSystemComponent* ParticleSystem7; // 0x890(0x08)
	struct UParticleSystemComponent* ParticleSystem6; // 0x898(0x08)
	struct UPointLightComponent* Light_lantern_2; // 0x8a0(0x08)
	struct UParticleSystemComponent* ParticleSystem2; // 0x8a8(0x08)
	struct UParticleSystemComponent* ParticleSystem1; // 0x8b0(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x8b8(0x08)
	struct UParticleSystemComponent* vfx_tavern_torch_looping_03; // 0x8c0(0x08)
	struct UParticleSystemComponent* vfx_tavern_torch_looping_02; // 0x8c8(0x08)
	struct UParticleSystemComponent* vfx_tavern_torch_looping_01; // 0x8d0(0x08)
	struct UStaticMeshComponent* bld_tavern_tile_beams_01_a; // 0x8d8(0x08)
	struct UStaticMeshComponent* bld_tavern_porch_01_a; // 0x8e0(0x08)
	struct UStaticMeshComponent* bld_tavern_floor_01_a; // 0x8e8(0x08)
	struct UStaticMeshComponent* bld_tvn_bench_01_a2; // 0x8f0(0x08)
	struct UStaticMeshComponent* cmn_rug_01_a1; // 0x8f8(0x08)
	struct UStaticMeshComponent* bld_tvn_interior_stairs_01_a; // 0x900(0x08)
	struct UStaticMeshComponent* bld_tvn_drapes_01_a; // 0x908(0x08)
	struct UStaticMeshComponent* bld_tvn_chimney_awning_01_a; // 0x910(0x08)
	struct UStaticMeshComponent* bld_tvn_wood_details_01_b; // 0x918(0x08)
	struct UStaticMeshComponent* cmn_candle_01_c; // 0x920(0x08)
	struct UStaticMeshComponent* cmn_candle_01_d; // 0x928(0x08)
	struct UStaticMeshComponent* cmn_candle_01_e; // 0x930(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_barrels_01_b_02; // 0x938(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_barrels_01_a_2; // 0x940(0x08)
	struct UStaticMeshComponent* bld_tvn_beam_sail_cloth_01_b; // 0x948(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_arches_01_a; // 0x950(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_top_01_a; // 0x958(0x08)
	struct UStaticMeshComponent* bld_tvn_chandelier_01_a_2; // 0x960(0x08)
	struct UStaticMeshComponent* bld_tvn_ceiling_rose_01_a_2; // 0x968(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_barrels_01_b_2; // 0x970(0x08)
	struct UStaticMeshComponent* bld_tvn_roof_window_01_a_2; // 0x978(0x08)
	struct UStaticMeshComponent* bld_tvn_veranda_01_a; // 0x980(0x08)
	struct UStaticMeshComponent* bld_tvn_stone_chimney_top_01_a; // 0x988(0x08)
	struct UStaticMeshComponent* bld_tvn_stone_chimney_base_01_a; // 0x990(0x08)
	struct UStaticMeshComponent* bld_tvn_sign_pole_01_a; // 0x998(0x08)
	struct UStaticMeshComponent* bld_tvn_roof_window_01_a; // 0x9a0(0x08)
	struct UStaticMeshComponent* bld_tvn_metal_chimney_01_a; // 0x9a8(0x08)
	struct UStaticMeshComponent* bld_tvn_exterior_stairs_01_a; // 0x9b0(0x08)
	struct UStaticMeshComponent* bld_tvn_chandelier_01_a; // 0x9b8(0x08)
	struct UStaticMeshComponent* bld_tvn_ceiling_rose_01_a; // 0x9c0(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_racks_01_a; // 0x9c8(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_base_01_a; // 0x9d0(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_barrels_01_b; // 0x9d8(0x08)
	struct UStaticMeshComponent* bld_tvn_bar_barrels_01_a; // 0x9e0(0x08)
	struct UStaticMeshComponent* bld_tavern_roof_01_a; // 0x9e8(0x08)
	struct UStaticMeshComponent* bld_tvn_rug_01_a2; // 0x9f0(0x08)
	struct UStaticMeshComponent* bld_tvn_rug_01_a1; // 0x9f8(0x08)
	struct UStaticMeshComponent* cmn_stool_01_a3; // 0xa00(0x08)
	struct UStaticMeshComponent* cmn_stool_01_a1; // 0xa08(0x08)
	struct UStaticMeshComponent* bld_tvn_post_01_c1; // 0xa10(0x08)
	struct UStaticMeshComponent* bld_tvn_post_01_c; // 0xa18(0x08)
	struct UStaticMeshComponent* bld_tvn_post_01_b; // 0xa20(0x08)
	struct UStaticMeshComponent* bld_tvn_rug_01_a; // 0xa28(0x08)
	struct UStaticMeshComponent* bld_tvn_animal_rug_01_a; // 0xa30(0x08)
	struct UStaticMeshComponent* cmn_stool_01_a; // 0xa38(0x08)
	struct UStaticMeshComponent* bld_tvn_beam_sail_cloth_01_a; // 0xa40(0x08)
	struct UStaticMeshComponent* bld_tvn_post_01_a; // 0xa48(0x08)
	struct UStaticMeshComponent* bld_tvn_bench_01_a1; // 0xa50(0x08)
	struct UStaticMeshComponent* bld_tvn_bench_01_a; // 0xa58(0x08)
	struct UStaticMeshComponent* bld_tvn_low_arch_01_a; // 0xa60(0x08)
	struct UStaticMeshComponent* bld_tvn_entrance_boat_01_a; // 0xa68(0x08)
	struct UStaticMeshComponent* bld_tvn_round_table_01_a; // 0xa70(0x08)
	struct UStaticMeshComponent* bld_tvn_table_01_a; // 0xa78(0x08)
	struct UStaticMeshComponent* bld_tvn_exterior_door_01_a2; // 0xa80(0x08)
	struct UStaticMeshComponent* bld_tvn_wood_holder_01_a; // 0xa88(0x08)
	struct UStaticMeshComponent* bld_tvn_fireplace_grate_01_a; // 0xa90(0x08)
	struct UStaticMeshComponent* bld_tvn_exterior_door_01_a1; // 0xa98(0x08)
	struct UStaticMeshComponent* bld_tvn_exterior_door_01_a; // 0xaa0(0x08)
	struct UStaticMeshComponent* bld_tvn_window_01_b5; // 0xaa8(0x08)
	struct UStaticMeshComponent* bld_tvn_window_01_b4; // 0xab0(0x08)
	struct UStaticMeshComponent* bld_tvn_window_01_b3; // 0xab8(0x08)
	struct UStaticMeshComponent* bld_tvn_window_01_a1; // 0xac0(0x08)
	struct UStaticMeshComponent* bld_tvn_window_01_b2; // 0xac8(0x08)
	struct UStaticMeshComponent* bld_tvn_window_01_b1; // 0xad0(0x08)
	struct UStaticMeshComponent* bld_tvn_window_01_b; // 0xad8(0x08)
	struct UStaticMeshComponent* bld_tvn_window_01_c; // 0xae0(0x08)
	struct UStaticMeshComponent* bld_tvn_window_01_a; // 0xae8(0x08)
	struct UStaticMeshComponent* bld_tvn_fireplace_rail_01_a; // 0xaf0(0x08)
	struct UStaticMeshComponent* bld_tvn_fireplace_plinth_01_a; // 0xaf8(0x08)
	struct UStaticMeshComponent* bld_tvn_fireplace_surround_01_a; // 0xb00(0x08)
	struct UStaticMeshComponent* bld_tavern_01_a; // 0xb08(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0xb10(0x08)

	void UserConstructionScript(); // Function BP_tavern_BSP_01_b.BP_tavern_BSP_01_b_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

