// BlueprintGeneratedClass BP_trn_shop_wld_01_a.BP_trn_shop_wld_01_a_C
// Size: 0x6a8 (Inherited: 0x3c8)
struct ABP_trn_shop_wld_01_a_C : AActor {
	struct UWorldLocationPopUpComponent* WorldLocationPopUp; // 0x3c8(0x08)
	struct UPetHangoutSpotComponent* PetHangoutSpot; // 0x3d0(0x08)
	struct UStaticMeshComponent* wld_trn_shop_dressing_01_b; // 0x3d8(0x08)
	struct UStaticMeshComponent* wld_trn_shop_dressing_01_a; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMesh29; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMesh24; // 0x3f0(0x08)
	struct UStaticMeshComponent* bld_trn_shop_hanging_sign_01_a; // 0x3f8(0x08)
	struct USpotLightComponent* SpotLight3; // 0x400(0x08)
	struct USpotLightComponent* SpotLight2; // 0x408(0x08)
	struct UChildActorComponent* BP_MusicBox; // 0x410(0x08)
	struct UChildActorComponent* BP_IslandEquipmentChest; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMesh28; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMesh27; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMesh26; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMesh25; // 0x438(0x08)
	struct UPointLightComponent* PointLight1; // 0x440(0x08)
	struct UChildActorComponent* ChildActor2; // 0x448(0x08)
	struct UChildActorComponent* ChildActor1; // 0x450(0x08)
	struct USpotLightComponent* SpotLight1; // 0x458(0x08)
	struct USpotLightComponent* SpotLight; // 0x460(0x08)
	struct UPointLightComponent* PointLight9; // 0x468(0x08)
	struct UPointLightComponent* PointLight8; // 0x470(0x08)
	struct UPointLightComponent* PointLight7; // 0x478(0x08)
	struct UPointLightComponent* PointLight6; // 0x480(0x08)
	struct UPointLightComponent* PointLight5; // 0x488(0x08)
	struct UPointLightComponent* PointLight4; // 0x490(0x08)
	struct UParticleSystemComponent* ParticleSystem20; // 0x498(0x08)
	struct UParticleSystemComponent* ParticleSystem19; // 0x4a0(0x08)
	struct UParticleSystemComponent* ParticleSystem18; // 0x4a8(0x08)
	struct UParticleSystemComponent* ParticleSystem17; // 0x4b0(0x08)
	struct UParticleSystemComponent* ParticleSystem16; // 0x4b8(0x08)
	struct UParticleSystemComponent* ParticleSystem15; // 0x4c0(0x08)
	struct UParticleSystemComponent* ParticleSystem14; // 0x4c8(0x08)
	struct UParticleSystemComponent* ParticleSystem13; // 0x4d0(0x08)
	struct UParticleSystemComponent* ParticleSystem12; // 0x4d8(0x08)
	struct UParticleSystemComponent* ParticleSystem11; // 0x4e0(0x08)
	struct UParticleSystemComponent* ParticleSystem10; // 0x4e8(0x08)
	struct UParticleSystemComponent* ParticleSystem9; // 0x4f0(0x08)
	struct UParticleSystemComponent* ParticleSystem8; // 0x4f8(0x08)
	struct UParticleSystemComponent* ParticleSystem7; // 0x500(0x08)
	struct UPointLightComponent* PointLight3; // 0x508(0x08)
	struct UParticleSystemComponent* ParticleSystem6; // 0x510(0x08)
	struct UParticleSystemComponent* ParticleSystem5; // 0x518(0x08)
	struct UParticleSystemComponent* ParticleSystem4; // 0x520(0x08)
	struct UParticleSystemComponent* ParticleSystem3; // 0x528(0x08)
	struct UParticleSystemComponent* ParticleSystem2; // 0x530(0x08)
	struct UPointLightComponent* PointLight2; // 0x538(0x08)
	struct UParticleSystemComponent* ParticleSystem1; // 0x540(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x548(0x08)
	struct UPointLightComponent* PointLight; // 0x550(0x08)
	struct UChildActorComponent* ChildActor; // 0x558(0x08)
	struct UStaticMeshComponent* StaticMesh23; // 0x560(0x08)
	struct UStaticMeshComponent* StaticMesh22; // 0x568(0x08)
	struct UStaticMeshComponent* StaticMesh31; // 0x570(0x08)
	struct UChildActorComponent* AudioSpace; // 0x578(0x08)
	struct UStaticMeshComponent* bld_shop_drapes_03_a; // 0x580(0x08)
	struct UStaticMeshComponent* cmn_oar_01_a; // 0x588(0x08)
	struct UStaticMeshComponent* StaticMesh19; // 0x590(0x08)
	struct UStaticMeshComponent* StaticMesh18; // 0x598(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x5a0(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x5a8(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x5b0(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x5b8(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x5c0(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x5c8(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x5d0(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x5d8(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x5e0(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x5e8(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x5f0(0x08)
	struct UStaticMeshComponent* cmn_candle_01_c; // 0x5f8(0x08)
	struct UStaticMeshComponent* cmn_candle_01_a; // 0x600(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x608(0x08)
	struct UStaticMeshComponent* cap_skull_candle_01_a; // 0x610(0x08)
	struct UStaticMeshComponent* cmn_candle_01_d; // 0x618(0x08)
	struct UStaticMeshComponent* cmn_candle_01_e; // 0x620(0x08)
	struct UStaticMeshComponent* shp_kra_skin_rug_01_a; // 0x628(0x08)
	struct UStaticMeshComponent* shp_kra_wheel_01_a; // 0x630(0x08)
	struct UStaticMeshComponent* shp_kitchen_shelf_02_a; // 0x638(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x640(0x08)
	struct UStaticMeshComponent* gmp_bar_hide_01_a1; // 0x648(0x08)
	struct UStaticMeshComponent* bld_shop_table_01_a; // 0x650(0x08)
	struct UStaticMeshComponent* bld_shop_drapes_01_a; // 0x658(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x660(0x08)
	struct UStaticMeshComponent* cmn_skeleton_head_boar_01_a; // 0x668(0x08)
	struct UStaticMeshComponent* bld_trn_shop_wilds_details_01_a; // 0x670(0x08)
	struct UStaticMeshComponent* bld_trn_roof_beam_01_a; // 0x678(0x08)
	struct UStaticMeshComponent* bld_trn_shop_window_01_b1; // 0x680(0x08)
	struct UStaticMeshComponent* bld_trn_shop_window_01_b; // 0x688(0x08)
	struct UStaticMeshComponent* bld_trn_shop_door_01_a; // 0x690(0x08)
	struct UStaticMeshComponent* bld_trn_shop_01_a; // 0x698(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x6a0(0x08)

	void UserConstructionScript(); // Function BP_trn_shop_wld_01_a.BP_trn_shop_wld_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

