// BlueprintGeneratedClass bsp_palm_cluster_02_a.bsp_palm_cluster_02_a_C
// Size: 0x450 (Inherited: 0x408)
struct Absp_palm_cluster_02_a_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* StaticMesh2; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_bush_06_b_1; // 0x410(0x08)
	struct UStaticMeshComponent* wsp_bush_06_b2_1; // 0x418(0x08)
	struct UStaticMeshComponent* wsp_bush_06_b3_1; // 0x420(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_01_a_1; // 0x428(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_01_b2_1; // 0x430(0x08)
	struct UNonVagueNonUniqueLandmarkComponent* NonVagueNonUniqueLandmark; // 0x438(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_02_b_1; // 0x440(0x08)
	struct USceneComponent* Scene; // 0x448(0x08)

	void UserConstructionScript(); // Function bsp_palm_cluster_02_a.bsp_palm_cluster_02_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

