// BlueprintGeneratedClass bsp_plm_cluster_03_c.bsp_plm_cluster_03_c_C
// Size: 0x480 (Inherited: 0x408)
struct Absp_plm_cluster_03_c_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wsp_tree_palm_02_a; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x420(0x08)
	struct UNonVagueNonUniqueLandmarkComponent* NonVagueNonUniqueLandmark; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x470(0x08)
	struct USceneComponent* SharedRoot; // 0x478(0x08)

	void UserConstructionScript(); // Function bsp_plm_cluster_03_c.bsp_plm_cluster_03_c_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

