// BlueprintGeneratedClass bsp_beach_rocks_03.bsp_beach_rocks_03_C
// Size: 0x4a8 (Inherited: 0x408)
struct Absp_beach_rocks_03_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* StaticMeshComponent019; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent018; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x4a0(0x08)

	void UserConstructionScript(); // Function bsp_beach_rocks_03.bsp_beach_rocks_03_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

