// BlueprintGeneratedClass bsp_bch_rocks_07.bsp_bch_rocks_07_C
// Size: 0x458 (Inherited: 0x408)
struct Absp_bch_rocks_07_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x450(0x08)

	void UserConstructionScript(); // Function bsp_bch_rocks_07.bsp_bch_rocks_07_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

