// BlueprintGeneratedClass bsp_bottle_light_stand_a.bsp_bottle_light_stand_a_C
// Size: 0x418 (Inherited: 0x3d8)
struct Absp_bottle_light_stand_a_C : AStaticMeshActor {
	struct UPointLightComponent* PointLight3; // 0x3d8(0x08)
	struct UPointLightComponent* PointLight2; // 0x3e0(0x08)
	struct UPointLightComponent* PointLight1; // 0x3e8(0x08)
	struct UPointLightComponent* PointLight; // 0x3f0(0x08)
	struct UStaticMeshComponent* ptn_cure_01_c; // 0x3f8(0x08)
	struct UStaticMeshComponent* ptn_pois_01_b; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x408(0x08)
	struct UStaticMeshComponent* cmn_bottle_01_a; // 0x410(0x08)

	void UserConstructionScript(); // Function bsp_bottle_light_stand_a.bsp_bottle_light_stand_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

