// BlueprintGeneratedClass bsp_flower_cluster_02_c.bsp_flower_cluster_02_c_C
// Size: 0x490 (Inherited: 0x408)
struct Absp_flower_cluster_02_c_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* StaticMesh9; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x440(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__a; // 0x448(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__h; // 0x450(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__g; // 0x458(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__b; // 0x460(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__c; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x480(0x08)
	struct USceneComponent* SharedRoot; // 0x488(0x08)

	void UserConstructionScript(); // Function bsp_flower_cluster_02_c.bsp_flower_cluster_02_c_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

