// BlueprintGeneratedClass bsp_beach_rocks_06_a.bsp_beach_rocks_06_a_C
// Size: 0x458 (Inherited: 0x408)
struct Absp_beach_rocks_06_a_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wsp_rock_pebbles_a_02; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_c_02; // 0x410(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small_e_01; // 0x418(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_f_02; // 0x420(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small_a_01; // 0x428(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_e_02; // 0x430(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_b_02; // 0x438(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_e_01; // 0x440(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small_d_01; // 0x448(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_d_02; // 0x450(0x08)

	void UserConstructionScript(); // Function bsp_beach_rocks_06_a.bsp_beach_rocks_06_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

