// BlueprintGeneratedClass bsp_sea_rock_cluster_g.bsp_sea_rock_cluster_g_C
// Size: 0x410 (Inherited: 0x3c8)
struct Absp_sea_rock_cluster_g_C : AActor {
	struct UStaticMeshComponent* StaticMesh; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x400(0x08)
	struct USceneComponent* SharedRoot; // 0x408(0x08)

	void UserConstructionScript(); // Function bsp_sea_rock_cluster_g.bsp_sea_rock_cluster_g_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

