// BlueprintGeneratedClass bsp_bch_rocks_02_b.bsp_bch_rocks_02_b_C
// Size: 0x460 (Inherited: 0x408)
struct Absp_bch_rocks_02_b_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* bsp_rock_cliff_01_j; // 0x408(0x08)
	struct UStaticMeshComponent* bsp_rock_medium_01_d; // 0x410(0x08)
	struct UStaticMeshComponent* bsp_rock_medium_01_b; // 0x418(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__c10_1; // 0x420(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__e4_1; // 0x428(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__e2_1; // 0x430(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__c6_1; // 0x438(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__c5_1; // 0x440(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__c9_1; // 0x448(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__c8_1; // 0x450(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__e3_1; // 0x458(0x08)

	void UserConstructionScript(); // Function bsp_bch_rocks_02_b.bsp_bch_rocks_02_b_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

