// BlueprintGeneratedClass bsp_plm_cluster_03_d.bsp_plm_cluster_03_d_C
// Size: 0x470 (Inherited: 0x408)
struct Absp_plm_cluster_03_d_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wsp_rock_pebbles__e; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__f; // 0x410(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__h; // 0x418(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__g; // 0x420(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__b; // 0x428(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__a; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x448(0x08)
	struct UNonVagueNonUniqueLandmarkComponent* NonVagueNonUniqueLandmark; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x460(0x08)
	struct USceneComponent* SharedRoot; // 0x468(0x08)

	void UserConstructionScript(); // Function bsp_plm_cluster_03_d.bsp_plm_cluster_03_d_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

