// BlueprintGeneratedClass bsp_tr_cluster_03_b.bsp_tr_cluster_03_b_C
// Size: 0x458 (Inherited: 0x408)
struct Absp_tr_cluster_03_b_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wsp_bush_01_a3_1; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_bush_01_a2_1; // 0x410(0x08)
	struct UStaticMeshComponent* wsp_bush_01_a9_1; // 0x418(0x08)
	struct UStaticMeshComponent* wsp_bush_01_a8_1; // 0x420(0x08)
	struct UStaticMeshComponent* wsp_bush_01_a7_1; // 0x428(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_01_a_1; // 0x430(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_01_b2_1; // 0x438(0x08)
	struct UNonVagueNonUniqueLandmarkComponent* NonVagueNonUniqueLandmark; // 0x440(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_02_b_1; // 0x448(0x08)
	struct UStaticMeshComponent* wsp_bush_01_a4_1; // 0x450(0x08)

	void UserConstructionScript(); // Function bsp_tr_cluster_03_b.bsp_tr_cluster_03_b_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

