// BlueprintGeneratedClass bsp_sea_rock_cluster_a.bsp_sea_rock_cluster_a_C
// Size: 0x408 (Inherited: 0x3c8)
struct Absp_sea_rock_cluster_a_C : AActor {
	struct UStaticMeshComponent* bsp_rock_cliff_01_g; // 0x3c8(0x08)
	struct UStaticMeshComponent* bsp_rock_cliff_01_e; // 0x3d0(0x08)
	struct UStaticMeshComponent* bsp_sea_rocks_e; // 0x3d8(0x08)
	struct UStaticMeshComponent* bsp_rock_cliff_01_i; // 0x3e0(0x08)
	struct UStaticMeshComponent* bsp_sea_rocks_a; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x3f8(0x08)
	struct USceneComponent* SharedRoot; // 0x400(0x08)

	void UserConstructionScript(); // Function bsp_sea_rock_cluster_a.bsp_sea_rock_cluster_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

