// BlueprintGeneratedClass bsp_palm_cluster_02_c.bsp_palm_cluster_02_c_C
// Size: 0x458 (Inherited: 0x408)
struct Absp_palm_cluster_02_c_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wsp_rock_xtra_small__b; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__e; // 0x410(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__d; // 0x418(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_01_b; // 0x420(0x08)
	struct UNonVagueNonUniqueLandmarkComponent* NonVagueNonUniqueLandmark; // 0x428(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_01_a; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x438(0x08)
	struct UStaticMeshComponent* wsp_bush_03_a; // 0x440(0x08)
	struct UStaticMeshComponent* wsp_bush_06_a_1; // 0x448(0x08)
	struct USceneComponent* Scene; // 0x450(0x08)

	void UserConstructionScript(); // Function bsp_palm_cluster_02_c.bsp_palm_cluster_02_c_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

