// BlueprintGeneratedClass bsp_bch_rocks_05_b.bsp_bch_rocks_05_b_C
// Size: 0x460 (Inherited: 0x408)
struct Absp_bch_rocks_05_b_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* bsp_rock_cliff_01_j; // 0x408(0x08)
	struct UStaticMeshComponent* bsp_rock_medium_01_d1; // 0x410(0x08)
	struct UStaticMeshComponent* bsp_rock_medium_01_d; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMesh16; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x458(0x08)

	void UserConstructionScript(); // Function bsp_bch_rocks_05_b.bsp_bch_rocks_05_b_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

