// BlueprintGeneratedClass bsp_Portal.bsp_Portal_C
// Size: 0x470 (Inherited: 0x3c8)
struct Absp_Portal_C : AActor {
	struct UChildActorComponent* SeaRockAudio; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x458(0x08)
	struct USceneComponent* Scene; // 0x460(0x08)
	struct USceneComponent* SharedRoot; // 0x468(0x08)

	void UserConstructionScript(); // Function bsp_Portal.bsp_Portal_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

