// BlueprintGeneratedClass cmn_looted__box_bottles_01.cmn_looted__box_bottles_01_C
// Size: 0x498 (Inherited: 0x408)
struct Acmn_looted__box_bottles_01_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* StaticMeshComponent019; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent017; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent016; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent014; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent013; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent012; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x488(0x08)
	struct USceneComponent* SharedRoot; // 0x490(0x08)

	void UserConstructionScript(); // Function cmn_looted__box_bottles_01.cmn_looted__box_bottles_01_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

