// BlueprintGeneratedClass dvr_sea_volcano_a.dvr_sea_volcano_a_C
// Size: 0x548 (Inherited: 0x3c8)
struct Advr_sea_volcano_a_C : AActor {
	struct UStaticMeshComponent* StaticMesh26; // 0x3c8(0x08)
	struct UStaticMeshComponent* StaticMesh25; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMesh24; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMesh23; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMesh22; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMesh21; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMesh20; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMesh19; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMesh18; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMesh17; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMesh16; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMesh15; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x470(0x08)
	struct UStaticMeshComponent* dvr_lv_crystal_large_01_b; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x498(0x08)
	struct UStaticMeshComponent* dvr_rock_xlarge_02_a; // 0x4a0(0x08)
	struct UStaticMeshComponent* dvr_rock_xlarge_04_a; // 0x4a8(0x08)
	struct UStaticMeshComponent* dvr_lv_rock_xlarge_04_a1; // 0x4b0(0x08)
	struct UStaticMeshComponent* dvr_lv_rock_xlarge_04_a; // 0x4b8(0x08)
	struct UStaticMeshComponent* dvr_lv_sea_rocks_d; // 0x4c0(0x08)
	struct UStaticMeshComponent* dvr_lv_rock_xlarge_02_c; // 0x4c8(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x4d0(0x08)
	struct UStaticMeshComponent* dvr_lv_rock_xlarge_05_b; // 0x4d8(0x08)
	struct UStaticMeshComponent* wld_rock_xlarge_05_b; // 0x4e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x4e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x4f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x4f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x500(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x508(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x510(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x518(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x520(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x528(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x530(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x538(0x08)
	struct USceneComponent* SharedRoot; // 0x540(0x08)

	void UserConstructionScript(); // Function dvr_sea_volcano_a.dvr_sea_volcano_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

