// Class Engine.ActorComponent
// Size: 0xc8 (Inherited: 0x28)
struct UActorComponent : UObject {
	char UnknownData_28[0x8]; // 0x28(0x08)
	struct FActorComponentTickFunction PrimaryComponentTick; // 0x30(0x50)
	struct TArray<struct FName> ComponentTags; // 0x80(0x10)
	struct TArray<struct FSimpleMemberReference> UCSModifiedProperties; // 0x90(0x10)
	char UnknownData_A0[0x10]; // 0xa0(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0xb0(0x10)
	char UnknownData_C0_0 : 3; // 0xc0(0x01)
	char bReplicates : 1; // 0xc0(0x01)
	char bNetAddressable : 1; // 0xc0(0x01)
	char UnknownData_C0_5 : 3; // 0xc0(0x01)
	char UnknownData_C1_0 : 6; // 0xc1(0x01)
	char bCreatedByConstructionScript : 1; // 0xc1(0x01)
	char bInstanceComponent : 1; // 0xc1(0x01)
	char bAutoActivate : 1; // 0xc2(0x01)
	char bIsActive : 1; // 0xc2(0x01)
	char bEditableWhenInherited : 1; // 0xc2(0x01)
	char UnknownData_C2_3 : 5; // 0xc2(0x01)
	char UnknownData_C3_0 : 3; // 0xc3(0x01)
	char bNeedsLoadForClient : 1; // 0xc3(0x01)
	char bNeedsLoadForServer : 1; // 0xc3(0x01)
	char UnknownData_C3_5 : 3; // 0xc3(0x01)
	char TargetNetDormancy; // 0xc4(0x01)
	char CreationMethod; // 0xc5(0x01)
	char UnknownData_C6[0x2]; // 0xc6(0x02)

	void ToggleActive(); // Function Engine.ActorComponent.ToggleActive // Native|Public|BlueprintCallable // @ game+0x2ca0850
	void SetTickGroup(char NewTickGroup); // Function Engine.ActorComponent.SetTickGroup // Final|Native|Public|BlueprintCallable // @ game+0x2c9f8b0
	void SetTickableWhenPaused(bool bTickableWhenPaused); // Function Engine.ActorComponent.SetTickableWhenPaused // Final|Native|Public|BlueprintCallable // @ game+0x2c9f9c0
	void SetIsReplicated(bool ShouldReplicate); // Function Engine.ActorComponent.SetIsReplicated // Final|Native|Public|BlueprintCallable // @ game+0x2c9f120
	void SetComponentTickEnabled(bool bEnabled); // Function Engine.ActorComponent.SetComponentTickEnabled // Native|Public|BlueprintCallable // @ game+0x2c9e980
	void SetActive(bool bNewActive, bool bReset); // Function Engine.ActorComponent.SetActive // Native|Public|BlueprintCallable // @ game+0x2c9dfe0
	void RemoveTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.ActorComponent.RemoveTickPrerequisiteComponent // Native|Public|BlueprintCallable // @ game+0x2c9cf40
	void RemoveTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.ActorComponent.RemoveTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x2c9ce20
	void ReceiveTick(float DeltaSeconds); // Function Engine.ActorComponent.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveEndPlay(char EndPlayReason); // Function Engine.ActorComponent.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay // Event|Public|BlueprintEvent // @ game+0x1848130
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive // Native|Public // @ game+0x2c9bd30
	void K2_DestroyComponent(struct UObject* Object); // Function Engine.ActorComponent.K2_DestroyComponent // Final|Native|Public|BlueprintCallable // @ game+0x2c99ba0
	bool IsComponentTickEnabled(); // Function Engine.ActorComponent.IsComponentTickEnabled // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97960
	bool IsBeingDestroyed(); // Function Engine.ActorComponent.IsBeingDestroyed // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97900
	bool IsActive(); // Function Engine.ActorComponent.IsActive // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97840
	char GetTargetNetDormancy(); // Function Engine.ActorComponent.GetTargetNetDormancy // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97180
	struct AActor* GetOwner(); // Function Engine.ActorComponent.GetOwner // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96c30
	bool FlushNetDormancy(); // Function Engine.ActorComponent.FlushNetDormancy // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x2c93d60
	void Deactivate(); // Function Engine.ActorComponent.Deactivate // Native|Public|BlueprintCallable // @ game+0x2c93390
	bool ComponentHasTag(struct FName Tag); // Function Engine.ActorComponent.ComponentHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c93200
	void AddTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.ActorComponent.AddTickPrerequisiteComponent // Native|Public|BlueprintCallable // @ game+0x2c901e0
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.ActorComponent.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x2c900c0
	void Activate(bool bReset); // Function Engine.ActorComponent.Activate // Native|Public|BlueprintCallable // @ game+0x2c8f8f0
};

// Class Engine.DataAsset
// Size: 0x28 (Inherited: 0x28)
struct UDataAsset : UObject {
};

// Class Engine.Actor
// Size: 0x3c8 (Inherited: 0x28)
struct AActor : UObject {
	struct FActorTickFunction PrimaryActorTick; // 0x28(0x50)
	float CustomTimeDilation; // 0x78(0x04)
	char bAllowRemovalFromServerWhenCollisionMerged : 1; // 0x7c(0x01)
	char bAllowRemovalFromServerWhenAutomaticallyInstanced : 1; // 0x7c(0x01)
	char bHidden : 1; // 0x7c(0x01)
	char bNetTemporary : 1; // 0x7c(0x01)
	char bNetStartup : 1; // 0x7c(0x01)
	char bOnlyRelevantToOwner : 1; // 0x7c(0x01)
	char bAlwaysRelevant : 1; // 0x7c(0x01)
	char bReplicateMovement : 1; // 0x7c(0x01)
	char bTearOff : 1; // 0x7d(0x01)
	char bExchangedRoles : 1; // 0x7d(0x01)
	char bPendingNetUpdate : 1; // 0x7d(0x01)
	char bNetLoadOnClient : 1; // 0x7d(0x01)
	char bNetUseOwnerRelevancy : 1; // 0x7d(0x01)
	char bBlockInput : 1; // 0x7d(0x01)
	char UnknownData_7D_6 : 1; // 0x7d(0x01)
	char bCanBeInCluster : 1; // 0x7d(0x01)
	char UnknownData_7E_0 : 2; // 0x7e(0x01)
	char bActorEnableCollision : 1; // 0x7e(0x01)
	char UnknownData_7E_3 : 1; // 0x7e(0x01)
	char bReplicateAttachment : 1; // 0x7e(0x01)
	char UnknownData_7E_5 : 1; // 0x7e(0x01)
	char bReplicates : 1; // 0x7e(0x01)
	char UnknownData_7F[0x1]; // 0x7f(0x01)
	struct FMulticastDelegate OnPreNetOwnershipChange; // 0x80(0x01)
	char UnknownData_81[0x2]; // 0x81(0x02)
	char RemoteRole; // 0x83(0x01)
	char UnknownData_84[0x4]; // 0x84(0x04)
	struct AActor* Owner; // 0x88(0x08)
	struct FRepMovement ReplicatedMovement; // 0x90(0x38)
	struct FRepAttachment AttachmentReplication; // 0xc8(0x48)
	char Role; // 0x110(0x01)
	char UnknownData_111[0x1]; // 0x111(0x01)
	char SpawnRestrictions; // 0x112(0x01)
	char AutoReceiveInput; // 0x113(0x01)
	int32_t InputPriority; // 0x114(0x04)
	struct UInputComponent* InputComponent; // 0x118(0x08)
	float NetCullDistanceSquared; // 0x120(0x04)
	char UnknownData_124[0x4]; // 0x124(0x04)
	int32_t NetTag; // 0x128(0x04)
	float NetUpdateTime; // 0x12c(0x04)
	float NetUpdateFrequency; // 0x130(0x04)
	float NetPriority; // 0x134(0x04)
	float LastNetUpdateTime; // 0x138(0x04)
	struct FName NetDriverName; // 0x13c(0x08)
	char bAutoDestroyWhenFinished : 1; // 0x144(0x01)
	char bCanBeDamaged : 1; // 0x144(0x01)
	char bActorIsBeingDestroyed : 1; // 0x144(0x01)
	char bCollideWhenPlacing : 1; // 0x144(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x144(0x01)
	char bRelevantForNetworkReplays : 1; // 0x144(0x01)
	char UnknownData_144_6 : 2; // 0x144(0x01)
	char UnknownData_145[0x3]; // 0x145(0x03)
	char SpawnCollisionHandlingMethod; // 0x148(0x01)
	char UnknownData_149[0x7]; // 0x149(0x07)
	struct APawn* Instigator; // 0x150(0x08)
	struct TArray<struct AActor*> Children; // 0x158(0x10)
	struct USceneComponent* RootComponent; // 0x168(0x08)
	struct TArray<struct AMatineeActor*> ControllingMatineeActors; // 0x170(0x10)
	float InitialLifeSpan; // 0x180(0x04)
	char UnknownData_184[0x4]; // 0x184(0x04)
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x188(0x01)
	char UnknownData_188_1 : 7; // 0x188(0x01)
	char UnknownData_189[0x7]; // 0x189(0x07)
	struct TArray<struct FName> Layers; // 0x190(0x10)
	struct FActorPtr ParentComponentActor; // 0x1a0(0x08)
	struct TArray<struct AActor*> ChildComponentActors; // 0x1a8(0x10)
	char UnknownData_1B8[0x8]; // 0x1b8(0x08)
	char bActorSeamlessTraveled : 1; // 0x1c0(0x01)
	char bIgnoresOriginShifting : 1; // 0x1c0(0x01)
	char bEnableAutoLODGeneration : 1; // 0x1c0(0x01)
	char InvertFeatureCheck : 1; // 0x1c0(0x01)
	char UnknownData_1C0_4 : 4; // 0x1c0(0x01)
	char UnknownData_1C1[0x3]; // 0x1c1(0x03)
	struct FName Feature; // 0x1c4(0x08)
	char UnknownData_1CC[0x4]; // 0x1cc(0x04)
	struct TArray<struct FName> Tags; // 0x1d0(0x10)
	uint64_t HiddenEditorViews; // 0x1e0(0x08)
	struct FMulticastDelegate OnActorBeginOverlap; // 0x1e8(0x01)
	struct FMulticastDelegate OnActorEndOverlap; // 0x1e9(0x01)
	struct FMulticastDelegate OnActorHit; // 0x1ea(0x01)
	struct FMulticastDelegate OnDestroyed; // 0x1eb(0x01)
	char UnknownData_1EC[0x3c]; // 0x1ec(0x3c)
	struct FMulticastDelegate OnEndPlay; // 0x228(0x01)
	bool bDoOverlapNotifiesOnLoad; // 0x229(0x01)
	char UnknownData_22A[0xf6]; // 0x22a(0xf6)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x320(0x10)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x330(0x10)
	char UnknownData_340[0x8]; // 0x340(0x08)
	struct TArray<struct AActor*> ChildActorInterfaceProviders; // 0x348(0x10)
	char UnknownData_358[0x68]; // 0x358(0x68)
	double DormancyLingeringInSeconds; // 0x3c0(0x08)

	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // Event|Public|BlueprintEvent // @ game+0x1848130
	void TearOff(); // Function Engine.Actor.TearOff // Native|Public|BlueprintCallable // @ game+0x2ca0830
	void SnapRootComponentTo(struct AActor* InParentActor, struct FName InSocketName); // Function Engine.Actor.SnapRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x2c9ff60
	void SetTickGroup(char NewTickGroup); // Function Engine.Actor.SetTickGroup // Final|Native|Public|BlueprintCallable // @ game+0x2c9f830
	void SetTickableWhenPaused(bool bTickableWhenPaused); // Function Engine.Actor.SetTickableWhenPaused // Final|Native|Public|BlueprintCallable // @ game+0x2c9f930
	void SetReplicates(bool bInReplicates); // Function Engine.Actor.SetReplicates // Final|Native|Public|BlueprintCallable // @ game+0x2c9f6a0
	void SetReplicateMovement(bool bInReplicateMovement); // Function Engine.Actor.SetReplicateMovement // Native|Public|BlueprintCallable // @ game+0x2c9f610
	void SetOwner(struct AActor* NewOwner); // Function Engine.Actor.SetOwner // Final|Native|Public|BlueprintCallable // @ game+0x2c9f480
	void SetLifeSpan(float InLifespan); // Function Engine.Actor.SetLifeSpan // Native|Public|BlueprintCallable // @ game+0x2c9f1b0
	void SetIgnoreNetTransformUpdates(bool bInIgnoreNetTransformUpdates); // Function Engine.Actor.SetIgnoreNetTransformUpdates // Final|Native|Public|BlueprintCallable // @ game+0x2c9efa0
	void SetActorTickEnabled(bool bEnabled); // Function Engine.Actor.SetActorTickEnabled // Final|Native|Public|BlueprintCallable // @ game+0x2c9e390
	void SetActorScale3D(struct FVector NewScale3D); // Function Engine.Actor.SetActorScale3D // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9e300
	bool SetActorRotation(struct FRotator NewRotation); // Function Engine.Actor.SetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9e260
	void SetActorRelativeScale3D(struct FVector NewRelativeScale); // Function Engine.Actor.SetActorRelativeScale3D // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9e1d0
	void SetActorHiddenInGame(bool bNewHidden); // Function Engine.Actor.SetActorHiddenInGame // Native|Public|BlueprintCallable // @ game+0x2c9e140
	void SetActorEnableCollision(bool bNewActorEnableCollision); // Function Engine.Actor.SetActorEnableCollision // Final|Native|Public|BlueprintCallable // @ game+0x2c9e0b0
	void RemoveTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.RemoveTickPrerequisiteComponent // Native|Public|BlueprintCallable // @ game+0x2c9ceb0
	void RemoveTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.Actor.RemoveTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x2c9cd90
	void ReceiveTick(float DeltaSeconds); // Function Engine.Actor.ReceiveTick // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveRadialDamage(float DamageReceived, struct UDamageType* DamageType, struct FVector Origin, struct FHitResult HitInfo, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveRadialDamage // BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1848130
	void ReceivePointDamage(float Damage, struct UDamageType* DamageType, struct FVector HitLocation, struct FVector HitNormal, struct UPrimitiveComponent* HitComponent, struct FName BoneName, struct FVector ShotFromDirection, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceivePointDamage // BlueprintAuthorityOnly|Event|Public|HasDefaults|BlueprintEvent // @ game+0x1848130
	void ReceiveHit(struct UPrimitiveComponent* MyComp, struct AActor* Other, struct UPrimitiveComponent* OtherComp, bool bSelfMoved, struct FVector HitLocation, struct FVector HitNormal, struct FVector NormalImpulse, struct FHitResult Hit); // Function Engine.Actor.ReceiveHit // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x2c9c980
	void ReceiveEndPlay(char EndPlayReason); // Function Engine.Actor.ReceiveEndPlay // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveAnyDamage(float Damage, struct UDamageType* DamageType, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveAnyDamage // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveActorOnReleased(); // Function Engine.Actor.ReceiveActorOnReleased // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveActorOnInputTouchLeave(char FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveActorOnInputTouchEnter(char FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveActorOnInputTouchEnd(char FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveActorOnInputTouchBegin(char FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveActorOnClicked(); // Function Engine.Actor.ReceiveActorOnClicked // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveActorEndOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorEndOverlap // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveActorBeginOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorBeginOverlap // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // Event|Public|BlueprintEvent // @ game+0x1848130
	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // Native|Public // @ game+0x2c9bdd0
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // Native|Public // @ game+0x2c9bd90
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // Native|Public // @ game+0x2c9bdb0
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // Native|Public // @ game+0x2c9bd10
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // Native|Public // @ game+0x2c9bcf0
	void OnEndPlayDynamicMulticastEvent__DelegateSignature(struct AActor* EndPlayActor); // DelegateFunction Engine.Actor.OnEndPlayDynamicMulticastEvent__DelegateSignature // MulticastDelegate|Public|Delegate // @ game+0x1848130
	void OnDestroyedDynamicMulticastEvent__DelegateSignature(struct AActor* DeletedActor); // DelegateFunction Engine.Actor.OnDestroyedDynamicMulticastEvent__DelegateSignature // MulticastDelegate|Public|Delegate // @ game+0x1848130
	void MakeNoise(float Loudness, struct APawn* NoiseInstigator, struct FVector NoiseLocation, float MaxRange, struct FName Tag); // Function Engine.Actor.MakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9bb60
	struct UMaterialInstanceDynamic* MakeMIDForMaterial(struct UMaterialInterface* Parent); // Function Engine.Actor.MakeMIDForMaterial // Final|Native|Public|BlueprintCallable // @ game+0x2c9bad0
	bool K2_TeleportTo(struct FVector DestLocation, struct FRotator DestRotation); // Function Engine.Actor.K2_TeleportTo // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9b730
	bool K2_SetActorTransform(struct FTransform NewTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c9a700
	void K2_SetActorRelativeTransform(struct FTransform NewRelativeTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c9a510
	void K2_SetActorRelativeRotation(struct FRotator NewRelativeRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c9a360
	void K2_SetActorRelativeLocation(struct FVector NewRelativeLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c9a1b0
	bool K2_SetActorLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c99fd0
	bool K2_SetActorLocation(struct FVector NewLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c99e20
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // Event|Public|BlueprintEvent // @ game+0x1848130
	void K2_OnEndViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnEndViewTarget // Event|Public|BlueprintEvent // @ game+0x1848130
	void K2_OnBecomeViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnBecomeViewTarget // Event|Public|BlueprintEvent // @ game+0x1848130
	struct USceneComponent* K2_GetRootComponent(); // Function Engine.Actor.K2_GetRootComponent // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c99df0
	struct FRotator K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c99c60
	struct FVector K2_GetActorLocation(); // Function Engine.Actor.K2_GetActorLocation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c99c20
	void K2_DestroyComponent(struct UActorComponent* Component); // Function Engine.Actor.K2_DestroyComponent // Final|Native|Public|BlueprintCallable // @ game+0x2c99b20
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // Native|Public|BlueprintCallable // @ game+0x2c99b00
	void K2_AttachRootComponentToActor(struct AActor* InParentActor, struct FName InSocketName, char AttachLocationType, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachRootComponentToActor // Final|Native|Public|BlueprintCallable // @ game+0x2c99860
	void K2_AttachRootComponentTo(struct USceneComponent* InParent, struct FName InSocketName, char AttachLocationType, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachRootComponentTo // Final|Native|Public|BlueprintCallable // @ game+0x2c99710
	void K2_AddActorWorldTransform(struct FTransform DeltaTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c98720
	void K2_AddActorWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c98570
	void K2_AddActorWorldOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c983c0
	void K2_AddActorLocalTransform(struct FTransform NewTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c981d0
	void K2_AddActorLocalRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c98020
	void K2_AddActorLocalOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c97e70
	bool IsOverlappingActor(struct AActor* Other); // Function Engine.Actor.IsOverlappingActor // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97c80
	bool IsChildActor(); // Function Engine.Actor.IsChildActor // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97930
	bool IsActorTickEnabled(); // Function Engine.Actor.IsActorTickEnabled // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c978a0
	bool IsActorBeingDestroyed(); // Function Engine.Actor.IsActorBeingDestroyed // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97870
	bool HasNetOwner(); // Function Engine.Actor.HasNetOwner // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97810
	bool HasAuthority(); // Function Engine.Actor.HasAuthority // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c977b0
	float GetVerticalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetVerticalDistanceTo // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97600
	struct FVector GetVelocity(); // Function Engine.Actor.GetVelocity // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c975c0
	struct FTransform GetTransform(); // Function Engine.Actor.GetTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97440
	bool GetTickableWhenPaused(); // Function Engine.Actor.GetTickableWhenPaused // Final|Native|Public|BlueprintCallable // @ game+0x2c971b0
	char GetPxActorCapacityForPhysXAggregate(); // Function Engine.Actor.GetPxActorCapacityForPhysXAggregate // Native|Event|Public|BlueprintEvent|Const // @ game+0x2c96d90
	struct AActor* GetParentActor(); // Function Engine.Actor.GetParentActor // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96c80
	struct AActor* GetOwner(); // Function Engine.Actor.GetOwner // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96c10
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*> OverlappingComponents); // Function Engine.Actor.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96b60
	void GetOverlappingActors(struct TArray<struct AActor*> OverlappingActors, struct UClass* ClassFilter); // Function Engine.Actor.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96a60
	float GetLifeSpan(); // Function Engine.Actor.GetLifeSpan // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96900
	struct UObject* GetInterfaceImplementer(struct UClass* InterfaceClass); // Function Engine.Actor.GetInterfaceImplementer // Final|Native|Public|BlueprintCallable // @ game+0x2c96870
	struct AController* GetInstigatorController(); // Function Engine.Actor.GetInstigatorController // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96840
	struct APawn* GetInstigator(); // Function Engine.Actor.GetInstigator // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96810
	struct FVector GetInputVectorAxisValue(struct FKey InputAxisKey); // Function Engine.Actor.GetInputVectorAxisValue // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c965d0
	float GetInputAxisValue(struct FName InputAxisName); // Function Engine.Actor.GetInputAxisValue // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96040
	float GetInputAxisKeyValue(struct FKey InputAxisKey); // Function Engine.Actor.GetInputAxisKeyValue // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c95f40
	float GetHorizontalDotProductTo(struct AActor* OtherActor); // Function Engine.Actor.GetHorizontalDotProductTo // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c95c80
	float GetHorizontalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetHorizontalDistanceTo // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c95be0
	float GetDotProductTo(struct AActor* OtherActor); // Function Engine.Actor.GetDotProductTo // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c95060
	float GetDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetDistanceTo // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94fc0
	struct TArray<struct UActorComponent*> GetComponentsByTag(struct UClass* ComponentClass, struct FName Tag); // Function Engine.Actor.GetComponentsByTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94900
	struct TArray<struct UActorComponent*> GetComponentsByClass(struct UClass* ComponentClass); // Function Engine.Actor.GetComponentsByClass // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94810
	void GetComponentInterfacesByClass(struct TArray<struct UActorComponent*> OutInterfaces, struct UClass* InterfaceClass); // Function Engine.Actor.GetComponentInterfacesByClass // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c946d0
	struct UActorComponent* GetComponentInterfaceByClass(struct UClass* InterfaceClass); // Function Engine.Actor.GetComponentInterfaceByClass // Final|Native|Public|BlueprintCallable // @ game+0x2c94640
	struct UActorComponent* GetComponentByClass(struct UClass* ComponentClass); // Function Engine.Actor.GetComponentByClass // Native|Public // @ game+0x2c945a0
	struct AActor* GetAttachParentActor(); // Function Engine.Actor.GetAttachParentActor // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94290
	struct FVector GetActorUpVector(); // Function Engine.Actor.GetActorUpVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94180
	float GetActorTimeDilation(); // Function Engine.Actor.GetActorTimeDilation // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94150
	struct FVector GetActorScale3D(); // Function Engine.Actor.GetActorScale3D // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94110
	struct FVector GetActorRightVector(); // Function Engine.Actor.GetActorRightVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c940d0
	struct FVector GetActorRelativeScale3D(); // Function Engine.Actor.GetActorRelativeScale3D // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94090
	struct FVector GetActorForwardVector(); // Function Engine.Actor.GetActorForwardVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94050
	void GetActorEyesViewPoint(struct FVector OutLocation, struct FRotator OutRotation); // Function Engine.Actor.GetActorEyesViewPoint // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c93f60
	bool GetActorEnableCollision(); // Function Engine.Actor.GetActorEnableCollision // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c93f30
	void GetActorBounds(bool bOnlyCollidingComponents, struct FVector Origin, struct FVector BoxExtent, bool bIncludeFromChildActors); // Function Engine.Actor.GetActorBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c93db0
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x2c93d90
	bool FlushNetDormancy(); // Function Engine.Actor.FlushNetDormancy // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x2c93d30
	void EnableInput(struct APlayerController* PlayerController); // Function Engine.Actor.EnableInput // Native|Public|BlueprintCallable // @ game+0x2c93a00
	void DisableInput(struct APlayerController* PlayerController); // Function Engine.Actor.DisableInput // Native|Public|BlueprintCallable // @ game+0x2c938b0
	void DetachRootComponentFromParent(bool bMaintainWorldPosition); // Function Engine.Actor.DetachRootComponentFromParent // Final|Native|Public|BlueprintCallable // @ game+0x2c93820
	void AttachRootComponentToNoReplication(struct USceneComponent* InParent, struct FName InSocketName, char AttachLocationType, bool bWeldSimulatedBodies); // Function Engine.Actor.AttachRootComponentToNoReplication // Final|Native|Public|BlueprintCallable // @ game+0x2c904c0
	void AttachActorToActorNoReplication(struct AActor* InParentActor, struct FName InSocketName, bool bWeldSimulatedBodies); // Function Engine.Actor.AttachActorToActorNoReplication // Final|Native|Public|BlueprintCallable // @ game+0x2c903b0
	void AddTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.AddTickPrerequisiteComponent // Native|Public|BlueprintCallable // @ game+0x2c90150
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.Actor.AddTickPrerequisiteActor // Native|Public|BlueprintCallable // @ game+0x2c90030
	struct UActorComponent* AddComponent(struct FName TemplateName, bool bManualAttachment, struct FTransform RelativeTransform, struct UObject* ComponentTemplateContext); // Function Engine.Actor.AddComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c8fb40
	bool ActorHasTag(struct FName Tag); // Function Engine.Actor.ActorHasTag // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c8fa10
};

// Class Engine.BlueprintFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBlueprintFunctionLibrary : UObject {
};

// Class Engine.DeveloperSettings
// Size: 0x38 (Inherited: 0x28)
struct UDeveloperSettings : UObject {
	char UnknownData_28[0x10]; // 0x28(0x10)
};

// Class Engine.SceneComponent
// Size: 0x2e0 (Inherited: 0xc8)
struct USceneComponent : UActorComponent {
	struct TArray<struct USceneComponent*> AttachChildren; // 0xc8(0x10)
	char bRequiresCustomLocation : 1; // 0xd8(0x01)
	char UnknownData_D8_1 : 7; // 0xd8(0x01)
	char UnknownData_D9[0x7]; // 0xd9(0x07)
	struct USceneComponent* AttachParent; // 0xe0(0x08)
	struct FName AttachSocketName; // 0xe8(0x08)
	char bAbsoluteLocation : 1; // 0xf0(0x01)
	char bAbsoluteRotation : 1; // 0xf0(0x01)
	char bAbsoluteScale : 1; // 0xf0(0x01)
	char bVisible : 1; // 0xf0(0x01)
	char bAbsoluteTranslation : 1; // 0xf0(0x01)
	char bHiddenInGame : 1; // 0xf0(0x01)
	char bShouldUpdatePhysicsVolume : 1; // 0xf0(0x01)
	char bBoundsChangeTriggersStreamingDataRebuild : 1; // 0xf0(0x01)
	char bUseAttachParentBound : 1; // 0xf1(0x01)
	char bComponentIsUnionOfChildren : 1; // 0xf1(0x01)
	char UnknownData_F1_2 : 1; // 0xf1(0x01)
	char bJitterReduction : 1; // 0xf1(0x01)
	char UnknownData_F1_4 : 1; // 0xf1(0x01)
	char CacheRootVelocity : 1; // 0xf1(0x01)
	char bWorldToComponentUpdated : 1; // 0xf1(0x01)
	char UnknownData_F2[0xe]; // 0xf2(0x0e)
	struct APhysicsVolume* PhysicsVolume; // 0x100(0x08)
	struct FVector RelativeLocation; // 0x108(0x0c)
	struct FRotator RelativeRotation; // 0x114(0x0c)
	struct FVector RelativeScale3D; // 0x120(0x0c)
	char UnknownData_12C[0x104]; // 0x12c(0x104)
	char Mobility; // 0x230(0x01)
	char DetailMode; // 0x231(0x01)
	char UnknownData_232[0xa]; // 0x232(0x0a)
	struct FVector ComponentVelocity; // 0x23c(0x0c)
	struct FMulticastDelegate PhysicsVolumeChangedDelegate; // 0x248(0x10)
	char UnknownData_258[0x10]; // 0x258(0x10)
	struct TArray<struct FName> SocketVelocitiesToCache; // 0x268(0x10)
	struct TArray<struct AActor*> MovedActors; // 0x278(0x10)
	char UnknownData_288[0x58]; // 0x288(0x58)

	void ToggleVisibility(bool bPropagateToChildren); // Function Engine.SceneComponent.ToggleVisibility // Final|Native|Public|BlueprintCallable // @ game+0x2ca0900
	void SnapTo(struct USceneComponent* InParent, struct FName InSocketName); // Function Engine.SceneComponent.SnapTo // Final|Native|Public|BlueprintCallable // @ game+0x2ca0020
	bool SharesBasis(struct USceneComponent* Other); // Function Engine.SceneComponent.SharesBasis // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c9fed0
	void SetWorldScale3D(struct FVector NewScale); // Function Engine.SceneComponent.SetWorldScale3D // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9fe40
	void SetVisibility(bool bNewVisibility, bool bPropagateToChildren); // Function Engine.SceneComponent.SetVisibility // Native|Public|BlueprintCallable // @ game+0x2c9fc60
	void SetRelativeScale3D(struct FVector NewScale3D); // Function Engine.SceneComponent.SetRelativeScale3D // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9f580
	void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren); // Function Engine.SceneComponent.SetHiddenInGame // Native|Public|BlueprintCallable // @ game+0x2c9edb0
	void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale); // Function Engine.SceneComponent.SetAbsolute // Final|Native|Public|BlueprintCallable // @ game+0x2c9dec0
	void ResetRelativeTransform(); // Function Engine.SceneComponent.ResetRelativeTransform // Final|Native|Public|BlueprintCallable // @ game+0x2c9d030
	void OnRep_Visibility(bool OldValue); // Function Engine.SceneComponent.OnRep_Visibility // Final|Native|Private // @ game+0x2c9be10
	void OnRep_Transform(); // Function Engine.SceneComponent.OnRep_Transform // Final|Native|Private // @ game+0x2c9bdf0
	bool K2_TryGetCachedSocketVelocity(struct FName SocketName, struct FVector OutVelocity); // Function Engine.SceneComponent.K2_TryGetCachedSocketVelocity // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c9b820
	void K2_SetWorldTransform(struct FTransform NewTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c9b540
	void K2_SetWorldRotation(struct FRotator NewRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c9b390
	void K2_SetWorldLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c9b1c0
	void K2_SetWorldLocation(struct FVector NewLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c9b010
	void K2_SetRelativeTransform(struct FTransform NewTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c9ae20
	void K2_SetRelativeRotation(struct FRotator NewRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c9ac70
	void K2_SetRelativeLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeLocationAndRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c9aaa0
	void K2_SetRelativeLocation(struct FVector NewLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c9a8f0
	struct FTransform K2_GetComponentToWorld(); // Function Engine.SceneComponent.K2_GetComponentToWorld // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c99d60
	struct FVector K2_GetComponentScale(); // Function Engine.SceneComponent.K2_GetComponentScale // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c99d20
	struct FRotator K2_GetComponentRotation(); // Function Engine.SceneComponent.K2_GetComponentRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c99ce0
	struct FVector K2_GetComponentLocation(); // Function Engine.SceneComponent.K2_GetComponentLocation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c99ca0
	void K2_AttachTo(struct USceneComponent* InParent, struct FName InSocketName, char AttachType, bool bWeldSimulatedBodies); // Function Engine.SceneComponent.K2_AttachTo // Final|Native|Public|BlueprintCallable // @ game+0x2c999b0
	void K2_AddWorldTransform(struct FTransform DeltaTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c99520
	void K2_AddWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c99370
	void K2_AddWorldOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c991c0
	void K2_AddRelativeRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddRelativeRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c99010
	void K2_AddRelativeLocation(struct FVector DeltaLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddRelativeLocation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c98e60
	void K2_AddLocalTransform(struct FTransform DeltaTransform, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c98c70
	void K2_AddLocalRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalRotation // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c98ac0
	void K2_AddLocalOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalOffset // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c98910
	bool IsVisible(); // Function Engine.SceneComponent.IsVisible // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97e40
	bool IsSimulatingPhysics(struct FName BoneName); // Function Engine.SceneComponent.IsSimulatingPhysics // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97da0
	bool IsAnySimulatingPhysics(); // Function Engine.SceneComponent.IsAnySimulatingPhysics // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c978d0
	struct FVector GetUpVector(); // Function Engine.SceneComponent.GetUpVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c974a0
	struct FTransform GetSocketTransform(struct FName InSocketName, char TransformSpace); // Function Engine.SceneComponent.GetSocketTransform // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97060
	struct FRotator GetSocketRotation(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketRotation // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96fb0
	struct FQuat GetSocketQuaternion(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketQuaternion // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96f10
	struct FVector GetSocketLocation(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketLocation // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96e60
	struct FVector GetRightVector(); // Function Engine.SceneComponent.GetRightVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96e20
	struct FTransform GetRelativeTransform(); // Function Engine.SceneComponent.GetRelativeTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96dc0
	struct APhysicsVolume* GetPhysicsVolume(); // Function Engine.SceneComponent.GetPhysicsVolume // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96d60
	void GetParentComponents(struct TArray<struct USceneComponent*> Parents); // Function Engine.SceneComponent.GetParentComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96cb0
	int32_t GetNumChildrenComponents(); // Function Engine.SceneComponent.GetNumChildrenComponents // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96a30
	struct FVector GetForwardVector(); // Function Engine.SceneComponent.GetForwardVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c95210
	struct FVector GetComponentVelocity(); // Function Engine.SceneComponent.GetComponentVelocity // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c947d0
	void GetChildrenComponents(bool bIncludeAllDescendants, struct TArray<struct USceneComponent*> Children); // Function Engine.SceneComponent.GetChildrenComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94480
	struct USceneComponent* GetChildComponent(int32_t ChildIndex); // Function Engine.SceneComponent.GetChildComponent // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c943f0
	struct FName GetAttachSocketName(); // Function Engine.SceneComponent.GetAttachSocketName // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c942c0
	struct USceneComponent* GetAttachParent(); // Function Engine.SceneComponent.GetAttachParent // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94260
	struct FTransform GetAttachedBasisTransform(); // Function Engine.SceneComponent.GetAttachedBasisTransform // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c942e0
	struct TArray<struct FName> GetAllSocketNames(); // Function Engine.SceneComponent.GetAllSocketNames // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c941c0
	bool DoesSocketExist(struct FName InSocketName); // Function Engine.SceneComponent.DoesSocketExist // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c93940
	void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify); // Function Engine.SceneComponent.DetachFromParent // Native|Public|BlueprintCallable // @ game+0x2c93750
};

// Class Engine.Pawn
// Size: 0x440 (Inherited: 0x3c8)
struct APawn : AActor {
	char UnknownData_3C8[0x8]; // 0x3c8(0x08)
	char bUseControllerRotationPitch : 1; // 0x3d0(0x01)
	char bUseControllerRotationYaw : 1; // 0x3d0(0x01)
	char bUseControllerRotationRoll : 1; // 0x3d0(0x01)
	char bCanAffectNavigationGeneration : 1; // 0x3d0(0x01)
	char UnknownData_3D0_4 : 4; // 0x3d0(0x01)
	char UnknownData_3D1[0x3]; // 0x3d1(0x03)
	float BaseEyeHeight; // 0x3d4(0x04)
	char AutoPossessPlayer; // 0x3d8(0x01)
	char AutoPossessAI; // 0x3d9(0x01)
	char UnknownData_3DA[0x6]; // 0x3da(0x06)
	struct UClass* AIControllerClass; // 0x3e0(0x08)
	struct APlayerState* PlayerState; // 0x3e8(0x08)
	char RemoteViewPitch; // 0x3f0(0x01)
	char UnknownData_3F1[0x7]; // 0x3f1(0x07)
	struct AController* LastHitBy; // 0x3f8(0x08)
	struct AController* Controller; // 0x400(0x08)
	char UnknownData_408[0x18]; // 0x408(0x18)
	struct FVector ControlInputVector; // 0x420(0x0c)
	struct FVector LastControlInputVector; // 0x42c(0x0c)
	char UnknownData_438[0x8]; // 0x438(0x08)

	void SpawnDefaultController(); // Function Engine.Pawn.SpawnDefaultController // Native|Public|BlueprintCallable // @ game+0x2da5e10
	void SetCanAffectNavigationGeneration(bool bNewValue); // Function Engine.Pawn.SetCanAffectNavigationGeneration // Final|Native|Public|BlueprintCallable // @ game+0x2da0a70
	void ReceiveUnpossessed(struct AController* OldController); // Function Engine.Pawn.ReceiveUnpossessed // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceivePossessed(struct AController* NewController); // Function Engine.Pawn.ReceivePossessed // Event|Public|BlueprintEvent // @ game+0x1848130
	void PawnMakeNoise(float Loudness, struct FVector NoiseLocation, bool bUseNoiseMakerLocation, struct AActor* NoiseMaker); // Function Engine.Pawn.PawnMakeNoise // Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d9dd90
	void OnRep_PlayerState(); // Function Engine.Pawn.OnRep_PlayerState // Native|Public // @ game+0x2d9d9d0
	void OnRep_Controller(); // Function Engine.Pawn.OnRep_Controller // Native|Public // @ game+0x2d9d930
	void LaunchPawn(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Function Engine.Pawn.LaunchPawn // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d9d090
	struct FVector K2_GetMovementInputVector(); // Function Engine.Pawn.K2_GetMovementInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9cb00
	bool IsMoveInputIgnored(); // Function Engine.Pawn.IsMoveInputIgnored // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c5b0
	bool IsLocallyControlled(); // Function Engine.Pawn.IsLocallyControlled // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c550
	bool IsControlled(); // Function Engine.Pawn.IsControlled // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c3a0
	struct FVector GetPendingMovementInputVector(); // Function Engine.Pawn.GetPendingMovementInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d99440
	struct FVector GetNavAgentLocation(); // Function Engine.Pawn.GetNavAgentLocation // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d988b0
	struct UPawnMovementComponent* GetMovementComponent(); // Function Engine.Pawn.GetMovementComponent // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d987e0
	struct AActor* GetMovementBaseActor(struct APawn* Pawn); // Function Engine.Pawn.GetMovementBaseActor // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x2d98760
	struct FVector GetLastMovementInputVector(); // Function Engine.Pawn.GetLastMovementInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97db0
	struct FRotator GetControlRotation(); // Function Engine.Pawn.GetControlRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97580
	struct AController* GetController(); // Function Engine.Pawn.GetController // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d975c0
	struct FRotator GetBaseAimRotation(); // Function Engine.Pawn.GetBaseAimRotation // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d96fa0
	void DetachFromControllerPendingDestroy(); // Function Engine.Pawn.DetachFromControllerPendingDestroy // Native|Public|BlueprintCallable // @ game+0x2d95020
	struct FVector ConsumeMovementInputVector(); // Function Engine.Pawn.ConsumeMovementInputVector // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d94910
	void AddMovementInput(struct FVector WorldDirection, float ScaleValue, bool bForce); // Function Engine.Pawn.AddMovementInput // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d937d0
	void AddControllerYawInput(float Val); // Function Engine.Pawn.AddControllerYawInput // Native|Public|BlueprintCallable // @ game+0x2d92a40
	void AddControllerRollInput(float Val); // Function Engine.Pawn.AddControllerRollInput // Native|Public|BlueprintCallable // @ game+0x2d929c0
	void AddControllerPitchInput(float Val); // Function Engine.Pawn.AddControllerPitchInput // Native|Public|BlueprintCallable // @ game+0x2d92940
};

// Class Engine.Character
// Size: 0x5e0 (Inherited: 0x440)
struct ACharacter : APawn {
	struct USkeletalMeshComponent* Mesh; // 0x440(0x08)
	struct UCharacterMovementComponent* CharacterMovement; // 0x448(0x08)
	struct UCapsuleComponent* CapsuleComponent; // 0x450(0x08)
	struct FBasedMovementInfo BasedMovement; // 0x458(0x38)
	struct FBasedMovementInfo ReplicatedBasedMovement; // 0x490(0x38)
	struct FVector BaseTranslationOffset; // 0x4c8(0x0c)
	char UnknownData_4D4[0xc]; // 0x4d4(0x0c)
	struct FQuat BaseRotationOffset; // 0x4e0(0x10)
	char ReplicatedMovementMode; // 0x4f0(0x01)
	bool bInBaseReplication; // 0x4f1(0x01)
	char UnknownData_4F2[0x2]; // 0x4f2(0x02)
	float CrouchedEyeHeight; // 0x4f4(0x04)
	char bIsCrouched : 1; // 0x4f8(0x01)
	char bPressedJump : 1; // 0x4f8(0x01)
	char bClientUpdating : 1; // 0x4f8(0x01)
	char bClientWasFalling : 1; // 0x4f8(0x01)
	char bClientResimulateRootMotion : 1; // 0x4f8(0x01)
	char bSimGravityDisabled : 1; // 0x4f8(0x01)
	char bServerMoveIgnoreRootMotion : 1; // 0x4f8(0x01)
	char UnknownData_4F9[0x3]; // 0x4f9(0x03)
	float JumpKeyHoldTime; // 0x4fc(0x04)
	float JumpMaxHoldTime; // 0x500(0x04)
	char UnknownData_504[0x4]; // 0x504(0x04)
	struct FMulticastDelegate OnReachedJumpApex; // 0x508(0x10)
	char UnknownData_518[0x10]; // 0x518(0x10)
	struct FMulticastDelegate OnCharacterMovementUpdated; // 0x528(0x10)
	char UnknownData_538[0x8]; // 0x538(0x08)
	struct FRootMotionMovementParams ClientRootMotionParams; // 0x540(0x40)
	struct TArray<struct FSimulatedRootMotionReplicatedMove> RootMotionRepMoves; // 0x580(0x10)
	struct FRepRootMotionMontage RepRootMotion; // 0x590(0x40)
	char UnknownData_5D0[0x10]; // 0x5d0(0x10)

	void UnCrouch(bool bClientSimulation); // Function Engine.Character.UnCrouch // Native|Public|BlueprintCallable // @ game+0x2da6650
	void StopJumping(); // Function Engine.Character.StopJumping // Native|Public|BlueprintCallable // @ game+0x2da6030
	void StopAnimMontage(struct UAnimMontage* AnimMontage); // Function Engine.Character.StopAnimMontage // Native|Public|BlueprintCallable // @ game+0x2da5fa0
	void SetReplicateMovement(bool bInReplicateMovement); // Function Engine.Character.SetReplicateMovement // Native|Public|BlueprintCallable // @ game+0x2da4ad0
	float PlayAnimMontage(struct UAnimMontage* AnimMontage, float InPlayRate, struct FName StartSectionName); // Function Engine.Character.PlayAnimMontage // Native|Public|BlueprintCallable // @ game+0x2d9e110
	void OnWalkingOffLedge(struct FVector PreviousFloorImpactNormal, struct FVector PreviousFloorContactNormal, struct FVector PreviousLocation, float TimeDelta); // Function Engine.Character.OnWalkingOffLedge // Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x2d9dbd0
	void OnRep_RootMotion(); // Function Engine.Character.OnRep_RootMotion // Final|Native|Public // @ game+0x2d9da70
	void OnRep_ReplicatedBasedMovement(); // Function Engine.Character.OnRep_ReplicatedBasedMovement // Native|Public // @ game+0x2d9d9f0
	void OnRep_IsCrouched(); // Function Engine.Character.OnRep_IsCrouched // Native|Public // @ game+0x2d9d990
	void OnLaunched(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Function Engine.Character.OnLaunched // Event|Public|HasDefaults|BlueprintEvent // @ game+0x1848130
	void OnLanded(struct FHitResult Hit); // Function Engine.Character.OnLanded // Event|Public|HasOutParms|BlueprintEvent // @ game+0x1848130
	void OnJumped(); // Function Engine.Character.OnJumped // Native|Event|Public|BlueprintEvent // @ game+0x2d9d800
	void LaunchCharacter(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Function Engine.Character.LaunchCharacter // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d9cf70
	void K2_UpdateCustomMovement(float DeltaTime); // Function Engine.Character.K2_UpdateCustomMovement // Event|Public|BlueprintEvent // @ game+0x1848130
	void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Engine.Character.K2_OnStartCrouch // Event|Public|BlueprintEvent // @ game+0x1848130
	void K2_OnMovementModeChanged(char PrevMovementMode, char NewMovementMode, char PrevCustomMode, char NewCustomMode); // Function Engine.Character.K2_OnMovementModeChanged // Event|Public|BlueprintEvent // @ game+0x1848130
	void K2_OnEndCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Engine.Character.K2_OnEndCrouch // Event|Public|BlueprintEvent // @ game+0x1848130
	void Jump(); // Function Engine.Character.Jump // Native|Public|BlueprintCallable // @ game+0x2d9c990
	bool IsPlayingRootMotion(); // Function Engine.Character.IsPlayingRootMotion // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c840
	bool IsPlayingNetworkedRootMotionMontage(); // Function Engine.Character.IsPlayingNetworkedRootMotionMontage // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c810
	bool IsJumpProvidingForce(); // Function Engine.Character.IsJumpProvidingForce // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c520
	struct UAnimMontage* GetCurrentMontage(); // Function Engine.Character.GetCurrentMontage // Final|Native|Public|BlueprintCallable // @ game+0x2d975f0
	void Crouch(bool bClientSimulation); // Function Engine.Character.Crouch // Native|Public|BlueprintCallable // @ game+0x2d94dc0
	void ClientCheatWalk(); // Function Engine.Character.ClientCheatWalk // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2d946a0
	void ClientCheatGhost(); // Function Engine.Character.ClientCheatGhost // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2d94680
	void ClientCheatFly(); // Function Engine.Character.ClientCheatFly // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2d94660
	bool CanJumpInternal(); // Function Engine.Character.CanJumpInternal // Native|Event|Protected|BlueprintEvent|Const // @ game+0x2d942b0
	bool CanJump(); // Function Engine.Character.CanJump // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d94280
};

// Class Engine.InputComponent
// Size: 0x150 (Inherited: 0xc8)
struct UInputComponent : UActorComponent {
	char UnknownData_C8[0x88]; // 0xc8(0x88)

	bool WasControllerKeyJustReleased(struct FKey Key); // Function Engine.InputComponent.WasControllerKeyJustReleased // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x2ca0b40
	bool WasControllerKeyJustPressed(struct FKey Key); // Function Engine.InputComponent.WasControllerKeyJustPressed // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x2ca0a40
	bool IsControllerKeyDown(struct FKey Key); // Function Engine.InputComponent.IsControllerKeyDown // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97990
	void GetTouchState(int32_t FingerIndex, float LocationX, float LocationY, bool bIsCurrentlyPressed); // Function Engine.InputComponent.GetTouchState // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c972c0
	struct FVector GetControllerVectorKeyState(struct FKey Key); // Function Engine.InputComponent.GetControllerVectorKeyState // Final|Native|Private|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94e60
	void GetControllerMouseDelta(float DeltaX, float DeltaY); // Function Engine.InputComponent.GetControllerMouseDelta // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94d80
	float GetControllerKeyTimeDown(struct FKey Key); // Function Engine.InputComponent.GetControllerKeyTimeDown // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94c80
	void GetControllerAnalogStickState(char WhichStick, float StickX, float StickY); // Function Engine.InputComponent.GetControllerAnalogStickState // Final|Native|Private|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94b60
	float GetControllerAnalogKeyState(struct FKey Key); // Function Engine.InputComponent.GetControllerAnalogKeyState // Final|Native|Private|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94a60
};

// Class Engine.AnimInstance
// Size: 0x440 (Inherited: 0x28)
struct UAnimInstance : UObject {
	struct USkeleton* CurrentSkeleton; // 0x28(0x08)
	struct TArray<struct FAnimTickRecord> UngroupedActivePlayers; // 0x30(0x10)
	struct TArray<struct FAnimGroupInstance> SyncGroups; // 0x40(0x10)
	struct TArray<struct FActiveVertexAnim> VertexAnims; // 0x50(0x10)
	char RootMotionMode; // 0x60(0x01)
	bool bWarnAboutBlueprintUsage; // 0x61(0x01)
	char UnknownData_62[0x6]; // 0x62(0x06)
	struct FMulticastDelegate OnMontageBlendingOut; // 0x68(0x10)
	struct FMulticastDelegate OnMontageStarted; // 0x78(0x10)
	struct FMulticastDelegate OnMontageEnded; // 0x88(0x10)
	struct FMulticastDelegate OnStateEntered; // 0x98(0x10)
	struct FMulticastDelegate OnStateExited; // 0xa8(0x10)
	struct FMulticastDelegate OnStateInitialised; // 0xb8(0x10)
	struct FMulticastDelegate OnAnimUpdated; // 0xc8(0x10)
	char UnknownData_D8[0x70]; // 0xd8(0x70)
	bool bQueueMontageEvents; // 0x148(0x01)
	char UnknownData_149[0xf7]; // 0x149(0xf7)
	struct TArray<struct FAnimNotifyEvent> ActiveAnimNotifyState; // 0x240(0x10)
	char UnknownData_250[0x100]; // 0x250(0x100)
	int16_t SlotNodeInitializationCounter; // 0x350(0x02)
	int16_t GraphTraversalCounter; // 0x352(0x02)
	char UnknownData_354[0x54]; // 0x354(0x54)
	bool bBoneCachesInvalidated; // 0x3a8(0x01)
	char UnknownData_3A9[0x8f]; // 0x3a9(0x8f)
	char UnknownData_438_0 : 1; // 0x438(0x01)
	char bBlueprintAnimUpdateEnabled : 1; // 0x438(0x01)
	char UnknownData_438_2 : 6; // 0x438(0x01)
	char UnknownData_439[0x7]; // 0x439(0x07)

	void UnlockAIResources(bool bUnlockMovement, bool UnlockAILogic); // Function Engine.AnimInstance.UnlockAIResources // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x2eb4000
	struct APawn* TryGetPawnOwner(); // Function Engine.AnimInstance.TryGetPawnOwner // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2eb3eb0
	void StopSlotAnimation(float InBlendOutTime, struct FName SlotNodeName); // Function Engine.AnimInstance.StopSlotAnimation // Final|Native|Public|BlueprintCallable // @ game+0x2eb3d30
	void SetMorphTarget(struct FName MorphTargetName, float Value); // Function Engine.AnimInstance.SetMorphTarget // Final|Native|Public|BlueprintCallable // @ game+0x2eaf5f0
	struct UAnimMontage* PlaySlotAnimationAsDynamicMontage(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float StartingPosition); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage // Final|Native|Public|BlueprintCallable // @ game+0x2ea96f0
	float PlaySlotAnimation(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount); // Function Engine.AnimInstance.PlaySlotAnimation // Final|Native|Public|BlueprintCallable // @ game+0x2ea9530
	void Montage_Stop(float InBlendOutTime, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Stop // Final|Native|Public|BlueprintCallable // @ game+0x2ea8970
	void Montage_SetPlayRate(struct UAnimMontage* Montage, float NewPlayRate); // Function Engine.AnimInstance.Montage_SetPlayRate // Final|Native|Public|BlueprintCallable // @ game+0x2ea88a0
	void Montage_SetNextSection(struct FName SectionNameToChange, struct FName NextSection, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_SetNextSection // Final|Native|Public|BlueprintCallable // @ game+0x2ea87a0
	void Montage_Resume(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Resume // Final|Native|Public|BlueprintCallable // @ game+0x2ea8720
	float Montage_Play(struct UAnimMontage* MontageToPlay, float InPlayRate, float Position); // Function Engine.AnimInstance.Montage_Play // Final|Native|Public|BlueprintCallable // @ game+0x2ea8620
	void Montage_Pause(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Pause // Final|Native|Public|BlueprintCallable // @ game+0x2ea85a0
	void Montage_JumpToSectionsEnd(struct FName SectionName, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_JumpToSectionsEnd // Final|Native|Public|BlueprintCallable // @ game+0x2ea84e0
	void Montage_JumpToSection(struct FName SectionName, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_JumpToSection // Final|Native|Public|BlueprintCallable // @ game+0x2ea8420
	bool Montage_IsPlaying(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_IsPlaying // Final|Native|Public|BlueprintCallable // @ game+0x2ea8390
	bool Montage_IsActive(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_IsActive // Final|Native|Public|BlueprintCallable // @ game+0x2ea8300
	struct FName Montage_GetCurrentSection(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetCurrentSection // Final|Native|Public|BlueprintCallable // @ game+0x2ea8270
	void LockAIResources(bool bLockMovement, bool LockAILogic); // Function Engine.AnimInstance.LockAIResources // Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x2ea7ff0
	bool IsPlayingSlotAnimation(struct UAnimSequenceBase* Asset, struct FName SlotNodeName); // Function Engine.AnimInstance.IsPlayingSlotAnimation // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea7970
	float GetSyncGroupPosition(struct FName Name); // Function Engine.AnimInstance.GetSyncGroupPosition // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea6cf0
	float GetStateWeight(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetStateWeight // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea6a20
	float GetRelevantAnimTimeRemainingFraction(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeRemainingFraction // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea6440
	float GetRelevantAnimTimeRemaining(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeRemaining // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea6380
	float GetRelevantAnimTimeFraction(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeFraction // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea62c0
	float GetRelevantAnimTime(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTime // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea6200
	float GetRelevantAnimLength(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimLength // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea6140
	struct USkeletalMeshComponent* GetOwningComponent(); // Function Engine.AnimInstance.GetOwningComponent // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea5c10
	struct AActor* GetOwningActor(); // Function Engine.AnimInstance.GetOwningActor // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea5b50
	float GetMaxPlayingAnimTimeRemaining(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetMaxPlayingAnimTimeRemaining // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea5720
	float GetMaxAnimTimeRemaining(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetMaxAnimTimeRemaining // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea5620
	float GetInstanceTransitionTimeElapsedFraction(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionTimeElapsedFraction // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea4fc0
	float GetInstanceTransitionTimeElapsed(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionTimeElapsed // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea4f00
	float GetInstanceTransitionCrossfadeDuration(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionCrossfadeDuration // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea4e40
	float GetInstanceStateWeight(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetInstanceStateWeight // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea4c20
	float GetInstanceCurrentStateElapsedTime(int32_t MachineIndex); // Function Engine.AnimInstance.GetInstanceCurrentStateElapsedTime // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea4b90
	float GetInstanceAssetPlayerTimeFromEndFraction(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEndFraction // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea4ad0
	float GetInstanceAssetPlayerTimeFromEnd(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEnd // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea4a40
	float GetInstanceAssetPlayerTimeFraction(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFraction // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea49b0
	float GetInstanceAssetPlayerTime(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTime // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea4920
	float GetInstanceAssetPlayerLength(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerLength // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea4890
	float GetCurveValue(struct FName CurveName); // Function Engine.AnimInstance.GetCurveValue // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea41a0
	struct FName GetCurrentStateName(int32_t MachineIndex); // Function Engine.AnimInstance.GetCurrentStateName // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea4110
	float GetCurrentStateElapsedTime(int32_t MachineIndex); // Function Engine.AnimInstance.GetCurrentStateElapsedTime // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea4080
	float GetAnimAssetPlayerTimeFromEndFraction(struct UAnimationAsset* AnimAsset, float CurrentTime); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEndFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea33b0
	float GetAnimAssetPlayerTimeFromEnd(struct UAnimationAsset* AnimAsset, float CurrentTime); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFromEnd // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea32e0
	float GetAnimAssetPlayerTimeFraction(struct UAnimationAsset* AnimAsset, float CurrentTime); // Function Engine.AnimInstance.GetAnimAssetPlayerTimeFraction // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea3210
	float GetAnimAssetPlayerLength(struct UAnimationAsset* AnimAsset); // Function Engine.AnimInstance.GetAnimAssetPlayerLength // Final|Native|Static|Public|BlueprintCallable|BlueprintPure // @ game+0x2ea3180
	void ClearMorphTargets(); // Function Engine.AnimInstance.ClearMorphTargets // Final|Native|Public|BlueprintCallable // @ game+0x2ea1460
	float CalculateDirection(struct FVector Velocity, struct FRotator BaseRotation); // Function Engine.AnimInstance.CalculateDirection // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2ea1160
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Engine.AnimInstance.BlueprintUpdateAnimation // Event|Public|BlueprintEvent // @ game+0x1848130
	void BlueprintUninitializeAnimation(); // Function Engine.AnimInstance.BlueprintUninitializeAnimation // Event|Public|BlueprintEvent // @ game+0x1848130
	void BlueprintPostEvaluateAnimation(); // Function Engine.AnimInstance.BlueprintPostEvaluateAnimation // Event|Public|BlueprintEvent // @ game+0x1848130
	void BlueprintInitializeAnimation(); // Function Engine.AnimInstance.BlueprintInitializeAnimation // Event|Public|BlueprintEvent // @ game+0x1848130
	void AnimNotify_Sound(struct UAnimNotify* Notify); // Function Engine.AnimInstance.AnimNotify_Sound // Final|Native|Public // @ game+0x2e9f040
};

// Class Engine.AnimNotify
// Size: 0x38 (Inherited: 0x28)
struct UAnimNotify : UObject {
	bool PlayedWithSequencer; // 0x28(0x01)
	char UnknownData_29[0xf]; // 0x29(0x0f)

	bool Received_Notify(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Engine.AnimNotify.Received_Notify // Event|Public|BlueprintEvent|Const // @ game+0x1848130
	struct FString GetNotifyName(); // Function Engine.AnimNotify.GetNotifyName // Native|Event|Public|BlueprintEvent|Const // @ game+0x2ea58a0
};

// Class Engine.AnimNotifyState
// Size: 0x30 (Inherited: 0x28)
struct UAnimNotifyState : UObject {
	bool PlayedWithSequencer; // 0x28(0x01)
	char UnknownData_29[0x7]; // 0x29(0x07)

	bool Received_NotifyTick(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, float FrameDeltaTime); // Function Engine.AnimNotifyState.Received_NotifyTick // Event|Public|BlueprintEvent|Const // @ game+0x1848130
	bool Received_NotifyEnd(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Engine.AnimNotifyState.Received_NotifyEnd // Event|Public|BlueprintEvent|Const // @ game+0x1848130
	bool Received_NotifyBegin(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, float TotalDuration); // Function Engine.AnimNotifyState.Received_NotifyBegin // Event|Public|BlueprintEvent|Const // @ game+0x1848130
	struct FString GetNotifyName(); // Function Engine.AnimNotifyState.GetNotifyName // Native|Event|Public|BlueprintEvent|Const // @ game+0x2ea5940
};

// Class Engine.AnimNotifyState_TimedParticleEffect
// Size: 0x60 (Inherited: 0x30)
struct UAnimNotifyState_TimedParticleEffect : UAnimNotifyState {
	struct UParticleSystem* PSTemplate; // 0x30(0x08)
	struct FName SocketName; // 0x38(0x08)
	struct FVector LocationOffset; // 0x40(0x0c)
	struct FRotator RotationOffset; // 0x4c(0x0c)
	bool bOwnerOnlySee; // 0x58(0x01)
	bool bOwnerNoSee; // 0x59(0x01)
	bool bDestroyAtEnd; // 0x5a(0x01)
	bool bWorldOwnedEffect; // 0x5b(0x01)
	char UnknownData_5C[0x4]; // 0x5c(0x04)
};

// Class Engine.CameraComponent
// Size: 0x850 (Inherited: 0x2e0)
struct UCameraComponent : USceneComponent {
	float FieldOfView; // 0x2e0(0x04)
	float OrthoWidth; // 0x2e4(0x04)
	float OrthoNearClipPlane; // 0x2e8(0x04)
	float OrthoFarClipPlane; // 0x2ec(0x04)
	float AspectRatio; // 0x2f0(0x04)
	char bConstrainAspectRatio : 1; // 0x2f4(0x01)
	char bUseFieldOfViewForLOD : 1; // 0x2f4(0x01)
	char bUsePawnControlRotation : 1; // 0x2f4(0x01)
	char UnknownData_2F4_3 : 5; // 0x2f4(0x01)
	char UnknownData_2F5[0x3]; // 0x2f5(0x03)
	char ProjectionMode; // 0x2f8(0x01)
	char UnknownData_2F9[0x3]; // 0x2f9(0x03)
	float PostProcessBlendWeight; // 0x2fc(0x04)
	struct FPostProcessSettings PostProcessSettings; // 0x300(0x540)
	char bUseControllerViewRotation : 1; // 0x840(0x01)
	char UnknownData_840_1 : 7; // 0x840(0x01)
	char UnknownData_841[0xf]; // 0x841(0x0f)

	struct FVector ProjectWorldLocation(struct FVector WorldLocation, struct FIntPoint ViewDimensions); // Function Engine.CameraComponent.ProjectWorldLocation // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2ea9fc0
	void GetCameraView(float DeltaTime, struct FMinimalViewInfo DesiredView); // Function Engine.CameraComponent.GetCameraView // Native|Public|HasOutParms|BlueprintCallable // @ game+0x2ea3d70
	void AddOrUpdateBlendable(TScriptInterface<struct UBlendableInterface> InBlendableObject, float InWeight); // Function Engine.CameraComponent.AddOrUpdateBlendable // Final|Native|Public|BlueprintCallable // @ game+0x2e9eb40
};

// Class Engine.MovementComponent
// Size: 0x110 (Inherited: 0xc8)
struct UMovementComponent : UActorComponent {
	struct USceneComponent* UpdatedComponent; // 0xc8(0x08)
	struct UPrimitiveComponent* UpdatedPrimitive; // 0xd0(0x08)
	char UnknownData_D8[0x4]; // 0xd8(0x04)
	struct FVector Velocity; // 0xdc(0x0c)
	char bConstrainToPlane : 1; // 0xe8(0x01)
	char bSnapToPlaneAtStart : 1; // 0xe8(0x01)
	char UnknownData_E8_2 : 6; // 0xe8(0x01)
	char UnknownData_E9[0x3]; // 0xe9(0x03)
	char PlaneConstraintAxisSetting; // 0xec(0x01)
	char UnknownData_ED[0x3]; // 0xed(0x03)
	struct FVector PlaneConstraintNormal; // 0xf0(0x0c)
	struct FVector PlaneConstraintOrigin; // 0xfc(0x0c)
	char bUpdateOnlyIfRendered : 1; // 0x108(0x01)
	char bAutoUpdateTickRegistration : 1; // 0x108(0x01)
	char bAutoRegisterUpdatedComponent : 1; // 0x108(0x01)
	char UnknownData_108_3 : 5; // 0x108(0x01)
	char UnknownData_109[0x7]; // 0x109(0x07)

	void StopMovementImmediately(); // Function Engine.MovementComponent.StopMovementImmediately // Native|Public|BlueprintCallable // @ game+0x2da6050
	void SnapUpdatedComponentToPlane(); // Function Engine.MovementComponent.SnapUpdatedComponentToPlane // Native|Public|BlueprintCallable // @ game+0x2da5df0
	void SetUpdatedComponent(struct USceneComponent* NewUpdatedComponent); // Function Engine.MovementComponent.SetUpdatedComponent // Native|Public|BlueprintCallable // @ game+0x2da5670
	void SetPlaneConstraintOrigin(struct FVector PlaneOrigin); // Function Engine.MovementComponent.SetPlaneConstraintOrigin // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da4680
	void SetPlaneConstraintNormal(struct FVector PlaneNormal); // Function Engine.MovementComponent.SetPlaneConstraintNormal // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da45f0
	void SetPlaneConstraintFromVectors(struct FVector Forward, struct FVector Up); // Function Engine.MovementComponent.SetPlaneConstraintFromVectors // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da4510
	void SetPlaneConstraintEnabled(bool bEnabled); // Function Engine.MovementComponent.SetPlaneConstraintEnabled // Native|Public|BlueprintCallable // @ game+0x2da4480
	void SetPlaneConstraintAxisSetting(char NewAxisSetting); // Function Engine.MovementComponent.SetPlaneConstraintAxisSetting // Native|Public|BlueprintCallable // @ game+0x2da4400
	void PhysicsVolumeChanged(struct APhysicsVolume* NewVolume); // Function Engine.MovementComponent.PhysicsVolumeChanged // Native|Public // @ game+0x2d9df00
	bool K2_MoveUpdatedComponent(struct FVector Delta, struct FRotator NewRotation, struct FHitResult OutHit, bool bSweep, bool bTeleport); // Function Engine.MovementComponent.K2_MoveUpdatedComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2d9cd90
	float K2_GetModifiedMaxSpeed(); // Function Engine.MovementComponent.K2_GetModifiedMaxSpeed // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9cac0
	float K2_GetMaxSpeedModifier(); // Function Engine.MovementComponent.K2_GetMaxSpeedModifier // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9ca80
	bool IsExceedingMaxSpeed(float MaxSpeed); // Function Engine.MovementComponent.IsExceedingMaxSpeed // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c400
	struct FVector GetPlaneConstraintOrigin(); // Function Engine.MovementComponent.GetPlaneConstraintOrigin // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d99770
	struct FVector GetPlaneConstraintNormal(); // Function Engine.MovementComponent.GetPlaneConstraintNormal // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d99730
	char GetPlaneConstraintAxisSetting(); // Function Engine.MovementComponent.GetPlaneConstraintAxisSetting // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d99710
	struct APhysicsVolume* GetPhysicsVolume(); // Function Engine.MovementComponent.GetPhysicsVolume // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d996e0
	float GetMaxSpeed(); // Function Engine.MovementComponent.GetMaxSpeed // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98680
	float GetGravityZ(); // Function Engine.MovementComponent.GetGravityZ // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97bf0
	struct FVector ConstrainNormalToPlane(struct FVector Normal); // Function Engine.MovementComponent.ConstrainNormalToPlane // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d94820
	struct FVector ConstrainLocationToPlane(struct FVector Location); // Function Engine.MovementComponent.ConstrainLocationToPlane // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d94770
	struct FVector ConstrainDirectionToPlane(struct FVector Direction); // Function Engine.MovementComponent.ConstrainDirectionToPlane // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d946c0
};

// Class Engine.NavMovementComponent
// Size: 0x158 (Inherited: 0x110)
struct UNavMovementComponent : UMovementComponent {
	struct FNavAgentProperties NavAgentProps; // 0x110(0x30)
	char bUpdateNavAgentWithOwnersCollision : 1; // 0x140(0x01)
	char UnknownData_140_1 : 7; // 0x140(0x01)
	char UnknownData_141[0x3]; // 0x141(0x03)
	struct FMovementProperties MovementState; // 0x144(0x04)
	char UnknownData_148[0x8]; // 0x148(0x08)
	bool UseDefaultNavWalkingSearchRadiusScale; // 0x150(0x01)
	bool UseDefaultNavWalkingSearchHeightScale; // 0x151(0x01)
	char UnknownData_152[0x6]; // 0x152(0x06)

	void StopMovementKeepPathing(); // Function Engine.NavMovementComponent.StopMovementKeepPathing // Final|Native|Public|BlueprintCallable // @ game+0x2da6070
	void StopActiveMovement(); // Function Engine.NavMovementComponent.StopActiveMovement // Native|Public|BlueprintCallable // @ game+0x2da5f80
	bool IsSwimming(); // Function Engine.NavMovementComponent.IsSwimming // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c960
	bool IsMovingOnGround(); // Function Engine.NavMovementComponent.IsMovingOnGround // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c610
	bool IsFlying(); // Function Engine.NavMovementComponent.IsFlying // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c4c0
	bool IsFalling(); // Function Engine.NavMovementComponent.IsFalling // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c490
	bool IsCrouching(); // Function Engine.NavMovementComponent.IsCrouching // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c3d0
	struct FVector GetActorFeetLocation(); // Function Engine.NavMovementComponent.GetActorFeetLocation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d96bd0
};

// Class Engine.PawnMovementComponent
// Size: 0x160 (Inherited: 0x158)
struct UPawnMovementComponent : UNavMovementComponent {
	struct APawn* PawnOwner; // 0x158(0x08)

	struct FVector K2_GetInputVector(); // Function Engine.PawnMovementComponent.K2_GetInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9ca40
	bool IsMoveInputIgnored(); // Function Engine.PawnMovementComponent.IsMoveInputIgnored // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c5e0
	struct FVector GetPendingInputVector(); // Function Engine.PawnMovementComponent.GetPendingInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d99400
	struct APawn* GetPawnOwner(); // Function Engine.PawnMovementComponent.GetPawnOwner // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d993d0
	struct FVector GetLastInputVector(); // Function Engine.PawnMovementComponent.GetLastInputVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97d70
	struct FVector ConsumeInputVector(); // Function Engine.PawnMovementComponent.ConsumeInputVector // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d948d0
	void AddInputVector(struct FVector WorldVector, bool bForce); // Function Engine.PawnMovementComponent.AddInputVector // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d93650
};

// Class Engine.CharacterMovementComponent
// Size: 0x590 (Inherited: 0x160)
struct UCharacterMovementComponent : UPawnMovementComponent {
	char UnknownData_160[0x18]; // 0x160(0x18)
	struct ACharacter* CharacterOwner; // 0x178(0x08)
	float GravityScale; // 0x180(0x04)
	float MaxStepHeight; // 0x184(0x04)
	float JumpZVelocity; // 0x188(0x04)
	float JumpOffJumpZFactor; // 0x18c(0x04)
	float WalkableFloorAngle; // 0x190(0x04)
	float WalkableFloorZ; // 0x194(0x04)
	char MovementMode; // 0x198(0x01)
	char CustomMovementMode; // 0x199(0x01)
	char UnknownData_19A[0x26]; // 0x19a(0x26)
	float GroundFriction; // 0x1c0(0x04)
	float MaxWalkSpeed; // 0x1c4(0x04)
	float MaxWalkSpeedBackwards; // 0x1c8(0x04)
	float WalkBackwardsMinAngle; // 0x1cc(0x04)
	float WalkBackwardsMaxAngle; // 0x1d0(0x04)
	float MaxWalkSpeedCrouched; // 0x1d4(0x04)
	float MaxSwimSpeed; // 0x1d8(0x04)
	float MaxFlySpeed; // 0x1dc(0x04)
	float MaxCustomMovementSpeed; // 0x1e0(0x04)
	float MaxAcceleration; // 0x1e4(0x04)
	float MaxChargeAcceleration; // 0x1e8(0x04)
	float BrakingFrictionFactor; // 0x1ec(0x04)
	float BrakingFriction; // 0x1f0(0x04)
	char bUseSeparateBrakingFriction : 1; // 0x1f4(0x01)
	char UnknownData_1F4_1 : 7; // 0x1f4(0x01)
	char UnknownData_1F5[0x3]; // 0x1f5(0x03)
	float BrakingDecelerationWalking; // 0x1f8(0x04)
	float BrakingDecelerationFalling; // 0x1fc(0x04)
	float BrakingDecelerationSwimming; // 0x200(0x04)
	float BrakingDecelerationFlying; // 0x204(0x04)
	float AirControl; // 0x208(0x04)
	float AirControlBoostMultiplier; // 0x20c(0x04)
	float AirControlBoostVelocityThreshold; // 0x210(0x04)
	float FallingLateralFriction; // 0x214(0x04)
	float CrouchedHalfHeight; // 0x218(0x04)
	float Buoyancy; // 0x21c(0x04)
	float PerchRadiusThreshold; // 0x220(0x04)
	float PerchAdditionalHeight; // 0x224(0x04)
	struct FRotator RotationRate; // 0x228(0x0c)
	char bUseControllerDesiredRotation : 1; // 0x234(0x01)
	char bOrientRotationToMovement : 1; // 0x234(0x01)
	char bMovementInProgress : 1; // 0x234(0x01)
	char bEnableScopedMovementUpdates : 1; // 0x234(0x01)
	char bForceMaxAccel : 1; // 0x234(0x01)
	char bRunPhysicsWithNoController : 1; // 0x234(0x01)
	char bForceNextFloorCheck : 1; // 0x234(0x01)
	char bShrinkProxyCapsule : 1; // 0x234(0x01)
	char bCanWalkOffLedges : 1; // 0x235(0x01)
	char bCanWalkOffLedgesWhenCrouching : 1; // 0x235(0x01)
	char bDeferUpdateMoveComponent : 1; // 0x235(0x01)
	char UnknownData_235_3 : 5; // 0x235(0x01)
	char UnknownData_236[0x2]; // 0x236(0x02)
	struct USceneComponent* DeferredUpdatedMoveComponent; // 0x238(0x08)
	float MaxOutOfWaterStepHeight; // 0x240(0x04)
	float OutofWaterZ; // 0x244(0x04)
	float Mass; // 0x248(0x04)
	bool bEnablePhysicsInteraction; // 0x24c(0x01)
	bool bTouchForceScaledToMass; // 0x24d(0x01)
	bool bPushForceScaledToMass; // 0x24e(0x01)
	bool bScalePushForceToVelocity; // 0x24f(0x01)
	float StandingDownwardForceScale; // 0x250(0x04)
	float InitialPushForceFactor; // 0x254(0x04)
	float PushForceFactor; // 0x258(0x04)
	float PushForcePointZOffsetFactor; // 0x25c(0x04)
	float TouchForceFactor; // 0x260(0x04)
	float MinTouchForce; // 0x264(0x04)
	float MaxTouchForce; // 0x268(0x04)
	float RepulsionForce; // 0x26c(0x04)
	float NetMoveDelta; // 0x270(0x04)
	char bForceBraking : 1; // 0x274(0x01)
	char UnknownData_274_1 : 7; // 0x274(0x01)
	char UnknownData_275[0x3]; // 0x275(0x03)
	float CrouchedSpeedMultiplier; // 0x278(0x04)
	float UpperImpactNormalScale; // 0x27c(0x04)
	struct FVector Acceleration; // 0x280(0x0c)
	struct FVector LastUpdateLocation; // 0x28c(0x0c)
	struct FVector PendingImpulseToApply; // 0x298(0x0c)
	struct FVector PendingForceToApply; // 0x2a4(0x0c)
	float AnalogInputModifier; // 0x2b0(0x04)
	char UnknownData_2B4[0x34]; // 0x2b4(0x34)
	float MaxSimulationTimeStep; // 0x2e8(0x04)
	int32_t MaxSimulationIterations; // 0x2ec(0x04)
	float MaxSmoothNetUpdateDist; // 0x2f0(0x04)
	float NoSmoothNetUpdateDist; // 0x2f4(0x04)
	float NetworkSimulatedSmoothLocationTime; // 0x2f8(0x04)
	float NetworkSimulatedSmoothRotationTime; // 0x2fc(0x04)
	float LedgeCheckThreshold; // 0x300(0x04)
	float JumpOutOfWaterPitch; // 0x304(0x04)
	struct FFindFloorResult CurrentFloor; // 0x308(0x8c)
	char DefaultLandMovementMode; // 0x394(0x01)
	char DefaultWaterMovementMode; // 0x395(0x01)
	char GroundMovementMode; // 0x396(0x01)
	char UnknownData_397[0x1]; // 0x397(0x01)
	char bMaintainHorizontalGroundVelocity : 1; // 0x398(0x01)
	char bImpartBaseVelocityX : 1; // 0x398(0x01)
	char bImpartBaseVelocityY : 1; // 0x398(0x01)
	char bImpartBaseVelocityZ : 1; // 0x398(0x01)
	char bImpartBaseAngularVelocity : 1; // 0x398(0x01)
	char bJustTeleported : 1; // 0x398(0x01)
	char bNetworkUpdateReceived : 1; // 0x398(0x01)
	char bBasedMovementUpdateReceived : 1; // 0x398(0x01)
	char bMovementUpdateReceived : 1; // 0x399(0x01)
	char bNetworkMovementModeChanged : 1; // 0x399(0x01)
	char bNotifyApex : 1; // 0x399(0x01)
	char bCheatFlying : 1; // 0x399(0x01)
	char bWantsToCrouch : 1; // 0x399(0x01)
	char bCrouchMaintainsBaseLocation : 1; // 0x399(0x01)
	char bIgnoreBaseRotation : 1; // 0x399(0x01)
	char bFastAttachedMove : 1; // 0x399(0x01)
	char bAlwaysCheckFloor : 1; // 0x39a(0x01)
	char bUseFlatBaseForFloorChecks : 1; // 0x39a(0x01)
	char bPerformingJumpOff : 1; // 0x39a(0x01)
	char bWantsToLeaveNavWalking : 1; // 0x39a(0x01)
	char bUseRVOAvoidance : 1; // 0x39a(0x01)
	char bRequestedMoveUseAcceleration : 1; // 0x39a(0x01)
	char bPreventSimulatedFloorChecks : 1; // 0x39a(0x01)
	char bPreventNavMeshFalling : 1; // 0x39a(0x01)
	char bHasRequestedVelocity : 1; // 0x39b(0x01)
	char bRequestedMoveWithMaxSpeed : 1; // 0x39b(0x01)
	char bWasAvoidanceUpdated : 1; // 0x39b(0x01)
	char UnknownData_39B_3 : 2; // 0x39b(0x01)
	char bProjectNavMeshWalking : 1; // 0x39b(0x01)
	char UnknownData_39B_6 : 2; // 0x39b(0x01)
	char UnknownData_39C[0x14]; // 0x39c(0x14)
	float SmoothingClientPositionTolerance; // 0x3b0(0x04)
	float AvoidanceConsiderationRadius; // 0x3b4(0x04)
	struct FVector RequestedVelocity; // 0x3b8(0x0c)
	int32_t AvoidanceUID; // 0x3c4(0x04)
	struct FNavAvoidanceMask AvoidanceGroup; // 0x3c8(0x04)
	struct FNavAvoidanceMask GroupsToAvoid; // 0x3cc(0x04)
	struct FNavAvoidanceMask GroupsToIgnore; // 0x3d0(0x04)
	float AvoidanceWeight; // 0x3d4(0x04)
	struct FVector PendingLaunchVelocity; // 0x3d8(0x0c)
	char UnknownData_3E4[0x9c]; // 0x3e4(0x9c)
	float NavMeshProjectionInterval; // 0x480(0x04)
	float NavMeshProjectionTimer; // 0x484(0x04)
	bool bUseNavMeshProjectionTimeModifier; // 0x488(0x01)
	char UnknownData_489[0x3]; // 0x489(0x03)
	float MaxNavMeshProjectionInterval; // 0x48c(0x04)
	char UnknownData_490[0x4]; // 0x490(0x04)
	float NavMeshProjectionInterpSpeed; // 0x494(0x04)
	bool bUsePlaneBasedNavMeshProjectionInterpSystem; // 0x498(0x01)
	char UnknownData_499[0x3]; // 0x499(0x03)
	float MaxAllowedZOffsetFromCurrentPlane; // 0x49c(0x04)
	float MaxZDiffFromPrevPlane; // 0x4a0(0x04)
	char UnknownData_4A4[0x1c]; // 0x4a4(0x1c)
	float NavMeshProjectionHeightScaleUp; // 0x4c0(0x04)
	float NavMeshProjectionHeightScaleDown; // 0x4c4(0x04)
	bool UseControllerRotationInNavWalkingMoveComponent; // 0x4c8(0x01)
	char UnknownData_4C9[0x7]; // 0x4c9(0x07)
	struct FCharacterMovementComponentPreClothTickFunction PreClothComponentTick; // 0x4d0(0x50)
	char UnknownData_520[0x14]; // 0x520(0x14)
	float MinTimeBetweenTimeStampResets; // 0x534(0x04)
	char UnknownData_538[0x8]; // 0x538(0x08)
	struct FRootMotionMovementParams RootMotionParams; // 0x540(0x40)
	bool bWasSimulatingRootMotion; // 0x580(0x01)
	char UnknownData_581[0xf]; // 0x581(0x0f)

	void UpdateMaxNavMeshProjectionIntervalAndModifier(float DesiredMaxNavMeshProjectionInterval); // Function Engine.CharacterMovementComponent.UpdateMaxNavMeshProjectionIntervalAndModifier // Final|Native|Public|BlueprintCallable // @ game+0x2eb4390
	void SetWalkableFloorZ(float InWalkableFloorZ); // Function Engine.CharacterMovementComponent.SetWalkableFloorZ // Final|Native|Public|BlueprintCallable // @ game+0x2eb1f60
	void SetWalkableFloorAngle(float InWalkableFloorAngle); // Function Engine.CharacterMovementComponent.SetWalkableFloorAngle // Final|Native|Public|BlueprintCallable // @ game+0x2eb1ee0
	void SetNavMeshProjectionInterval(float InNavMeshProjectionInterval); // Function Engine.CharacterMovementComponent.SetNavMeshProjectionInterval // Final|Native|Public|BlueprintCallable // @ game+0x2eaf8e0
	void SetMovementMode(char NewMovementMode, char NewCustomMode); // Function Engine.CharacterMovementComponent.SetMovementMode // Native|Public|BlueprintCallable // @ game+0x2eaf6c0
	void SetGroupsToIgnore(int32_t GroupFlags); // Function Engine.CharacterMovementComponent.SetGroupsToIgnore // Final|Native|Public|BlueprintCallable // @ game+0x2eaea80
	void SetGroupsToAvoid(int32_t GroupFlags); // Function Engine.CharacterMovementComponent.SetGroupsToAvoid // Final|Native|Public|BlueprintCallable // @ game+0x2eaea00
	void SetAvoidanceGroup(int32_t GroupFlags); // Function Engine.CharacterMovementComponent.SetAvoidanceGroup // Final|Native|Public|BlueprintCallable // @ game+0x2eabb90
	void SetAvoidanceEnabled(bool bEnable); // Function Engine.CharacterMovementComponent.SetAvoidanceEnabled // Final|Native|Public|BlueprintCallable // @ game+0x2eabb00
	void ServerMoveOld(float OldTimeStamp, struct FVector_NetQuantize10 OldAccel, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, char OldMoveFlags); // Function Engine.CharacterMovementComponent.ServerMoveOld // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x2eab3f0
	void ServerMoveDualHybridRootMotion(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, char PendingFlags, uint32_t View0, float TimeStamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char NewFlags, char ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode); // Function Engine.CharacterMovementComponent.ServerMoveDualHybridRootMotion // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x2eaaf90
	void ServerMoveDual(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, char PendingFlags, uint32_t View0, float TimeStamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char NewFlags, char ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode); // Function Engine.CharacterMovementComponent.ServerMoveDual // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x2eaab30
	void ServerMove(float TimeStamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char CompressedMoveFlags, char ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode); // Function Engine.CharacterMovementComponent.ServerMove // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x2eaa810
	float K2_GetWalkableFloorZ(); // Function Engine.CharacterMovementComponent.K2_GetWalkableFloorZ // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea7bd0
	float K2_GetWalkableFloorAngle(); // Function Engine.CharacterMovementComponent.K2_GetWalkableFloorAngle // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea7ba0
	float K2_GetModifiedMaxAcceleration(); // Function Engine.CharacterMovementComponent.K2_GetModifiedMaxAcceleration // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea7b60
	bool IsWalking(); // Function Engine.CharacterMovementComponent.IsWalking // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea7b30
	bool IsWalkable(struct FHitResult Hit); // Function Engine.CharacterMovementComponent.IsWalkable // Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea7a60
	float GetValidPerchRadius(); // Function Engine.CharacterMovementComponent.GetValidPerchRadius // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea70a0
	float GetPerchRadiusThreshold(); // Function Engine.CharacterMovementComponent.GetPerchRadiusThreshold // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea5c40
	float GetNavMeshProjectionInterval(); // Function Engine.CharacterMovementComponent.GetNavMeshProjectionInterval // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea5810
	struct UPrimitiveComponent* GetMovementBase(); // Function Engine.CharacterMovementComponent.GetMovementBase // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea57e0
	float GetMaxJumpHeight(); // Function Engine.CharacterMovementComponent.GetMaxJumpHeight // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea56e0
	float GetMaxAcceleration(); // Function Engine.CharacterMovementComponent.GetMaxAcceleration // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea55e0
	struct FVector GetImpartedMovementBaseVelocity(); // Function Engine.CharacterMovementComponent.GetImpartedMovementBaseVelocity // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea4850
	struct FVector GetCurrentAcceleration(); // Function Engine.CharacterMovementComponent.GetCurrentAcceleration // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea3f20
	struct ACharacter* GetCharacterOwner(); // Function Engine.CharacterMovementComponent.GetCharacterOwner // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea3f00
	float GetAnalogInputModifier(); // Function Engine.CharacterMovementComponent.GetAnalogInputModifier // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea3150
	void DisableMovement(); // Function Engine.CharacterMovementComponent.DisableMovement // Native|Public|BlueprintCallable // @ game+0x2ea23e0
	void ClientVeryShortAdjustPosition(float TimeStamp, struct FVector NewLoc, struct UPrimitiveComponent* NewBase, struct FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // Function Engine.CharacterMovementComponent.ClientVeryShortAdjustPosition // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x2ea1ad0
	void ClientAdjustRootMotionPosition(float TimeStamp, float ServerMontageTrackPosition, struct FVector ServerLoc, struct FVector_NetQuantizeNormal ServerRotation, float ServerVelZ, struct UPrimitiveComponent* ServerBase, struct FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // Function Engine.CharacterMovementComponent.ClientAdjustRootMotionPosition // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x2ea17e0
	void ClientAdjustPosition(float TimeStamp, struct FVector NewLoc, struct FVector NewVel, struct UPrimitiveComponent* NewBase, struct FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // Function Engine.CharacterMovementComponent.ClientAdjustPosition // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x2ea1570
	void ClientAckGoodMove(float TimeStamp); // Function Engine.CharacterMovementComponent.ClientAckGoodMove // Net|Native|Event|Public|NetClient // @ game+0x2ea14f0
	void CapsuleTouched(struct AActor* Other, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Engine.CharacterMovementComponent.CapsuleTouched // Native|Protected|HasOutParms // @ game+0x2ea1260
	void CalcVelocity(float DeltaTime, float Friction, bool bFluid, float BrakingDeceleration); // Function Engine.CharacterMovementComponent.CalcVelocity // Native|Public|BlueprintCallable // @ game+0x2ea1000
	void AddImpulse(struct FVector Impulse, bool bVelocityChange); // Function Engine.CharacterMovementComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2e9e680
	void AddForce(struct FVector Force); // Function Engine.CharacterMovementComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2e9e5f0
};

// Class Engine.Engine
// Size: 0x9d0 (Inherited: 0x28)
struct UEngine : UObject {
	char UnknownData_28[0x8]; // 0x28(0x08)
	struct UFont* TinyFont; // 0x30(0x08)
	struct FStringAssetReference TinyFontName; // 0x38(0x10)
	struct UFont* SmallFont; // 0x48(0x08)
	struct FStringAssetReference SmallFontName; // 0x50(0x10)
	struct UFont* MediumFont; // 0x60(0x08)
	struct FStringAssetReference MediumFontName; // 0x68(0x10)
	struct UFont* LargeFont; // 0x78(0x08)
	struct FStringAssetReference LargeFontName; // 0x80(0x10)
	struct UFont* MonoFont; // 0x90(0x08)
	struct FStringAssetReference MonoFontName; // 0x98(0x10)
	struct UFont* SubtitleFont; // 0xa8(0x08)
	struct FStringAssetReference SubtitleFontName; // 0xb0(0x10)
	struct UFont* HugeFont; // 0xc0(0x08)
	struct FStringAssetReference HugeFontName; // 0xc8(0x10)
	struct TArray<struct UFont*> AdditionalFonts; // 0xd8(0x10)
	char UnknownData_E8[0x8]; // 0xe8(0x08)
	struct TArray<struct FString> AdditionalFontNames; // 0xf0(0x10)
	struct UClass* ConsoleClass; // 0x100(0x08)
	struct FStringClassReference ConsoleClassName; // 0x108(0x10)
	struct UClass* GameViewportClientClass; // 0x118(0x08)
	struct FStringClassReference GameViewportClientClassName; // 0x120(0x10)
	struct UClass* LocalPlayerClass; // 0x130(0x08)
	struct FStringClassReference LocalPlayerClassName; // 0x138(0x10)
	struct UClass* WorldSettingsClass; // 0x148(0x08)
	struct FStringClassReference WorldSettingsClassName; // 0x150(0x10)
	struct FStringClassReference NavigationSystemClassName; // 0x160(0x10)
	struct UClass* NavigationSystemClass; // 0x170(0x08)
	struct FStringClassReference AvoidanceManagerClassName; // 0x178(0x10)
	struct UClass* AvoidanceManagerClass; // 0x188(0x08)
	struct UClass* PhysicsCollisionHandlerClass; // 0x190(0x08)
	struct FStringClassReference PhysicsCollisionHandlerClassName; // 0x198(0x10)
	struct FStringClassReference GameUserSettingsClassName; // 0x1a8(0x10)
	struct UClass* GameUserSettingsClass; // 0x1b8(0x08)
	struct FStringClassReference AIControllerClassName; // 0x1c0(0x10)
	struct UGameUserSettings* GameUserSettings; // 0x1d0(0x08)
	struct UClass* LevelScriptActorClass; // 0x1d8(0x08)
	struct FStringClassReference LevelScriptActorClassName; // 0x1e0(0x10)
	struct FStringClassReference DefaultBlueprintBaseClassName; // 0x1f0(0x10)
	struct FStringClassReference GameSingletonClassName; // 0x200(0x10)
	struct UObject* GameSingleton; // 0x210(0x08)
	struct UClass* DefaultPreviewPawnClass; // 0x218(0x08)
	struct FStringClassReference DefaultPreviewPawnClassName; // 0x220(0x10)
	struct FString PlayOnConsoleSaveDir; // 0x230(0x10)
	struct UTexture2D* DefaultTexture; // 0x240(0x08)
	struct FStringAssetReference DefaultTextureName; // 0x248(0x10)
	struct UTexture* DefaultDiffuseTexture; // 0x258(0x08)
	struct FStringAssetReference DefaultDiffuseTextureName; // 0x260(0x10)
	struct UTexture2D* DefaultBSPVertexTexture; // 0x270(0x08)
	struct FStringAssetReference DefaultBSPVertexTextureName; // 0x278(0x10)
	struct UTexture2D* HighFrequencyNoiseTexture; // 0x288(0x08)
	struct FStringAssetReference HighFrequencyNoiseTextureName; // 0x290(0x10)
	struct UTexture2D* DefaultBokehTexture; // 0x2a0(0x08)
	struct FStringAssetReference DefaultBokehTextureName; // 0x2a8(0x10)
	struct UTexture2D* HDRCalibrationTexture; // 0x2b8(0x08)
	struct FStringAssetReference HDRCalibrationTextureName; // 0x2c0(0x10)
	struct UMaterial* WireframeMaterial; // 0x2d0(0x08)
	struct FString WireframeMaterialName; // 0x2d8(0x10)
	struct UMaterial* DebugMeshMaterial; // 0x2e8(0x08)
	struct FStringAssetReference DebugMeshMaterialName; // 0x2f0(0x10)
	struct UMaterial* LevelColorationLitMaterial; // 0x300(0x08)
	struct FString LevelColorationLitMaterialName; // 0x308(0x10)
	struct UMaterial* LevelColorationUnlitMaterial; // 0x318(0x08)
	struct FString LevelColorationUnlitMaterialName; // 0x320(0x10)
	struct UMaterial* TriangleDensityScreenSpaceMaterial; // 0x330(0x08)
	struct FString TriangleDensityScreenSpaceMaterialName; // 0x338(0x10)
	struct UMaterial* TriangleDensityWorldSpaceMaterial; // 0x348(0x08)
	struct FString TriangleDensityWorldSpaceMaterialName; // 0x350(0x10)
	struct UMaterial* LightingTexelDensityMaterial; // 0x360(0x08)
	struct FString LightingTexelDensityName; // 0x368(0x10)
	struct UMaterial* ShadedLevelColorationLitMaterial; // 0x378(0x08)
	struct FString ShadedLevelColorationLitMaterialName; // 0x380(0x10)
	struct UMaterial* ShadedLevelColorationUnlitMaterial; // 0x390(0x08)
	struct FString ShadedLevelColorationUnlitMaterialName; // 0x398(0x10)
	struct UMaterial* RemoveSurfaceMaterial; // 0x3a8(0x08)
	struct FStringAssetReference RemoveSurfaceMaterialName; // 0x3b0(0x10)
	struct UMaterial* VertexColorMaterial; // 0x3c0(0x08)
	struct FString VertexColorMaterialName; // 0x3c8(0x10)
	struct UMaterial* VertexColorViewModeMaterial_ColorOnly; // 0x3d8(0x08)
	struct FString VertexColorViewModeMaterialName_ColorOnly; // 0x3e0(0x10)
	struct UMaterial* VertexColorViewModeMaterial_AlphaAsColor; // 0x3f0(0x08)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x3f8(0x10)
	struct UMaterial* VertexColorViewModeMaterial_RedOnly; // 0x408(0x08)
	struct FString VertexColorViewModeMaterialName_RedOnly; // 0x410(0x10)
	struct UMaterial* VertexColorViewModeMaterial_GreenOnly; // 0x420(0x08)
	struct FString VertexColorViewModeMaterialName_GreenOnly; // 0x428(0x10)
	struct UMaterial* VertexColorViewModeMaterial_BlueOnly; // 0x438(0x08)
	struct FString VertexColorViewModeMaterialName_BlueOnly; // 0x440(0x10)
	struct UMaterial* ConstraintLimitMaterial; // 0x450(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialX; // 0x458(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialY; // 0x460(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialZ; // 0x468(0x08)
	struct FStringAssetReference ConstraintLimitMaterialName; // 0x470(0x10)
	struct UMaterial* InvalidLightmapSettingsMaterial; // 0x480(0x08)
	struct FStringAssetReference InvalidLightmapSettingsMaterialName; // 0x488(0x10)
	struct UMaterial* PreviewShadowsIndicatorMaterial; // 0x498(0x08)
	struct FStringAssetReference PreviewShadowsIndicatorMaterialName; // 0x4a0(0x10)
	struct UMaterial* ArrowMaterial; // 0x4b0(0x08)
	struct FStringAssetReference ArrowMaterialName; // 0x4b8(0x10)
	struct FLinearColor LightingOnlyBrightness; // 0x4c8(0x10)
	struct TArray<struct FColor> LightComplexityColors; // 0x4d8(0x10)
	struct TArray<struct FLinearColor> ShaderComplexityColors; // 0x4e8(0x10)
	struct TArray<struct FLinearColor> StationaryLightOverlapColors; // 0x4f8(0x10)
	struct TArray<struct FLinearColor> LODColorationColors; // 0x508(0x10)
	float MaxPixelShaderAdditiveComplexityCount; // 0x518(0x04)
	float MaxES2PixelShaderAdditiveComplexityCount; // 0x51c(0x04)
	float MinLightMapDensity; // 0x520(0x04)
	float IdealLightMapDensity; // 0x524(0x04)
	float MaxLightMapDensity; // 0x528(0x04)
	char bRenderLightMapDensityGrayscale : 1; // 0x52c(0x01)
	char UnknownData_52C_1 : 7; // 0x52c(0x01)
	char UnknownData_52D[0x3]; // 0x52d(0x03)
	float RenderLightMapDensityGrayscaleScale; // 0x530(0x04)
	float RenderLightMapDensityColorScale; // 0x534(0x04)
	struct FLinearColor LightMapDensityVertexMappedColor; // 0x538(0x10)
	struct FLinearColor LightMapDensitySelectedColor; // 0x548(0x10)
	struct TArray<struct FStatColorMapping> StatColorMappings; // 0x558(0x10)
	struct UPhysicalMaterial* DefaultPhysMaterial; // 0x568(0x08)
	struct FStringAssetReference DefaultPhysMaterialName; // 0x570(0x10)
	struct TArray<struct FGameNameRedirect> ActiveGameNameRedirects; // 0x580(0x10)
	struct TArray<struct FClassRedirect> ActiveClassRedirects; // 0x590(0x10)
	struct TArray<struct FPluginRedirect> ActivePluginRedirects; // 0x5a0(0x10)
	struct TArray<struct FStructRedirect> ActiveStructRedirects; // 0x5b0(0x10)
	struct UTexture2D* PreIntegratedSkinBRDFTexture; // 0x5c0(0x08)
	struct FStringAssetReference PreIntegratedSkinBRDFTextureName; // 0x5c8(0x10)
	struct UTexture2D* MiniFontTexture; // 0x5d8(0x08)
	struct FStringAssetReference MiniFontTextureName; // 0x5e0(0x10)
	struct UTexture* WeightMapPlaceholderTexture; // 0x5f0(0x08)
	struct FStringAssetReference WeightMapPlaceholderTextureName; // 0x5f8(0x10)
	struct UTexture2D* LightMapDensityTexture; // 0x608(0x08)
	struct FStringAssetReference LightMapDensityTextureName; // 0x610(0x10)
	char UnknownData_620[0x8]; // 0x620(0x08)
	struct UGameViewportClient* GameViewport; // 0x628(0x08)
	struct TArray<struct FString> DeferredCommands; // 0x630(0x10)
	int32_t TickCycles; // 0x640(0x04)
	int32_t GameCycles; // 0x644(0x04)
	int32_t ClientCycles; // 0x648(0x04)
	float NearClipPlane; // 0x64c(0x04)
	char bHardwareSurveyEnabled : 1; // 0x650(0x01)
	char bSubtitlesEnabled : 1; // 0x650(0x01)
	char bSubtitlesForcedOff : 1; // 0x650(0x01)
	char UnknownData_650_3 : 5; // 0x650(0x01)
	char UnknownData_651[0x3]; // 0x651(0x03)
	int32_t MaximumLoopIterationCount; // 0x654(0x04)
	char bCanBlueprintsTickByDefault : 1; // 0x658(0x01)
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x658(0x01)
	char bEnableEditorPSysRealtimeLOD : 1; // 0x658(0x01)
	char UnknownData_658_3 : 1; // 0x658(0x01)
	char bSmoothFrameRate : 1; // 0x658(0x01)
	char bUseFixedFrameRate : 1; // 0x658(0x01)
	char UnknownData_658_6 : 2; // 0x658(0x01)
	char UnknownData_659[0x3]; // 0x659(0x03)
	float FixedFrameRate; // 0x65c(0x04)
	struct FFloatRange SmoothedFrameRateRange; // 0x660(0x10)
	struct UEngineCustomTimeStep* CustomTimeStep; // 0x670(0x08)
	char UnknownData_678[0x20]; // 0x678(0x20)
	struct UTimecodeProvider* TimecodeProvider; // 0x698(0x08)
	char UnknownData_6A0[0x19]; // 0x6a0(0x19)
	bool bGenerateDefaultTimecode; // 0x6b9(0x01)
	char UnknownData_6BA[0xa]; // 0x6ba(0x0a)
	float GenerateDefaultTimecodeFrameDelay; // 0x6c4(0x04)
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x6c8(0x01)
	char UnknownData_6C8_1 : 7; // 0x6c8(0x01)
	char UnknownData_6C9[0x3]; // 0x6c9(0x03)
	int32_t NumPawnsAllowedToBeSpawnedInAFrame; // 0x6cc(0x04)
	char bShouldGenerateLowQualityLightmaps : 1; // 0x6d0(0x01)
	char UnknownData_6D0_1 : 7; // 0x6d0(0x01)
	char UnknownData_6D1[0x3]; // 0x6d1(0x03)
	struct FColor C_WorldBox; // 0x6d4(0x04)
	struct FColor C_BrushWire; // 0x6d8(0x04)
	struct FColor C_AddWire; // 0x6dc(0x04)
	struct FColor C_SubtractWire; // 0x6e0(0x04)
	struct FColor C_SemiSolidWire; // 0x6e4(0x04)
	struct FColor C_NonSolidWire; // 0x6e8(0x04)
	struct FColor C_WireBackground; // 0x6ec(0x04)
	struct FColor C_ScaleBoxHi; // 0x6f0(0x04)
	struct FColor C_VolumeCollision; // 0x6f4(0x04)
	struct FColor C_BSPCollision; // 0x6f8(0x04)
	struct FColor C_OrthoBackground; // 0x6fc(0x04)
	struct FColor C_Volume; // 0x700(0x04)
	struct FColor C_BrushShape; // 0x704(0x04)
	float StreamingDistanceFactor; // 0x708(0x04)
	char TransitionType; // 0x70c(0x01)
	char UnknownData_70D[0x3]; // 0x70d(0x03)
	struct FString TransitionDescription; // 0x710(0x10)
	struct FString TransitionGameMode; // 0x720(0x10)
	float MeshLODRange; // 0x730(0x04)
	char bAllowMatureLanguage : 1; // 0x734(0x01)
	char UnknownData_734_1 : 7; // 0x734(0x01)
	char UnknownData_735[0x3]; // 0x735(0x03)
	float CameraRotationThreshold; // 0x738(0x04)
	float CameraTranslationThreshold; // 0x73c(0x04)
	float PrimitiveProbablyVisibleTime; // 0x740(0x04)
	float MaxOcclusionPixelsFraction; // 0x744(0x04)
	char bPauseOnLossOfFocus : 1; // 0x748(0x01)
	char UnknownData_748_1 : 7; // 0x748(0x01)
	char UnknownData_749[0x3]; // 0x749(0x03)
	int32_t MaxParticleResize; // 0x74c(0x04)
	int32_t MaxParticleResizeWarn; // 0x750(0x04)
	char UnknownData_754[0x4]; // 0x754(0x04)
	struct TArray<struct FDropNoteInfo> PendingDroppedNotes; // 0x758(0x10)
	struct FRigidBodyErrorCorrection PhysicErrorCorrection; // 0x768(0x1c)
	float NetClientTicksPerSecond; // 0x784(0x04)
	char bHasPendingGlobalReregister : 1; // 0x788(0x01)
	char UnknownData_788_1 : 7; // 0x788(0x01)
	char UnknownData_789[0x3]; // 0x789(0x03)
	float DisplayGamma; // 0x78c(0x04)
	float MinDesiredFrameRate; // 0x790(0x04)
	struct FLinearColor DefaultSelectedMaterialColor; // 0x794(0x10)
	struct FLinearColor SelectedMaterialColor; // 0x7a4(0x10)
	struct FLinearColor SelectionOutlineColor; // 0x7b4(0x10)
	struct FLinearColor SubduedSelectionOutlineColor; // 0x7c4(0x10)
	struct FLinearColor SelectedMaterialColorOverride; // 0x7d4(0x10)
	bool bIsOverridingSelectedColor; // 0x7e4(0x01)
	char UnknownData_7E5[0x3]; // 0x7e5(0x03)
	char bEnableOnScreenDebugMessages : 1; // 0x7e8(0x01)
	char bEnableOnScreenDebugMessagesDisplay : 1; // 0x7e8(0x01)
	char bSuppressMapWarnings : 1; // 0x7e8(0x01)
	char bCookSeparateSharedMPGameContent : 1; // 0x7e8(0x01)
	char bDisableAILogging : 1; // 0x7e8(0x01)
	char UnknownData_7E8_5 : 3; // 0x7e8(0x01)
	char UnknownData_7E9[0x3]; // 0x7e9(0x03)
	uint32_t bEnableVisualLogRecordingOnStart; // 0x7ec(0x04)
	char UnknownData_7F0[0x4]; // 0x7f0(0x04)
	int32_t ScreenSaverInhibitorSemaphore; // 0x7f4(0x04)
	char bLockReadOnlyLevels : 1; // 0x7f8(0x01)
	char UnknownData_7F8_1 : 7; // 0x7f8(0x01)
	char UnknownData_7F9[0x7]; // 0x7f9(0x07)
	struct FString ParticleEventManagerClassPath; // 0x800(0x10)
	char UnknownData_810[0x10]; // 0x810(0x10)
	float SelectionHighlightIntensity; // 0x820(0x04)
	float BSPSelectionHighlightIntensity; // 0x824(0x04)
	float HoverHighlightIntensity; // 0x828(0x04)
	float SelectionHighlightIntensityBillboards; // 0x82c(0x04)
	char UnknownData_830[0x130]; // 0x830(0x130)
	struct TArray<struct FNetDriverDefinition> NetDriverDefinitions; // 0x960(0x10)
	struct TArray<struct FString> ServerActors; // 0x970(0x10)
	struct TArray<struct FString> RuntimeServerActors; // 0x980(0x10)
	char bStartedLoadMapMovie : 1; // 0x990(0x01)
	char UnknownData_990_1 : 7; // 0x990(0x01)
	char UnknownData_991[0x17]; // 0x991(0x17)
	int32_t NextWorldContextHandle; // 0x9a8(0x04)
	char UnknownData_9AC[0x24]; // 0x9ac(0x24)
};

// Class Engine.GameEngine
// Size: 0xa30 (Inherited: 0x9d0)
struct UGameEngine : UEngine {
	float MaxDeltaTime; // 0x9d0(0x04)
	float ServerFlushLogInterval; // 0x9d4(0x04)
	char UnknownData_9D8[0x58]; // 0x9d8(0x58)
};

// Class Engine.GameInstance
// Size: 0x88 (Inherited: 0x28)
struct UGameInstance : UObject {
	char UnknownData_28[0x10]; // 0x28(0x10)
	struct TArray<struct ULocalPlayer*> LocalPlayers; // 0x38(0x10)
	char UnknownData_48[0x8]; // 0x48(0x08)
	struct UOnlineSession* OnlineSession; // 0x50(0x08)
	char UnknownData_58[0x30]; // 0x58(0x30)

	void ReceiveShutdown(); // Function Engine.GameInstance.ReceiveShutdown // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveInit(); // Function Engine.GameInstance.ReceiveInit // Event|Public|BlueprintEvent // @ game+0x1848130
	void DebugRemovePlayer(int32_t ControllerId); // Function Engine.GameInstance.DebugRemovePlayer // Exec|Native|Public // @ game+0x2c93440
	void DebugCreatePlayer(int32_t ControllerId); // Function Engine.GameInstance.DebugCreatePlayer // Exec|Native|Public // @ game+0x2c933b0
};

// Class Engine.Info
// Size: 0x3c8 (Inherited: 0x3c8)
struct AInfo : AActor {
};

// Class Engine.GameMode
// Size: 0x4c0 (Inherited: 0x3c8)
struct AGameMode : AInfo {
	char UnknownData_3C8[0x8]; // 0x3c8(0x08)
	char bDisableAsyncOcclusionChecking : 1; // 0x3d0(0x01)
	char bUseSeamlessTravel : 1; // 0x3d0(0x01)
	char bPauseable : 1; // 0x3d0(0x01)
	char bStartPlayersAsSpectators : 1; // 0x3d0(0x01)
	char bDelayedStart : 1; // 0x3d0(0x01)
	char UnknownData_3D0_5 : 3; // 0x3d0(0x01)
	char UnknownData_3D1[0x7]; // 0x3d1(0x07)
	struct FString OptionsString; // 0x3d8(0x10)
	struct UClass* DefaultPawnClass; // 0x3e8(0x08)
	struct UClass* HUDClass; // 0x3f0(0x08)
	int32_t NumSpectators; // 0x3f8(0x04)
	int32_t NumPlayers; // 0x3fc(0x04)
	int32_t NumBots; // 0x400(0x04)
	float MinRespawnDelay; // 0x404(0x04)
	struct AGameSession* GameSession; // 0x408(0x08)
	int32_t NumTravellingPlayers; // 0x410(0x04)
	char UnknownData_414[0x4]; // 0x414(0x04)
	struct FText DefaultPlayerName; // 0x418(0x38)
	struct UClass* EngineMessageClass; // 0x450(0x08)
	struct UClass* PlayerControllerClass; // 0x458(0x08)
	struct UClass* SpectatorClass; // 0x460(0x08)
	struct UClass* ReplaySpectatorPlayerControllerClass; // 0x468(0x08)
	struct UClass* PlayerStateClass; // 0x470(0x08)
	struct UClass* GameStateClass; // 0x478(0x08)
	struct AGameState* GameState; // 0x480(0x08)
	struct TArray<struct APlayerState*> InactivePlayerArray; // 0x488(0x10)
	char UnknownData_498[0x10]; // 0x498(0x10)
	struct TArray<struct FGameClassShortName> GameModeClassAliases; // 0x4a8(0x10)
	float InactivePlayerStateLifeSpan; // 0x4b8(0x04)
	bool bHandleDedicatedServerReplays; // 0x4bc(0x01)
	char UnknownData_4BD[0x3]; // 0x4bd(0x03)

	void StartPlay(); // Function Engine.GameMode.StartPlay // Native|Public|BlueprintCallable // @ game+0x2da5f20
	void StartMatch(); // Function Engine.GameMode.StartMatch // Native|Public|BlueprintCallable // @ game+0x2da5f00
	struct APawn* SpawnDefaultPawnFor(struct AController* NewPlayer, struct AActor* StartSpot); // Function Engine.GameMode.SpawnDefaultPawnFor // Native|Event|Public|BlueprintEvent // @ game+0x2da5e30
	bool ShouldReset(struct AActor* ActorToReset); // Function Engine.GameMode.ShouldReset // Native|Event|Public|BlueprintEvent // @ game+0x2da5a10
	void SetBandwidthLimit(float AsyncIOBandwidthLimit); // Function Engine.GameMode.SetBandwidthLimit // Exec|Native|Public // @ game+0x2da00f0
	void ReturnToMainMenuHost(); // Function Engine.GameMode.ReturnToMainMenuHost // Native|Public|BlueprintCallable // @ game+0x2d9ec20
	void RestartGame(); // Function Engine.GameMode.RestartGame // Native|Public|BlueprintCallable // @ game+0x2d9eb80
	void ResetLevel(); // Function Engine.GameMode.ResetLevel // Native|Public|BlueprintCallable // @ game+0x2d9eb40
	bool ReadyToStartMatch(); // Function Engine.GameMode.ReadyToStartMatch // Native|Event|Protected|BlueprintEvent // @ game+0x2d9e6e0
	bool ReadyToEndMatch(); // Function Engine.GameMode.ReadyToEndMatch // Native|Event|Protected|BlueprintEvent // @ game+0x2d9e6b0
	bool PlayerCanRestart(struct APlayerController* Player); // Function Engine.GameMode.PlayerCanRestart // Native|Event|Public|BlueprintEvent // @ game+0x2d9e310
	bool MustSpectate(struct APlayerController* NewPlayerController); // Function Engine.GameMode.MustSpectate // Native|Event|Public|BlueprintEvent|Const // @ game+0x2d9d430
	void K2_PostLogin(struct APlayerController* NewPlayer); // Function Engine.GameMode.K2_PostLogin // Event|Public|BlueprintEvent // @ game+0x1848130
	void K2_OnSwapPlayerControllers(struct APlayerController* OldPC, struct APlayerController* NewPC); // Function Engine.GameMode.K2_OnSwapPlayerControllers // Event|Public|BlueprintEvent // @ game+0x1848130
	void K2_OnSetMatchState(struct FName NewState); // Function Engine.GameMode.K2_OnSetMatchState // Event|Protected|BlueprintEvent // @ game+0x1848130
	void K2_OnRestartPlayer(struct AController* NewPlayer); // Function Engine.GameMode.K2_OnRestartPlayer // Event|Public|BlueprintEvent // @ game+0x1848130
	void K2_OnLogout(struct AController* ExitingController); // Function Engine.GameMode.K2_OnLogout // Event|Public|BlueprintEvent // @ game+0x1848130
	void K2_OnChangeName(struct AController* Other, struct FString NewName, bool bNameChange); // Function Engine.GameMode.K2_OnChangeName // Event|Public|BlueprintEvent // @ game+0x1848130
	struct AActor* K2_FindPlayerStart(struct AController* Player); // Function Engine.GameMode.K2_FindPlayerStart // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2d9c9b0
	bool IsMatchInProgress(); // Function Engine.GameMode.IsMatchInProgress // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c580
	void InitStartSpot(struct AActor* StartSpot, struct AController* NewPlayer); // Function Engine.GameMode.InitStartSpot // Native|Event|Public|BlueprintEvent // @ game+0x2d9c1e0
	bool HasMatchStarted(); // Function Engine.GameMode.HasMatchStarted // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9bfb0
	bool HasMatchEnded(); // Function Engine.GameMode.HasMatchEnded // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9bf80
	int32_t GetNumPlayers(); // Function Engine.GameMode.GetNumPlayers // Native|Public|BlueprintCallable // @ game+0x2d98a40
	struct FName GetMatchState(); // Function Engine.GameMode.GetMatchState // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98520
	struct UClass* GetDefaultPawnClassForController(struct AController* InController); // Function Engine.GameMode.GetDefaultPawnClassForController // Native|Event|Public|BlueprintEvent // @ game+0x2d97710
	struct AActor* FindPlayerStart(struct AController* Player, struct FString IncomingName); // Function Engine.GameMode.FindPlayerStart // Native|Event|Public|BlueprintEvent // @ game+0x2d96830
	void EndMatch(); // Function Engine.GameMode.EndMatch // Native|Public|BlueprintCallable // @ game+0x2d96450
	struct AActor* ChoosePlayerStart(struct AController* Player); // Function Engine.GameMode.ChoosePlayerStart // Native|Event|Public|BlueprintEvent // @ game+0x2d94500
	void ChangeName(struct AController* Controller, struct FString NewName, bool bNameChange); // Function Engine.GameMode.ChangeName // Native|Public|BlueprintCallable // @ game+0x2d943b0
	bool CanSpectate(struct APlayerController* Viewer, struct APlayerState* ViewTarget); // Function Engine.GameMode.CanSpectate // Native|Event|Public|BlueprintEvent // @ game+0x2d942e0
	void AbortMatch(); // Function Engine.GameMode.AbortMatch // Native|Public|BlueprintCallable // @ game+0x2d926c0
};

// Class Engine.PrimitiveComponent
// Size: 0x5c0 (Inherited: 0x2e0)
struct UPrimitiveComponent : USceneComponent {
	char UnknownData_2E0[0x8]; // 0x2e0(0x08)
	float MinDrawDistance; // 0x2e8(0x04)
	char UnknownData_2EC[0x4]; // 0x2ec(0x04)
	float LDMaxDrawDistance; // 0x2f0(0x04)
	float CachedMaxDrawDistance; // 0x2f4(0x04)
	char DepthPriorityGroup; // 0x2f8(0x01)
	char ViewOwnerDepthPriorityGroup; // 0x2f9(0x01)
	char UnknownData_2FA[0x2]; // 0x2fa(0x02)
	char bAlwaysCreatePhysicsState : 1; // 0x2fc(0x01)
	char bGenerateOverlapEvents : 1; // 0x2fc(0x01)
	char bMultiBodyOverlap : 1; // 0x2fc(0x01)
	char bCheckAsyncSceneOnMove : 1; // 0x2fc(0x01)
	char bTraceComplexOnMove : 1; // 0x2fc(0x01)
	char bReturnMaterialOnMove : 1; // 0x2fc(0x01)
	char bUseViewOwnerDepthPriorityGroup : 1; // 0x2fc(0x01)
	char bAllowCullDistanceVolume : 1; // 0x2fc(0x01)
	char bHasMotionBlurVelocityMeshes : 1; // 0x2fd(0x01)
	char bRenderInMainPass : 1; // 0x2fd(0x01)
	char bRenderInCustomPrePass : 1; // 0x2fd(0x01)
	char bReflected : 1; // 0x2fd(0x01)
	char UnknownData_2FD_4 : 1; // 0x2fd(0x01)
	char bReflectedOnLowQuality : 1; // 0x2fd(0x01)
	char bFFTWaterMask : 1; // 0x2fd(0x01)
	char bVolumeFogMask : 1; // 0x2fd(0x01)
	char UnknownData_2FE_0 : 1; // 0x2fe(0x01)
	char bAffectsFlatWater : 1; // 0x2fe(0x01)
	char bGPUParticlesKillPlane : 1; // 0x2fe(0x01)
	char bDontCull : 1; // 0x2fe(0x01)
	char bDontSizeOnScreenCull : 1; // 0x2fe(0x01)
	char UnknownData_2FE_5 : 3; // 0x2fe(0x01)
	char UnknownData_2FF[0x1]; // 0x2ff(0x01)
	float OverriddenShadowMinTexelSize; // 0x300(0x04)
	bool bOverrideShadowMinSizeCulling; // 0x304(0x01)
	bool bOverrideShadowCascadesExclusion; // 0x305(0x01)
	char ExcludedShadowCascades; // 0x306(0x01)
	char UnknownData_307[0x1]; // 0x307(0x01)
	char bReceivesDecals : 1; // 0x308(0x01)
	char bOwnerNoSee : 1; // 0x308(0x01)
	char bOnlyOwnerSee : 1; // 0x308(0x01)
	char bTreatAsBackgroundForOcclusion : 1; // 0x308(0x01)
	char bIsACloud : 1; // 0x308(0x01)
	char bUseAsOccluder : 1; // 0x308(0x01)
	char bSelectable : 1; // 0x308(0x01)
	char bForceMipStreaming : 1; // 0x308(0x01)
	char bHasPerInstanceHitProxies : 1; // 0x309(0x01)
	char CastShadow : 1; // 0x309(0x01)
	char bAffectDynamicIndirectLighting : 1; // 0x309(0x01)
	char bUseFarCascadeLPVBiasMultiplier : 1; // 0x309(0x01)
	char bAffectDistanceFieldLighting : 1; // 0x309(0x01)
	char bCastDynamicShadow : 1; // 0x309(0x01)
	char bCastStaticShadow : 1; // 0x309(0x01)
	char bCastVolumetricTranslucentShadow : 1; // 0x309(0x01)
	char bSelfShadowOnly : 1; // 0x30a(0x01)
	char bCastFarShadow : 1; // 0x30a(0x01)
	char bCastInsetShadow : 1; // 0x30a(0x01)
	char bCastCinematicShadow : 1; // 0x30a(0x01)
	char bCastHiddenShadow : 1; // 0x30a(0x01)
	char bCastShadowAsTwoSided : 1; // 0x30a(0x01)
	char bCastShadowOnLowQuality : 1; // 0x30a(0x01)
	char bLightAsIfStatic : 1; // 0x30a(0x01)
	char bLightAttachmentsAsGroup : 1; // 0x30b(0x01)
	char UnknownData_30B_1 : 7; // 0x30b(0x01)
	char IndirectLightingCacheQuality; // 0x30c(0x01)
	bool bHasCachedStaticLighting; // 0x30d(0x01)
	bool bStaticLightingBuildEnqueued; // 0x30e(0x01)
	char UnknownData_30F[0x1]; // 0x30f(0x01)
	char bIgnoreRadialImpulse : 1; // 0x310(0x01)
	char bIgnoreRadialForce : 1; // 0x310(0x01)
	char AlwaysLoadOnClient : 1; // 0x310(0x01)
	char AlwaysLoadOnServer : 1; // 0x310(0x01)
	char bUseEditorCompositing : 1; // 0x310(0x01)
	char bRenderCustomDepth : 1; // 0x310(0x01)
	char bAllowVelocityInMaterial : 1; // 0x310(0x01)
	char UnknownData_311[0x3]; // 0x311(0x03)
	int32_t CustomDepthStencilValue; // 0x314(0x04)
	int32_t TranslucencySortPriority; // 0x318(0x04)
	int32_t VisibilityId; // 0x31c(0x04)
	char UnknownData_320[0x4]; // 0x320(0x04)
	float LpvBiasMultiplier; // 0x324(0x04)
	float FarCascadeLPVBiasMultiplier; // 0x328(0x04)
	float LpvIntensityMultiplier; // 0x32c(0x04)
	struct FCustomPrimitiveData CustomPrimitiveData; // 0x330(0x10)
	struct FBodyInstance BodyInstance; // 0x340(0x180)
	char bAffectRain : 1; // 0x4c0(0x01)
	char bCanEverAffectNavigation : 1; // 0x4c0(0x01)
	char UnknownData_4C0_2 : 1; // 0x4c0(0x01)
	char bSkipRenderingInOuterLPVCascades : 1; // 0x4c0(0x01)
	char bEnableMergeCollisionComponents : 1; // 0x4c0(0x01)
	char bVisibleWhenAboveWaterAndPlayerUnderwater : 1; // 0x4c0(0x01)
	char bVisibleWhenAboveWaterAndPlayerAbove : 1; // 0x4c0(0x01)
	char bVisibleWhenUnderwaterAndPlayerAbove : 1; // 0x4c0(0x01)
	char bVisibleWhenUnderwaterAndPlayerUnderwater : 1; // 0x4c1(0x01)
	char bCanRenderAboveAndBelowWaterAtSameTime : 1; // 0x4c1(0x01)
	char UnknownData_4C1_2 : 6; // 0x4c1(0x01)
	char UnknownData_4C2[0x6]; // 0x4c2(0x06)
	float BoundsScale; // 0x4c8(0x04)
	float OcclusionBoundsScale; // 0x4cc(0x04)
	float LastRenderTime; // 0x4d0(0x04)
	bool bGPUVisibility; // 0x4d4(0x01)
	char bHasCustomNavigableGeometry; // 0x4d5(0x01)
	char CanCharacterStepUpOn; // 0x4d6(0x01)
	char UnknownData_4D7[0x49]; // 0x4d7(0x49)
	struct FMulticastDelegate OnComponentHit; // 0x520(0x01)
	struct FMulticastDelegate OnComponentBeginOverlap; // 0x521(0x01)
	struct FMulticastDelegate OnComponentEndOverlap; // 0x522(0x01)
	struct FMulticastDelegate OnComponentWake; // 0x523(0x01)
	struct FMulticastDelegate OnComponentSleep; // 0x524(0x01)
	char UnknownData_525[0x33]; // 0x525(0x33)
	struct UPrimitiveComponent* LODParentPrimitive; // 0x558(0x08)
	struct FPrimitiveComponentPostPhysicsTickFunction PostPhysicsComponentTick; // 0x560(0x50)
	struct UPrimitiveComponent* MergedCollisionComponentParent; // 0x5b0(0x08)
	char UnknownData_5B8[0x8]; // 0x5b8(0x08)

	void WakeRigidBody(struct FName BoneName); // Function Engine.PrimitiveComponent.WakeRigidBody // Native|Public|BlueprintCallable // @ game+0x2da69d0
	void WakeAllRigidBodies(); // Function Engine.PrimitiveComponent.WakeAllRigidBodies // Native|Public|BlueprintCallable // @ game+0x2da69b0
	void SetWalkableSlopeOverride(struct FWalkableSlopeOverride NewOverride); // Function Engine.PrimitiveComponent.SetWalkableSlopeOverride // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x2da58a0
	void SetTranslucentSortPriority(int32_t NewTranslucentSortPriority); // Function Engine.PrimitiveComponent.SetTranslucentSortPriority // Final|Native|Public|BlueprintCallable // @ game+0x2da5560
	void SetSimulatePhysics(bool bSimulate); // Function Engine.PrimitiveComponent.SetSimulatePhysics // Native|Public|BlueprintCallable // @ game+0x2da4c80
	void SetRenderInMainPass(bool bValue); // Function Engine.PrimitiveComponent.SetRenderInMainPass // Final|Native|Public|BlueprintCallable // @ game+0x2da4a40
	void SetRenderCustomDepth(bool bValue); // Function Engine.PrimitiveComponent.SetRenderCustomDepth // Final|Native|Public|BlueprintCallable // @ game+0x2da49b0
	void SetPhysMaterialOverride(struct UPhysicalMaterial* NewPhysMaterial); // Function Engine.PrimitiveComponent.SetPhysMaterialOverride // Native|Public|BlueprintCallable // @ game+0x2da3ef0
	void SetPhysicsMaxAngularVelocity(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocity // Final|Native|Public|BlueprintCallable // @ game+0x2da42f0
	void SetPhysicsLinearVelocity(struct FVector NewVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da41e0
	void SetPhysicsAngularVelocity(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da3f80
	void SetOwnerNoSee(bool bNewOwnerNoSee); // Function Engine.PrimitiveComponent.SetOwnerNoSee // Final|Native|Public|BlueprintCallable // @ game+0x2da3e60
	void SetOnlyOwnerSee(bool bNewOnlyOwnerSee); // Function Engine.PrimitiveComponent.SetOnlyOwnerSee // Final|Native|Public|BlueprintCallable // @ game+0x2da3d50
	void SetNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision); // Function Engine.PrimitiveComponent.SetNotifyRigidBodyCollision // Native|Public|BlueprintCallable // @ game+0x2da3cc0
	void SetMaterial(int32_t ElementIndex, struct UMaterialInterface* Material); // Function Engine.PrimitiveComponent.SetMaterial // Native|Public|BlueprintCallable // @ game+0x2da38e0
	void SetMassScale(struct FName BoneName, float InMassScale); // Function Engine.PrimitiveComponent.SetMassScale // Native|Public|BlueprintCallable // @ game+0x2da3790
	void SetMassOverrideInKg(struct FName BoneName, float MassInKg, bool bOverrideMass); // Function Engine.PrimitiveComponent.SetMassOverrideInKg // Native|Public|BlueprintCallable // @ game+0x2da3690
	void SetLockedAxis(char LockedAxis); // Function Engine.PrimitiveComponent.SetLockedAxis // Native|Public|BlueprintCallable // @ game+0x2da3580
	void SetLinearDamping(float InDamping); // Function Engine.PrimitiveComponent.SetLinearDamping // Native|Public|BlueprintCallable // @ game+0x2da2d40
	void SetGenerateOverlapEvents(bool bEnable); // Function Engine.PrimitiveComponent.SetGenerateOverlapEvents // Final|Native|Public|BlueprintCallable // @ game+0x2da24c0
	void SetEnableGravity(bool bGravityEnabled); // Function Engine.PrimitiveComponent.SetEnableGravity // Native|Public|BlueprintCallable // @ game+0x2da2170
	void SetCustomPrimitiveVector(int32_t Index, struct FVector Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveVector // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da1d50
	void SetCustomPrimitiveScalar(int32_t Index, float Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveScalar // Final|Native|Public|BlueprintCallable // @ game+0x2da1c80
	void SetCustomDepthStencilValue(int32_t Value); // Function Engine.PrimitiveComponent.SetCustomDepthStencilValue // Final|Native|Public|BlueprintCallable // @ game+0x2da1aa0
	void SetCullDistance(float NewCullDistance); // Function Engine.PrimitiveComponent.SetCullDistance // Final|Native|Public|BlueprintCallable // @ game+0x2da19a0
	void SetConstraintMode(char ConstraintMode); // Function Engine.PrimitiveComponent.SetConstraintMode // Native|Public|BlueprintCallable // @ game+0x2da1610
	void SetCollisionResponseToChannel(char Channel, char NewResponse); // Function Engine.PrimitiveComponent.SetCollisionResponseToChannel // Final|Native|Public|BlueprintCallable // @ game+0x2da1260
	void SetCollisionResponseToAllChannels(char NewResponse); // Function Engine.PrimitiveComponent.SetCollisionResponseToAllChannels // Final|Native|Public|BlueprintCallable // @ game+0x2da11e0
	void SetCollisionProfileName(struct FName InCollisionProfileName); // Function Engine.PrimitiveComponent.SetCollisionProfileName // Native|Public|BlueprintCallable // @ game+0x2da1150
	void SetCollisionObjectType(char Channel); // Function Engine.PrimitiveComponent.SetCollisionObjectType // Final|Native|Public|BlueprintCallable // @ game+0x2da10d0
	void SetCollisionEnabled(char NewType); // Function Engine.PrimitiveComponent.SetCollisionEnabled // Native|Public|BlueprintCallable // @ game+0x2da1050
	void SetCenterOfMass(struct FVector CenterOfMassOffset, struct FName BoneName); // Function Engine.PrimitiveComponent.SetCenterOfMass // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da0cb0
	void SetCastShadow(bool NewCastShadow); // Function Engine.PrimitiveComponent.SetCastShadow // Final|Native|Public|BlueprintCallable // @ game+0x2da0b00
	void SetAngularDamping(float InDamping); // Function Engine.PrimitiveComponent.SetAngularDamping // Native|Public|BlueprintCallable // @ game+0x2d9f8e0
	void SetAllPhysicsLinearVelocity(struct FVector NewVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d9f800
	void SetAllMassScale(float InMassScale); // Function Engine.PrimitiveComponent.SetAllMassScale // Native|Public|BlueprintCallable // @ game+0x2d9f3e0
	struct FVector ScaleByMomentOfInertia(struct FVector InputVector, struct FName BoneName); // Function Engine.PrimitiveComponent.ScaleByMomentOfInertia // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9ec60
	void PutRigidBodyToSleep(struct FName BoneName); // Function Engine.PrimitiveComponent.PutRigidBodyToSleep // Final|Native|Public|BlueprintCallable // @ game+0x2d9e630
	bool K2_LineTraceComponent(struct FVector TraceStart, struct FVector TraceEnd, bool bTraceComplex, bool bShowTrace, struct FVector HitLocation, struct FVector HitNormal, struct FName BoneName); // Function Engine.PrimitiveComponent.K2_LineTraceComponent // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2d9cb40
	bool IsOverlappingComponent(struct UPrimitiveComponent* OtherComp); // Function Engine.PrimitiveComponent.IsOverlappingComponent // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c750
	bool IsOverlappingActor(struct AActor* Other); // Function Engine.PrimitiveComponent.IsOverlappingActor // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c6c0
	bool IsGravityEnabled(); // Function Engine.PrimitiveComponent.IsGravityEnabled // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c4f0
	void IgnoreActorWhenMoving(struct AActor* Actor, bool bShouldIgnore); // Function Engine.PrimitiveComponent.IgnoreActorWhenMoving // Final|Native|Public|BlueprintCallable // @ game+0x2d9c0d0
	struct FWalkableSlopeOverride GetWalkableSlopeOverride(); // Function Engine.PrimitiveComponent.GetWalkableSlopeOverride // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9b900
	struct FVector GetPhysicsLinearVelocityAtPoint(struct FVector Point, struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocityAtPoint // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d995f0
	struct FVector GetPhysicsLinearVelocity(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d99550
	struct FVector GetPhysicsAngularVelocity(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocity // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d994b0
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*> InOverlappingComponents); // Function Engine.PrimitiveComponent.GetOverlappingComponents // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98df0
	void GetOverlappingActors(struct TArray<struct AActor*> OverlappingActors, struct UClass* ClassFilter); // Function Engine.PrimitiveComponent.GetOverlappingActors // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98cf0
	struct TArray<struct FOverlapInfo> GetOverlapInfos(); // Function Engine.PrimitiveComponent.GetOverlapInfos // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98ad0
	int32_t GetNumMaterials(); // Function Engine.PrimitiveComponent.GetNumMaterials // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98a10
	struct UMaterialInterface* GetMaterial(int32_t ElementIndex); // Function Engine.PrimitiveComponent.GetMaterial // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98540
	float GetMassScale(struct FName BoneName); // Function Engine.PrimitiveComponent.GetMassScale // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98480
	float GetMass(); // Function Engine.PrimitiveComponent.GetMass // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98440
	float GetLinearDamping(); // Function Engine.PrimitiveComponent.GetLinearDamping // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97e70
	struct FVector GetInertiaTensor(struct FName BoneName); // Function Engine.PrimitiveComponent.GetInertiaTensor // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97c30
	char GetCollisionResponseToChannel(char Channel); // Function Engine.PrimitiveComponent.GetCollisionResponseToChannel // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d973e0
	struct FName GetCollisionProfileName(); // Function Engine.PrimitiveComponent.GetCollisionProfileName // Final|Native|Public|BlueprintCallable // @ game+0x2d973a0
	char GetCollisionObjectType(); // Function Engine.PrimitiveComponent.GetCollisionObjectType // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97370
	float GetClosestPointOnCollision(struct FVector Point, struct FVector OutPointOnBody, struct FName BoneName); // Function Engine.PrimitiveComponent.GetClosestPointOnCollision // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97200
	struct FVector GetCenterOfMass(struct FName BoneName); // Function Engine.PrimitiveComponent.GetCenterOfMass // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d97160
	float GetAngularDamping(); // Function Engine.PrimitiveComponent.GetAngularDamping // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d96ec0
	struct UMaterialInstanceDynamic* CreateDynamicMaterialInstance(int32_t ElementIndex, struct UMaterialInterface* SourceMaterial); // Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance // Native|Public|BlueprintCallable // @ game+0x2d94c20
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(int32_t ElementIndex, struct UMaterialInterface* Parent); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial // Native|Public|BlueprintCallable // @ game+0x2d94b20
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamic(int32_t ElementIndex); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic // Native|Public|BlueprintCallable // @ game+0x2d94a80
	struct TArray<struct AActor*> CopyArrayOfMoveIgnoreActors(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors // Final|Native|Public|BlueprintCallable // @ game+0x2d949e0
	void ClearMoveIgnoreActors(int32_t InSlack); // Function Engine.PrimitiveComponent.ClearMoveIgnoreActors // Final|Native|Public|BlueprintCallable // @ game+0x2d945c0
	bool CanCharacterStepUp(struct APawn* Pawn); // Function Engine.PrimitiveComponent.CanCharacterStepUp // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d941e0
	void AddTorque(struct FVector Torque, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddTorque // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d93e70
	void AddRadialImpulse(struct FVector Origin, float Radius, float Strength, char Falloff, bool bVelChange); // Function Engine.PrimitiveComponent.AddRadialImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d93ab0
	void AddRadialForce(struct FVector Origin, float Radius, float Strength, char Falloff, bool bAccelChange); // Function Engine.PrimitiveComponent.AddRadialForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d938f0
	void AddImpulseAtLocation(struct FVector Impulse, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddImpulseAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d93520
	void AddImpulse(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d93400
	void AddForceAtLocation(struct FVector Force, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddForceAtLocation // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d93140
	void AddForce(struct FVector Force, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddForce // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d93020
	void AddAngularImpulse(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulse // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d92820
};

// Class Engine.GameState
// Size: 0x420 (Inherited: 0x3c8)
struct AGameState : AInfo {
	struct UClass* GameModeClass; // 0x3c8(0x08)
	struct AGameMode* AuthorityGameMode; // 0x3d0(0x08)
	struct UClass* SpectatorClass; // 0x3d8(0x08)
	struct FName MatchState; // 0x3e0(0x08)
	struct FName PreviousMatchState; // 0x3e8(0x08)
	int32_t ElapsedTime; // 0x3f0(0x04)
	char UnknownData_3F4[0x4]; // 0x3f4(0x04)
	struct TArray<struct APlayerState*> PlayerArray; // 0x3f8(0x10)
	float ReplicatedWorldTimeSeconds; // 0x408(0x04)
	float ServerWorldTimeSecondsDelta; // 0x40c(0x04)
	float ServerWorldTimeSecondsUpdateFrequency; // 0x410(0x04)
	char UnknownData_414[0xc]; // 0x414(0x0c)

	void OnRep_SpectatorClass(); // Function Engine.GameState.OnRep_SpectatorClass // Native|Public // @ game+0x2d9db10
	void OnRep_ReplicatedWorldTimeSeconds(); // Function Engine.GameState.OnRep_ReplicatedWorldTimeSeconds // Native|Protected // @ game+0x2d9da50
	void OnRep_MatchState(); // Function Engine.GameState.OnRep_MatchState // Native|Public // @ game+0x2d9d9b0
	void OnRep_GameModeClass(); // Function Engine.GameState.OnRep_GameModeClass // Native|Public // @ game+0x2d9d970
	void OnRep_ElapsedTime(); // Function Engine.GameState.OnRep_ElapsedTime // Native|Public // @ game+0x2d9d950
	float GetServerWorldTimeSeconds(); // Function Engine.GameState.GetServerWorldTimeSeconds // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9abb0
};

// Class Engine.GameUserSettings
// Size: 0x78 (Inherited: 0x28)
struct UGameUserSettings : UObject {
	bool bUseVSync; // 0x28(0x01)
	char UnknownData_29[0x1f]; // 0x29(0x1f)
	uint32_t ResolutionSizeX; // 0x48(0x04)
	uint32_t ResolutionSizeY; // 0x4c(0x04)
	uint32_t LastUserConfirmedResolutionSizeX; // 0x50(0x04)
	uint32_t LastUserConfirmedResolutionSizeY; // 0x54(0x04)
	int32_t WindowPosX; // 0x58(0x04)
	int32_t WindowPosY; // 0x5c(0x04)
	bool bUseDesktopResolutionForFullscreen; // 0x60(0x01)
	char UnknownData_61[0x3]; // 0x61(0x03)
	int32_t FullscreenMode; // 0x64(0x04)
	int32_t LastConfirmedFullscreenMode; // 0x68(0x04)
	uint32_t Version; // 0x6c(0x04)
	int32_t AudioQualityLevel; // 0x70(0x04)
	char UnknownData_74[0x4]; // 0x74(0x04)
};

// Class Engine.ScriptViewportClient
// Size: 0x30 (Inherited: 0x28)
struct UScriptViewportClient : UObject {
	char UnknownData_28[0x8]; // 0x28(0x08)
};

// Class Engine.GameViewportClient
// Size: 0x250 (Inherited: 0x30)
struct UGameViewportClient : UScriptViewportClient {
	char UnknownData_30[0x8]; // 0x30(0x08)
	struct UConsole* ViewportConsole; // 0x38(0x08)
	struct TArray<struct FDebugDisplayProperty> DebugProperties; // 0x40(0x10)
	char UnknownData_50[0x30]; // 0x50(0x30)
	struct UWorld* World; // 0x80(0x08)
	struct UGameInstance* GameInstance; // 0x88(0x08)
	char UnknownData_90[0x1c0]; // 0x90(0x1c0)

	void SSSwapControllers(); // Function Engine.GameViewportClient.SSSwapControllers // Exec|Native|Public // @ game+0x3163450
	void ShowTitleSafeArea(); // Function Engine.GameViewportClient.ShowTitleSafeArea // Exec|Native|Public // @ game+0x3163500
	void SetConsoleTarget(int32_t PlayerIndex); // Function Engine.GameViewportClient.SetConsoleTarget // Exec|Native|Public // @ game+0x3163470
};

// Class Engine.PlayerState
// Size: 0x450 (Inherited: 0x3c8)
struct APlayerState : AInfo {
	float Score; // 0x3c8(0x04)
	char Ping; // 0x3cc(0x01)
	char UnknownData_3CD[0x3]; // 0x3cd(0x03)
	struct FString PlayerName; // 0x3d0(0x10)
	char UnknownData_3E0[0x10]; // 0x3e0(0x10)
	int32_t PlayerId; // 0x3f0(0x04)
	char bIsSpectator : 1; // 0x3f4(0x01)
	char bOnlySpectator : 1; // 0x3f4(0x01)
	char bIsABot : 1; // 0x3f4(0x01)
	char UnknownData_3F4_3 : 1; // 0x3f4(0x01)
	char bIsInactive : 1; // 0x3f4(0x01)
	char bFromPreviousLevel : 1; // 0x3f4(0x01)
	char UnknownData_3F4_6 : 2; // 0x3f4(0x01)
	char UnknownData_3F5[0x3]; // 0x3f5(0x03)
	int32_t StartTime; // 0x3f8(0x04)
	char UnknownData_3FC[0x4]; // 0x3fc(0x04)
	struct UClass* EngineMessageClass; // 0x400(0x08)
	char UnknownData_408[0x18]; // 0x408(0x18)
	struct FUniqueNetIdRepl UniqueId; // 0x420(0x18)
	char UnknownData_438[0x18]; // 0x438(0x18)

	void OnRep_UniqueId(); // Function Engine.PlayerState.OnRep_UniqueId // Native|Public // @ game+0x2d9db30
};

// Class Engine.Controller
// Size: 0x428 (Inherited: 0x3c8)
struct AController : AActor {
	char UnknownData_3C8[0x8]; // 0x3c8(0x08)
	struct APawn* Pawn; // 0x3d0(0x08)
	char UnknownData_3D8[0x8]; // 0x3d8(0x08)
	struct ACharacter* Character; // 0x3e0(0x08)
	struct APlayerState* PlayerState; // 0x3e8(0x08)
	struct USceneComponent* TransformComponent; // 0x3f0(0x08)
	struct FRotator ControlRotation; // 0x3f8(0x0c)
	char bAttachToPawn : 1; // 0x404(0x01)
	char UnknownData_404_1 : 7; // 0x404(0x01)
	char UnknownData_405[0xb]; // 0x405(0x0b)
	struct FName StateName; // 0x410(0x08)
	struct FMulticastDelegate OnInstigatedAnyDamage; // 0x418(0x10)

	void UnPossess(); // Function Engine.Controller.UnPossess // Native|Public|BlueprintCallable // @ game+0x2ca0990
	void StopMovement(); // Function Engine.Controller.StopMovement // Native|Public|BlueprintCallable // @ game+0x2ca0760
	void SetInitialLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation); // Function Engine.Controller.SetInitialLocationAndRotation // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c9f030
	void SetControlRotation(struct FRotator NewRotation); // Function Engine.Controller.SetControlRotation // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2c9ea10
	void ReceiveInstigatedAnyDamage(float Damage, struct UDamageType* DamageType, struct AActor* DamagedActor, struct AActor* DamageCauser); // Function Engine.Controller.ReceiveInstigatedAnyDamage // BlueprintAuthorityOnly|Event|Protected|BlueprintEvent // @ game+0x1848130
	void Possess(struct APawn* InPawn); // Function Engine.Controller.Possess // BlueprintAuthorityOnly|Native|Public|BlueprintCallable // @ game+0x2c9c800
	void OnRep_PlayerState(); // Function Engine.Controller.OnRep_PlayerState // Native|Public // @ game+0x2c9bd70
	void OnRep_Pawn(); // Function Engine.Controller.OnRep_Pawn // Native|Public // @ game+0x2c9bd50
	bool LineOfSightTo(struct AActor* Other, struct FVector ViewPoint, bool bAlternateChecks); // Function Engine.Controller.LineOfSightTo // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c9b900
	struct APawn* K2_GetPawn(); // Function Engine.Controller.K2_GetPawn // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c99dc0
	bool IsLocalPlayerController(); // Function Engine.Controller.IsLocalPlayerController // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97bf0
	bool IsLocalController(); // Function Engine.Controller.IsLocalController // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97bc0
	struct AActor* GetViewTarget(); // Function Engine.Controller.GetViewTarget // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c976a0
	struct FRotator GetDesiredRotation(); // Function Engine.Controller.GetDesiredRotation // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94f80
	struct FRotator GetControlRotation(); // Function Engine.Controller.GetControlRotation // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94a20
	void ClientSetRotation(struct FRotator NewRotation, bool bResetCamera); // Function Engine.Controller.ClientSetRotation // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x2c923d0
	void ClientSetLocation(struct FVector NewLocation, struct FRotator NewRotation); // Function Engine.Controller.ClientSetLocation // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x2c922f0
	struct APlayerController* CastToPlayerController(); // Function Engine.Controller.CastToPlayerController // Final|Native|Public|BlueprintCallable // @ game+0x2c90730
};

// Class Engine.PlayerController
// Size: 0x770 (Inherited: 0x428)
struct APlayerController : AController {
	struct UPlayer* Player; // 0x428(0x08)
	char UnknownData_430[0x8]; // 0x430(0x08)
	struct APawn* AcknowledgedPawn; // 0x438(0x08)
	struct UInterpTrackInstDirector* ControllingDirTrackInst; // 0x440(0x08)
	char UnknownData_448[0x8]; // 0x448(0x08)
	struct AHUD* MyHUD; // 0x450(0x08)
	struct APlayerCameraManager* PlayerCameraManager; // 0x458(0x08)
	struct UClass* PlayerCameraManagerClass; // 0x460(0x08)
	bool bAutoManageActiveCameraTarget; // 0x468(0x01)
	char UnknownData_469[0x3]; // 0x469(0x03)
	struct FRotator TargetViewRotation; // 0x46c(0x0c)
	char UnknownData_478[0x10]; // 0x478(0x10)
	struct TArray<struct AActor*> HiddenActors; // 0x488(0x10)
	float LastSpectatorStateSynchTime; // 0x498(0x04)
	struct FVector LastSpectatorSyncLocation; // 0x49c(0x0c)
	struct FRotator LastSpectatorSyncRotation; // 0x4a8(0x0c)
	int32_t ClientCap; // 0x4b4(0x04)
	struct UCheatManager* CheatManager; // 0x4b8(0x08)
	struct UClass* CheatClass; // 0x4c0(0x08)
	struct UPlayerInput* PlayerInput; // 0x4c8(0x08)
	struct TArray<struct FActiveForceFeedbackEffect> ActiveForceFeedbackEffects; // 0x4d0(0x10)
	char UnknownData_4E0[0x90]; // 0x4e0(0x90)
	char UnknownData_570_0 : 2; // 0x570(0x01)
	char bPlayerIsWaiting : 1; // 0x570(0x01)
	char UnknownData_570_3 : 5; // 0x570(0x01)
	char UnknownData_571[0x3]; // 0x571(0x03)
	char NetPlayerIndex; // 0x574(0x01)
	bool bHasVoiceHandshakeCompleted; // 0x575(0x01)
	char UnknownData_576[0x2]; // 0x576(0x02)
	struct UNetConnection* PendingSwapConnection; // 0x578(0x08)
	struct UNetConnection* NetConnection; // 0x580(0x08)
	char UnknownData_588[0xc]; // 0x588(0x0c)
	float InputYawScale; // 0x594(0x04)
	float InputPitchScale; // 0x598(0x04)
	float InputRollScale; // 0x59c(0x04)
	char bShowMouseCursor : 1; // 0x5a0(0x01)
	char bEnableClickEvents : 1; // 0x5a0(0x01)
	char bEnableTouchEvents : 1; // 0x5a0(0x01)
	char bEnableMouseOverEvents : 1; // 0x5a0(0x01)
	char bEnableTouchOverEvents : 1; // 0x5a0(0x01)
	char bForceFeedbackEnabled : 1; // 0x5a0(0x01)
	char UnknownData_5A0_6 : 2; // 0x5a0(0x01)
	char UnknownData_5A1[0x3]; // 0x5a1(0x03)
	char DefaultMouseCursor; // 0x5a4(0x01)
	char CurrentMouseCursor; // 0x5a5(0x01)
	char DefaultClickTraceChannel; // 0x5a6(0x01)
	char CurrentClickTraceChannel; // 0x5a7(0x01)
	float HitResultTraceDistance; // 0x5a8(0x04)
	float ForceFeedbackIntensity; // 0x5ac(0x04)
	char UnknownData_5B0[0x88]; // 0x5b0(0x88)
	struct UInputComponent* InactiveStateInputComponent; // 0x638(0x08)
	char UnknownData_640[0x20]; // 0x640(0x20)
	struct UTouchInterface* CurrentTouchInterface; // 0x660(0x08)
	char UnknownData_668[0x30]; // 0x668(0x30)
	struct ASpectatorPawn* SpectatorPawn; // 0x698(0x08)
	struct FVector SpawnLocation; // 0x6a0(0x0c)
	char UnknownData_6AC[0x4]; // 0x6ac(0x04)
	struct TMap<struct ULevel*, struct UInputComponent*> LevelInputComponents; // 0x6b0(0x50)
	char UnknownData_700[0x14]; // 0x700(0x14)
	bool bIsLocalPlayerController; // 0x714(0x01)
	char UnknownData_715[0x1]; // 0x715(0x01)
	uint16_t SeamlessTravelCount; // 0x716(0x02)
	uint16_t LastCompletedSeamlessTravelCount; // 0x718(0x02)
	bool bInCinematicMode; // 0x71a(0x01)
	char UnknownData_71B[0x55]; // 0x71b(0x55)

	bool WasInputKeyJustReleased(struct FKey Key); // Function Engine.PlayerController.WasInputKeyJustReleased // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ca0d40
	bool WasInputKeyJustPressed(struct FKey Key); // Function Engine.PlayerController.WasInputKeyJustPressed // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ca0c40
	void ToggleSpeaking(bool bInSpeaking); // Function Engine.PlayerController.ToggleSpeaking // Exec|Native|Public // @ game+0x2ca0870
	void SwitchLevel(struct FString URL); // Function Engine.PlayerController.SwitchLevel // Exec|Native|Public // @ game+0x2ca0780
	void StopHapticEffect(char Hand); // Function Engine.PlayerController.StopHapticEffect // Final|Native|Public|BlueprintCallable // @ game+0x2ca06e0
	void StartFire(char FireModeNum); // Function Engine.PlayerController.StartFire // Exec|Native|Public // @ game+0x2ca02b0
	void SetVirtualJoystickVisibility(bool bVisible); // Function Engine.PlayerController.SetVirtualJoystickVisibility // Native|Public|BlueprintCallable // @ game+0x2c9fbd0
	void SetViewTargetWithBlend(struct AActor* NewViewTarget, float BlendTime, char BlendFunc, float BlendExp, bool bLockOutgoing); // Function Engine.PlayerController.SetViewTargetWithBlend // Native|Public|BlueprintCallable // @ game+0x2c9fa50
	void SetName(struct FString S); // Function Engine.PlayerController.SetName // Exec|Native|Public // @ game+0x2c9f3d0
	void SetIgnoreMoveInput(bool bNewMoveInput); // Function Engine.PlayerController.SetIgnoreMoveInput // Native|Public|BlueprintCallable // @ game+0x2c9ef10
	void SetIgnoreLookInput(bool bNewLookInput); // Function Engine.PlayerController.SetIgnoreLookInput // Native|Public|BlueprintCallable // @ game+0x2c9ee80
	void SetHapticsByValue(float Frequency, float Amplitude, char Hand); // Function Engine.PlayerController.SetHapticsByValue // Final|Native|Public|BlueprintCallable // @ game+0x2c9eca0
	void SetCinematicMode(bool bInCinematicMode, bool bHidePlayer, bool bAffectsHUD, bool bAffectsMovement, bool bAffectsTurning); // Function Engine.PlayerController.SetCinematicMode // Native|Public|BlueprintCallable // @ game+0x2c9e7c0
	void SetAudioListenerOverride(struct USceneComponent* AttachToComponent, struct FVector Location, struct FRotator Rotation); // Function Engine.PlayerController.SetAudioListenerOverride // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9e520
	void ServerViewSelf(struct FViewTargetTransitionParams TransitionParams); // Function Engine.PlayerController.ServerViewSelf // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x2c9dd90
	void ServerViewPrevPlayer(); // Function Engine.PlayerController.ServerViewPrevPlayer // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x2c9dd40
	void ServerViewNextPlayer(); // Function Engine.PlayerController.ServerViewNextPlayer // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x2c9dcf0
	void ServerVerifyViewTarget(); // Function Engine.PlayerController.ServerVerifyViewTarget // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x2c9dca0
	void ServerUpdateCamera(struct FVector_NetQuantize CamLoc, int32_t CamPitchAndYaw); // Function Engine.PlayerController.ServerUpdateCamera // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x2c9db80
	void ServerUnmutePlayer(struct FUniqueNetIdRepl PlayerId); // Function Engine.PlayerController.ServerUnmutePlayer // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x2c9da30
	void ServerToggleAILogging(); // Function Engine.PlayerController.ServerToggleAILogging // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x2c9d9e0
	void ServerShortTimeout(); // Function Engine.PlayerController.ServerShortTimeout // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x2c9d990
	void ServerSetSpectatorWaiting(bool bWaiting); // Function Engine.PlayerController.ServerSetSpectatorWaiting // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x2c9d8d0
	void ServerSetSpectatorLocation(struct FVector NewLoc, struct FRotator NewRot); // Function Engine.PlayerController.ServerSetSpectatorLocation // Net|Native|Event|Public|NetServer|HasDefaults|NetValidate // @ game+0x2c9d7a0
	void ServerRestartPlayer(); // Function Engine.PlayerController.ServerRestartPlayer // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x2c9d750
	void ServerPause(); // Function Engine.PlayerController.ServerPause // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x2c9d700
	void ServerNotifyLoadedWorld(struct FName WorldPackageName); // Function Engine.PlayerController.ServerNotifyLoadedWorld // Final|Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x2c9d650
	void ServerMutePlayer(struct FUniqueNetIdRepl PlayerId); // Function Engine.PlayerController.ServerMutePlayer // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x2c9d500
	void ServerCheckClientPossessionReliable(); // Function Engine.PlayerController.ServerCheckClientPossessionReliable // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x2c9d4b0
	void ServerCheckClientPossession(); // Function Engine.PlayerController.ServerCheckClientPossession // Net|Native|Event|Public|NetServer|NetValidate // @ game+0x2c9d460
	void ServerChangeName(struct FString S); // Function Engine.PlayerController.ServerChangeName // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x2c9d390
	void ServerCamera(struct FName NewMode); // Function Engine.PlayerController.ServerCamera // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x2c9d2d0
	void ServerAcknowledgePossession(struct APawn* P); // Function Engine.PlayerController.ServerAcknowledgePossession // Net|NetReliableNative|Event|Public|NetServer|NetValidate // @ game+0x2c9d210
	void SendToConsole(struct FString Command); // Function Engine.PlayerController.SendToConsole // Exec|Native|Public // @ game+0x2c9d160
	void SendPlayerName(int32_t Id, struct FString Name); // Function Engine.PlayerController.SendPlayerName // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c9d070
	void RestartLevel(); // Function Engine.PlayerController.RestartLevel // Exec|Native|Public // @ game+0x2c9d050
	void ResetIgnoreMoveInput(); // Function Engine.PlayerController.ResetIgnoreMoveInput // Native|Public|BlueprintCallable // @ game+0x2c9d010
	void ResetIgnoreLookInput(); // Function Engine.PlayerController.ResetIgnoreLookInput // Native|Public|BlueprintCallable // @ game+0x2c9cff0
	void ResetIgnoreInputFlags(); // Function Engine.PlayerController.ResetIgnoreInputFlags // Native|Public|BlueprintCallable // @ game+0x2c9cfd0
	bool ProjectWorldLocationToScreen(struct FVector WorldLocation, struct FVector2D ScreenLocation); // Function Engine.PlayerController.ProjectWorldLocationToScreen // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c9c890
	void PlayHapticEffect(struct UHapticFeedbackEffect* HapticEffect, char Hand, float Scale); // Function Engine.PlayerController.PlayHapticEffect // Final|Native|Public|BlueprintCallable // @ game+0x2c9c6f0
	void PlayDynamicForceFeedback(float Intensity, float Duration, bool bAffectsLeftLarge, bool bAffectsLeftSmall, bool bAffectsRightLarge, bool bAffectsRightSmall, char Action, struct FLatentActionInfo LatentInfo); // Function Engine.PlayerController.PlayDynamicForceFeedback // Final|Native|Public|BlueprintCallable // @ game+0x2c9c460
	void Pause(); // Function Engine.PlayerController.Pause // Exec|Native|Public // @ game+0x2c9bf30
	void OnServerStartedVisualLogger(bool bIsLogging); // Function Engine.PlayerController.OnServerStartedVisualLogger // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c9bea0
	void LocalTravel(struct FString URL); // Function Engine.PlayerController.LocalTravel // Exec|Native|Public // @ game+0x2c9ba20
	bool IsSeamlessTravelInProgress(); // Function Engine.PlayerController.IsSeamlessTravelInProgress // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97d70
	bool IsPossessingServerAcknowledgedPawn(); // Function Engine.PlayerController.IsPossessingServerAcknowledgedPawn // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2c97d10
	bool IsMoveInputIgnored(); // Function Engine.PlayerController.IsMoveInputIgnored // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97c50
	bool IsLookInputIgnored(); // Function Engine.PlayerController.IsLookInputIgnored // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97c20
	bool IsInputKeyDown(struct FKey Key); // Function Engine.PlayerController.IsInputKeyDown // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97ac0
	void GetViewportSize(int32_t SizeX, int32_t SizeY); // Function Engine.PlayerController.GetViewportSize // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c976d0
	struct ASpectatorPawn* GetSpectatorPawn(); // Function Engine.PlayerController.GetSpectatorPawn // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97160
	bool GetMousePosition(float LocationX, float LocationY); // Function Engine.PlayerController.GetMousePosition // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96940
	struct FVector GetInputVectorKeyState(struct FKey Key); // Function Engine.PlayerController.GetInputVectorKeyState // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c966f0
	void GetInputTouchState(char FingerIndex, float LocationX, float LocationY, bool bIsCurrentlyPressed); // Function Engine.PlayerController.GetInputTouchState // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96450
	void GetInputMouseDelta(float DeltaX, float DeltaY); // Function Engine.PlayerController.GetInputMouseDelta // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96370
	void GetInputMotionState(struct FVector Tilt, struct FVector RotationRate, struct FVector Gravity, struct FVector Acceleration); // Function Engine.PlayerController.GetInputMotionState // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c961e0
	float GetInputKeyTimeDown(struct FKey Key); // Function Engine.PlayerController.GetInputKeyTimeDown // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c960e0
	void GetInputAnalogStickState(char WhichStick, float StickX, float StickY); // Function Engine.PlayerController.GetInputAnalogStickState // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c95e20
	float GetInputAnalogKeyState(struct FKey Key); // Function Engine.PlayerController.GetInputAnalogKeyState // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c95d20
	struct AHUD* GetHUD(); // Function Engine.PlayerController.GetHUD // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c95250
	bool GetHitResultUnderFingerForObjects(char FingerIndex, struct TArray<char> ObjectTypes, bool bTraceComplex, struct FHitResult HitResult); // Function Engine.PlayerController.GetHitResultUnderFingerForObjects // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c95a10
	bool GetHitResultUnderFingerByChannel(char FingerIndex, char TraceChannel, bool bTraceComplex, struct FHitResult HitResult); // Function Engine.PlayerController.GetHitResultUnderFingerByChannel // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c95870
	bool GetHitResultUnderFinger(char FingerIndex, char TraceChannel, bool bTraceComplex, struct FHitResult HitResult); // Function Engine.PlayerController.GetHitResultUnderFinger // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c956d0
	bool GetHitResultUnderCursorForObjects(struct TArray<char> ObjectTypes, bool bTraceComplex, struct FHitResult HitResult); // Function Engine.PlayerController.GetHitResultUnderCursorForObjects // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c95540
	bool GetHitResultUnderCursorByChannel(char TraceChannel, bool bTraceComplex, struct FHitResult HitResult); // Function Engine.PlayerController.GetHitResultUnderCursorByChannel // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c953e0
	bool GetHitResultUnderCursor(char TraceChannel, bool bTraceComplex, struct FHitResult HitResult); // Function Engine.PlayerController.GetHitResultUnderCursor // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c95280
	struct FVector GetFocalLocation(); // Function Engine.PlayerController.GetFocalLocation // Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c951d0
	void FOV(float NewFOV); // Function Engine.PlayerController.FOV // Exec|Native|Public // @ game+0x2c93a90
	void EnableCheats(); // Function Engine.PlayerController.EnableCheats // Exec|Native|Public // @ game+0x2c939e0
	bool DeprojectScreenPositionToWorld(float ScreenX, float ScreenY, struct FVector WorldLocation, struct FVector WorldDirection); // Function Engine.PlayerController.DeprojectScreenPositionToWorld // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c935d0
	bool DeprojectMousePositionToWorld(struct FVector WorldLocation, struct FVector WorldDirection); // Function Engine.PlayerController.DeprojectMousePositionToWorld // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c934d0
	void ConsoleKey(struct FKey Key); // Function Engine.PlayerController.ConsoleKey // Exec|Native|Public // @ game+0x2c93290
	void ClientWasKicked(struct FText KickReason); // Function Engine.PlayerController.ClientWasKicked // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c93160
	void ClientVoiceHandshakeComplete(); // Function Engine.PlayerController.ClientVoiceHandshakeComplete // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c93140
	void ClientUpdateLevelStreamingStatusBatched(struct FString PackageBasePath, struct TArray<struct FLevelStreamingStatusUpdateInfo> LevelStreamingStatusUpdateInfo); // Function Engine.PlayerController.ClientUpdateLevelStreamingStatusBatched // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c93010
	void ClientUpdateLevelStreamingStatus(struct FName PackageName, bool bNewShouldBeLoaded, bool bNewShouldBeVisible, bool bNewShouldBlockOnLoad, int32_t LODIndex); // Function Engine.PlayerController.ClientUpdateLevelStreamingStatus // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c92e60
	void ClientUnmutePlayer(struct FUniqueNetIdRepl PlayerId); // Function Engine.PlayerController.ClientUnmutePlayer // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c92d70
	void ClientTravelInternal(struct FString URL, char TravelType, bool bSeamless, struct FGuid MapPackageGuid); // Function Engine.PlayerController.ClientTravelInternal // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x2c92bf0
	void ClientTravel(struct FString URL, char TravelType, bool bSeamless, struct FGuid MapPackageGuid); // Function Engine.PlayerController.ClientTravel // Final|Native|Public|HasDefaults // @ game+0x2c92a70
	void ClientTeamMessage(struct APlayerState* SenderPlayerState, struct FString S, struct FName Type, float MsgLifeTime); // Function Engine.PlayerController.ClientTeamMessage // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c92900
	void ClientStopForceFeedback(struct UForceFeedbackEffect* ForceFeedbackEffect, struct FName Tag); // Function Engine.PlayerController.ClientStopForceFeedback // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x2c92830
	void ClientStopCameraShake(struct UClass* Shake); // Function Engine.PlayerController.ClientStopCameraShake // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x2c927a0
	void ClientStopCameraAnim(struct UCameraAnim* AnimToStop); // Function Engine.PlayerController.ClientStopCameraAnim // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c92710
	void ClientStartOnlineSession(); // Function Engine.PlayerController.ClientStartOnlineSession // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c926f0
	void ClientSpawnCameraLensEffect(struct UClass* LensEffectEmitterClass); // Function Engine.PlayerController.ClientSpawnCameraLensEffect // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0x2c92660
	void ClientSetViewTarget(struct AActor* A, struct FViewTargetTransitionParams TransitionParams); // Function Engine.PlayerController.ClientSetViewTarget // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c92540
	void ClientSetSpectatorWaiting(bool bWaiting); // Function Engine.PlayerController.ClientSetSpectatorWaiting // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c924b0
	void ClientSetHUD(struct UClass* NewHUDClass); // Function Engine.PlayerController.ClientSetHUD // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x2c92260
	void ClientSetForceMipLevelsToBeResident(struct UMaterialInterface* Material, float ForceDuration, int32_t CinematicTextureGroups); // Function Engine.PlayerController.ClientSetForceMipLevelsToBeResident // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c92160
	void ClientSetCinematicMode(bool bInCinematicMode, bool bAffectsMovement, bool bAffectsTurning, bool bAffectsHUD); // Function Engine.PlayerController.ClientSetCinematicMode // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c91ff0
	void ClientSetCameraMode(struct FName NewCamMode); // Function Engine.PlayerController.ClientSetCameraMode // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c91f60
	void ClientSetCameraFade(bool bEnableFading, struct FColor FadeColor, struct FVector2D FadeAlpha, float FadeTime, bool bFadeAudio); // Function Engine.PlayerController.ClientSetCameraFade // Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x2c91dd0
	void ClientSetBlockOnAsyncLoading(); // Function Engine.PlayerController.ClientSetBlockOnAsyncLoading // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c91db0
	void ClientSeamlessTravelComplete(); // Function Engine.PlayerController.ClientSeamlessTravelComplete // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c91d90
	void ClientReturnToMainMenu(struct FString ReturnReason); // Function Engine.PlayerController.ClientReturnToMainMenu // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c91ce0
	void ClientRetryClientRestart(struct APawn* NewPawn); // Function Engine.PlayerController.ClientRetryClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c91c50
	void ClientRestart(struct APawn* NewPawn); // Function Engine.PlayerController.ClientRestart // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c91bc0
	void ClientReset(); // Function Engine.PlayerController.ClientReset // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c91ba0
	void ClientRepObjRef(struct UObject* Object); // Function Engine.PlayerController.ClientRepObjRef // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c91b10
	void ClientReceiveLocalizedMessage(struct UClass* Message, int32_t Switch, struct APlayerState* RelatedPlayerState_2, struct APlayerState* RelatedPlayerState_3, struct UObject* OptionalObject); // Function Engine.PlayerController.ClientReceiveLocalizedMessage // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c91990
	void ClientPrestreamTextures(struct AActor* ForcedActor, float ForceDuration, bool bEnableStreaming, int32_t CinematicTextureGroups); // Function Engine.PlayerController.ClientPrestreamTextures // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c91840
	void ClientPrepareMapChange(struct FName LevelName, bool bFirst, bool bLast); // Function Engine.PlayerController.ClientPrepareMapChange // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c91730
	void ClientPlaySoundAtLocation(struct USoundBase* Sound, struct FVector Location, float VolumeMultiplier, float PitchMultiplier); // Function Engine.PlayerController.ClientPlaySoundAtLocation // Net|Native|Event|Public|HasDefaults|NetClient // @ game+0x2c915e0
	void ClientPlaySound(struct USoundBase* Sound, float VolumeMultiplier, float PitchMultiplier); // Function Engine.PlayerController.ClientPlaySound // Net|Native|Event|Public|NetClient // @ game+0x2c914e0
	void ClientPlayForceFeedback(struct UForceFeedbackEffect* ForceFeedbackEffect, bool bLooping, struct FName Tag); // Function Engine.PlayerController.ClientPlayForceFeedback // Net|Native|Event|Public|NetClient|BlueprintCallable // @ game+0x2c913d0
	void ClientPlayCameraShake(struct UClass* Shake, float Scale, char PlaySpace, struct FRotator UserPlaySpaceRot); // Function Engine.PlayerController.ClientPlayCameraShake // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0x2c91270
	void ClientPlayCameraAnim(struct UCameraAnim* AnimToPlay, float Scale, float Rate, float BlendInTime, float BlendOutTime, bool bLoop, bool bRandomStartTime, char Space, struct FRotator CustomPlaySpace); // Function Engine.PlayerController.ClientPlayCameraAnim // Net|Native|Event|Public|HasDefaults|NetClient|BlueprintCallable // @ game+0x2c90fd0
	void ClientMutePlayer(struct FUniqueNetIdRepl PlayerId); // Function Engine.PlayerController.ClientMutePlayer // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c90ee0
	void ClientMessage(struct FString S, struct FName Type, float MsgLifeTime); // Function Engine.PlayerController.ClientMessage // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c90db0
	void ClientIgnoreMoveInput(bool bIgnore); // Function Engine.PlayerController.ClientIgnoreMoveInput // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c90d20
	void ClientIgnoreLookInput(bool bIgnore); // Function Engine.PlayerController.ClientIgnoreLookInput // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c90c90
	void ClientGotoState(struct FName NewState); // Function Engine.PlayerController.ClientGotoState // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c90c00
	void ClientGameEnded(struct AActor* EndGameFocus, bool bIsWinner); // Function Engine.PlayerController.ClientGameEnded // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c90b30
	void ClientForceGarbageCollection(); // Function Engine.PlayerController.ClientForceGarbageCollection // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c90b10
	void ClientFlushLevelStreaming(); // Function Engine.PlayerController.ClientFlushLevelStreaming // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c90af0
	void ClientEndOnlineSession(); // Function Engine.PlayerController.ClientEndOnlineSession // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c90ad0
	void ClientEnableNetworkVoice(bool bEnable); // Function Engine.PlayerController.ClientEnableNetworkVoice // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c90a40
	void ClientCommitMapChange(); // Function Engine.PlayerController.ClientCommitMapChange // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c90a20
	void ClientClearCameraLensEffects(); // Function Engine.PlayerController.ClientClearCameraLensEffects // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x2c90a00
	void ClientCapBandwidth(int32_t Cap); // Function Engine.PlayerController.ClientCapBandwidth // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c90970
	void ClientCancelPendingMapChange(); // Function Engine.PlayerController.ClientCancelPendingMapChange // Net|NetReliableNative|Event|Public|NetClient // @ game+0x2c90950
	void ClientBlendOutCameraShake(struct UClass* Shake); // Function Engine.PlayerController.ClientBlendOutCameraShake // Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable // @ game+0x2c908c0
	void ClientAddTextureStreamingLoc(struct FVector InLoc, float Duration, bool bOverrideLocation); // Function Engine.PlayerController.ClientAddTextureStreamingLoc // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x2c907a0
	void ClearAudioListenerOverride(); // Function Engine.PlayerController.ClearAudioListenerOverride // Final|Native|Public|BlueprintCallable // @ game+0x2c90760
	void Camera(struct FName NewMode); // Function Engine.PlayerController.Camera // Exec|Native|Public // @ game+0x2c906a0
	void AddYawInput(float Val); // Function Engine.PlayerController.AddYawInput // Native|Public|BlueprintCallable // @ game+0x2c90270
	void AddRollInput(float Val); // Function Engine.PlayerController.AddRollInput // Native|Public|BlueprintCallable // @ game+0x2c8ffb0
	void AddPitchInput(float Val); // Function Engine.PlayerController.AddPitchInput // Native|Public|BlueprintCallable // @ game+0x2c8ff30
	void ActivateTouchInterface(struct UTouchInterface* NewTouchInterface); // Function Engine.PlayerController.ActivateTouchInterface // Native|Public|BlueprintCallable // @ game+0x2c8f980
};

// Class Engine.StaticMeshActor
// Size: 0x3d8 (Inherited: 0x3c8)
struct AStaticMeshActor : AActor {
	struct UStaticMeshComponent* StaticMeshComponent; // 0x3c8(0x08)
	bool bStaticMeshReplicateMovement; // 0x3d0(0x01)
	char NavigationGeometryGatheringMode; // 0x3d1(0x01)
	char UnknownData_3D2[0x6]; // 0x3d2(0x06)
};

// Class Engine.Brush
// Size: 0x400 (Inherited: 0x3c8)
struct ABrush : AActor {
	char BrushType; // 0x3c8(0x01)
	char UnknownData_3C9[0x3]; // 0x3c9(0x03)
	struct FColor BrushColor; // 0x3cc(0x04)
	int32_t PolyFlags; // 0x3d0(0x04)
	char bColored : 1; // 0x3d4(0x01)
	char bSolidWhenSelected : 1; // 0x3d4(0x01)
	char bPlaceableFromClassBrowser : 1; // 0x3d4(0x01)
	char bNotForClientOrServer : 1; // 0x3d4(0x01)
	char UnknownData_3D4_4 : 4; // 0x3d4(0x01)
	char UnknownData_3D5[0x3]; // 0x3d5(0x03)
	struct UModel* Brush; // 0x3d8(0x08)
	struct UBrushComponent* BrushComponent; // 0x3e0(0x08)
	char bInManipulation : 1; // 0x3e8(0x01)
	char UnknownData_3E8_1 : 7; // 0x3e8(0x01)
	char UnknownData_3E9[0x7]; // 0x3e9(0x07)
	struct TArray<struct FGeomSelection> SavedSelections; // 0x3f0(0x10)
};

// Class Engine.Volume
// Size: 0x400 (Inherited: 0x400)
struct AVolume : ABrush {
};

// Class Engine.BlockingVolume
// Size: 0x400 (Inherited: 0x400)
struct ABlockingVolume : AVolume {
};

// Class Engine.WorldSettings
// Size: 0x580 (Inherited: 0x3c8)
struct AWorldSettings : AInfo {
	char UnknownData_3C8[0x8]; // 0x3c8(0x08)
	char bEnableWorldBoundsChecks : 1; // 0x3d0(0x01)
	char bEnableNavigationSystem : 1; // 0x3d0(0x01)
	char UnknownData_3D0_2 : 6; // 0x3d0(0x01)
	char UnknownData_3D1[0x3]; // 0x3d1(0x03)
	char WorldCompositionSetting; // 0x3d4(0x01)
	char UnknownData_3D5[0x3]; // 0x3d5(0x03)
	struct FStringAssetReference InstancedNavMeshesDataAssetOveride; // 0x3d8(0x10)
	char bEnableWorldOriginRebasing : 1; // 0x3e8(0x01)
	char bWorldGravitySet : 1; // 0x3e8(0x01)
	char bGlobalGravitySet : 1; // 0x3e8(0x01)
	char UnknownData_3E8_3 : 5; // 0x3e8(0x01)
	char UnknownData_3E9[0x3]; // 0x3e9(0x03)
	float KillZ; // 0x3ec(0x04)
	struct UClass* KillZDamageType; // 0x3f0(0x08)
	float GlobalGravityZ; // 0x3f8(0x04)
	char UnknownData_3FC[0x4]; // 0x3fc(0x04)
	struct UClass* DefaultPhysicsVolumeClass; // 0x400(0x08)
	struct UClass* PhysicsCollisionHandlerClass; // 0x408(0x08)
	struct UClass* DefaultGameMode; // 0x410(0x08)
	struct TArray<struct FGameModePrefix> DefaultMapPrefixes; // 0x418(0x10)
	struct UClass* GameNetworkManagerClass; // 0x428(0x08)
	int32_t PackedLightAndShadowMapTextureSize; // 0x430(0x04)
	char bMinimizeBSPSections : 1; // 0x434(0x01)
	char UnknownData_434_1 : 7; // 0x434(0x01)
	char UnknownData_435[0x3]; // 0x435(0x03)
	struct FVector DefaultColorScale; // 0x438(0x0c)
	char bPrecomputeVisibility : 1; // 0x444(0x01)
	char bPlaceCellsOnlyAlongCameraTracks : 1; // 0x444(0x01)
	char UnknownData_444_2 : 6; // 0x444(0x01)
	char UnknownData_445[0x3]; // 0x445(0x03)
	int32_t VisibilityCellSize; // 0x448(0x04)
	char VisibilityAggressiveness; // 0x44c(0x01)
	char UnknownData_44D[0x3]; // 0x44d(0x03)
	char bForceNoPrecomputedLighting : 1; // 0x450(0x01)
	char UnknownData_450_1 : 7; // 0x450(0x01)
	char UnknownData_451[0x3]; // 0x451(0x03)
	struct FLightmassWorldInfoSettings LightmassSettings; // 0x454(0x44)
	char LevelLightingQuality; // 0x498(0x01)
	char UnknownData_499[0x7]; // 0x499(0x07)
	struct FReverbSettings DefaultReverbSettings; // 0x4a0(0x18)
	struct FInteriorSettings DefaultAmbientZoneSettings; // 0x4b8(0x24)
	char UnknownData_4DC[0x4]; // 0x4dc(0x04)
	struct USoundMix* DefaultBaseSoundMix; // 0x4e0(0x08)
	float WorldToMeters; // 0x4e8(0x04)
	char UnknownData_4EC[0x4]; // 0x4ec(0x04)
	struct UBookMark* BookMarks[0x0a]; // 0x4f0(0x50)
	float TimeDilation; // 0x540(0x04)
	float MatineeTimeDilation; // 0x544(0x04)
	float DemoPlayTimeDilation; // 0x548(0x04)
	char bHighPriorityLoading : 1; // 0x54c(0x01)
	char bHighPriorityLoadingLocal : 1; // 0x54c(0x01)
	char UnknownData_54C_2 : 6; // 0x54c(0x01)
	char UnknownData_54D[0x3]; // 0x54d(0x03)
	struct TArray<struct FNetViewer> ReplicationViewers; // 0x550(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x560(0x10)
	float WorldGravityZ; // 0x570(0x04)
	char UnknownData_574[0x4]; // 0x574(0x04)
	struct APlayerState* Pauser; // 0x578(0x08)

	void OnRep_WorldGravityZ(); // Function Engine.WorldSettings.OnRep_WorldGravityZ // Native|Public // @ game+0x2d9db50
};

// Class Engine.PostProcessComponent
// Size: 0x840 (Inherited: 0x2e0)
struct UPostProcessComponent : USceneComponent {
	char UnknownData_2E0[0x10]; // 0x2e0(0x10)
	struct FPostProcessSettings Settings; // 0x2f0(0x540)
	float Priority; // 0x830(0x04)
	float BlendRadius; // 0x834(0x04)
	float BlendWeight; // 0x838(0x04)
	char bEnabled : 1; // 0x83c(0x01)
	char bUnbound : 1; // 0x83c(0x01)
	char UnknownData_83C_2 : 6; // 0x83c(0x01)
	char UnknownData_83D[0x3]; // 0x83d(0x03)

	void AddOrUpdateBlendable(TScriptInterface<struct UBlendableInterface> InBlendableObject, float InWeight); // Function Engine.PostProcessComponent.AddOrUpdateBlendable // Final|Native|Public|BlueprintCallable // @ game+0x2e9ec30
};

// Class Engine.Texture
// Size: 0x138 (Inherited: 0x28)
struct UTexture : UObject {
	int32_t LODBias; // 0x28(0x04)
	int32_t NumCinematicMipLevels; // 0x2c(0x04)
	char SRGB : 1; // 0x30(0x01)
	char NeverStream : 1; // 0x30(0x01)
	char bNoTiling : 1; // 0x30(0x01)
	char bUseCinematicMipLevels : 1; // 0x30(0x01)
	char CompressionNone : 1; // 0x30(0x01)
	char bUAV : 1; // 0x30(0x01)
	char UnknownData_30_6 : 2; // 0x30(0x01)
	char UnknownData_31[0x3]; // 0x31(0x03)
	uint32_t MaxQualityReduction; // 0x34(0x04)
	int32_t CachedCombinedLODBias; // 0x38(0x04)
	char bAsyncResourceReleaseHasBeenStarted : 1; // 0x3c(0x01)
	char UnknownData_3C_1 : 7; // 0x3c(0x01)
	char UnknownData_3D[0x3]; // 0x3d(0x03)
	char CompressionSettings; // 0x40(0x01)
	char Filter; // 0x41(0x01)
	char LODGroup; // 0x42(0x01)
	char UnknownData_43[0x1]; // 0x43(0x01)
	float StreamingPriorityBoost; // 0x44(0x04)
	char UnknownData_48[0x58]; // 0x48(0x58)
	struct TArray<struct FExternalMip> ExternalMips; // 0xa0(0x10)
	char UnknownData_B0[0x88]; // 0xb0(0x88)
};

// Class Engine.TextureRenderTarget
// Size: 0x140 (Inherited: 0x138)
struct UTextureRenderTarget : UTexture {
	float TargetGamma; // 0x138(0x04)
	char UnknownData_13C[0x4]; // 0x13c(0x04)
};

// Class Engine.TextureRenderTarget2D
// Size: 0x168 (Inherited: 0x140)
struct UTextureRenderTarget2D : UTextureRenderTarget {
	int32_t SizeX; // 0x140(0x04)
	int32_t SizeY; // 0x144(0x04)
	struct FLinearColor ClearColor; // 0x148(0x10)
	char AddressX; // 0x158(0x01)
	char AddressY; // 0x159(0x01)
	char UnknownData_15A[0x2]; // 0x15a(0x02)
	char bForceLinearGamma : 1; // 0x15c(0x01)
	char bHDR : 1; // 0x15c(0x01)
	char bAutoGenerateMips : 1; // 0x15c(0x01)
	char UnknownData_15C_3 : 5; // 0x15c(0x01)
	char UnknownData_15D[0x3]; // 0x15d(0x03)
	char OverrideFormat; // 0x160(0x01)
	bool bDontClearOnCreation; // 0x161(0x01)
	char UnknownData_162[0x6]; // 0x162(0x06)
};

// Class Engine.DebugCameraController
// Size: 0x7c0 (Inherited: 0x770)
struct ADebugCameraController : APlayerController {
	char bUseOriginalPlayerHUD : 1; // 0x770(0x01)
	char bShowSelectedInfo : 1; // 0x770(0x01)
	char bIsFrozenRendering : 1; // 0x770(0x01)
	char UnknownData_770_3 : 5; // 0x770(0x01)
	char UnknownData_771[0x7]; // 0x771(0x07)
	struct UDrawFrustumComponent* DrawFrustum; // 0x778(0x08)
	char UnknownData_780[0x10]; // 0x780(0x10)
	struct APlayerController* OriginalControllerRef; // 0x790(0x08)
	struct UPlayer* OriginalPlayer; // 0x798(0x08)
	float SpeedScale; // 0x7a0(0x04)
	float InitialMaxSpeed; // 0x7a4(0x04)
	float InitialAccel; // 0x7a8(0x04)
	float InitialDecel; // 0x7ac(0x04)
	float SpeedScaleAdjustment; // 0x7b0(0x04)
	float FovScaleAdjustment; // 0x7b4(0x04)
	char UnknownData_7B8[0x8]; // 0x7b8(0x08)

	void ToggleDisplay(); // Function Engine.DebugCameraController.ToggleDisplay // Final|Native|Public|BlueprintCallable // @ game+0x2da6190
	void ShowDebugSelectedInfo(); // Function Engine.DebugCameraController.ShowDebugSelectedInfo // Exec|Native|Public // @ game+0x2da5bc0
	void IncreaseFOV(); // Function Engine.DebugCameraController.IncreaseFOV // Final|Native|Public|BlueprintCallable // @ game+0x2d9c1c0
	void IncreaseCameraSpeed(); // Function Engine.DebugCameraController.IncreaseCameraSpeed // Final|Native|Public|BlueprintCallable // @ game+0x2d9c1a0
	void DecreaseFOV(); // Function Engine.DebugCameraController.DecreaseFOV // Final|Native|Public|BlueprintCallable // @ game+0x2d94e90
	void DecreaseCameraSpeed(); // Function Engine.DebugCameraController.DecreaseCameraSpeed // Final|Native|Public|BlueprintCallable // @ game+0x2d94e70
};

// Class Engine.HUD
// Size: 0x4c0 (Inherited: 0x3c8)
struct AHUD : AActor {
	struct FColor WhiteColor; // 0x3c8(0x04)
	struct FColor GreenColor; // 0x3cc(0x04)
	struct FColor RedColor; // 0x3d0(0x04)
	char UnknownData_3D4[0x4]; // 0x3d4(0x04)
	struct APlayerController* PlayerOwner; // 0x3d8(0x08)
	char bLostFocusPaused : 1; // 0x3e0(0x01)
	char bShowHUD : 1; // 0x3e0(0x01)
	char bShowDebugInfo : 1; // 0x3e0(0x01)
	char bShowHitBoxDebugInfo : 1; // 0x3e0(0x01)
	char bShowOverlays : 1; // 0x3e0(0x01)
	char bEnableDebugTextShadow : 1; // 0x3e0(0x01)
	char UnknownData_3E0_6 : 2; // 0x3e0(0x01)
	char UnknownData_3E1[0x7]; // 0x3e1(0x07)
	struct TArray<struct AActor*> PostRenderedActors; // 0x3e8(0x10)
	float LastHUDRenderTime; // 0x3f8(0x04)
	float RenderDelta; // 0x3fc(0x04)
	struct TArray<struct FName> DebugDisplay; // 0x400(0x10)
	struct TArray<struct FName> ToggledDebugCategories; // 0x410(0x10)
	struct UCanvas* Canvas; // 0x420(0x08)
	struct UCanvas* DebugCanvas; // 0x428(0x08)
	struct TArray<struct FDebugTextInfo> DebugTextList; // 0x430(0x10)
	struct UClass* ShowDebugTargetDesiredClass; // 0x440(0x08)
	struct AActor* ShowDebugTargetActor; // 0x448(0x08)
	char UnknownData_450[0x70]; // 0x450(0x70)

	void ShowHUD(); // Function Engine.HUD.ShowHUD // Exec|Native|Public // @ game+0x2da5c60
	void ShowDebugToggleSubCategory(struct FName Category); // Function Engine.HUD.ShowDebugToggleSubCategory // Final|Exec|Native|Public // @ game+0x2da5be0
	void ShowDebugForReticleTargetToggle(struct UClass* DesiredClass); // Function Engine.HUD.ShowDebugForReticleTargetToggle // Final|Exec|Native|Public // @ game+0x2da5b40
	void ShowDebug(struct FName DebugType); // Function Engine.HUD.ShowDebug // Exec|Native|Public // @ game+0x2da5ab0
	void RemoveDebugText(struct AActor* SrcActor, bool bLeaveDurationText); // Function Engine.HUD.RemoveDebugText // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x2d9ea10
	void RemoveAllDebugStrings(); // Function Engine.HUD.RemoveAllDebugStrings // Final|Net|NetReliableNative|Event|Public|NetClient // @ game+0x2d9e9f0
	void ReceiveHitBoxRelease(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxRelease // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveHitBoxEndCursorOver(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxEndCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveHitBoxClick(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxClick // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveHitBoxBeginCursorOver(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxBeginCursorOver // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceiveDrawHUD(int32_t SizeX, int32_t SizeY); // Function Engine.HUD.ReceiveDrawHUD // BlueprintCosmetic|Event|Public|BlueprintEvent // @ game+0x1848130
	struct FVector Project(struct FVector Location); // Function Engine.HUD.Project // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9e3b0
	void GetTextSize(struct FString Text, float OutWidth, float OutHeight, struct UFont* Font, float Scale); // Function Engine.HUD.GetTextSize // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9b010
	struct APlayerController* GetOwningPlayerController(); // Function Engine.HUD.GetOwningPlayerController // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98ed0
	struct APawn* GetOwningPawn(); // Function Engine.HUD.GetOwningPawn // Final|Native|Protected|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98ea0
	void GetActorsInSelectionRectangle(struct UClass* ClassFilter, struct FVector2D FirstPoint, struct FVector2D SecondPoint, struct TArray<struct AActor*> OutActors, bool bIncludeNonCollidingComponents, bool bActorMustBeFullyEnclosed); // Function Engine.HUD.GetActorsInSelectionRectangle // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure // @ game+0x2d96ca0
	void DrawTextureSimple(struct UTexture* Texture, float ScreenX, float ScreenY, float Scale, bool bScalePosition); // Function Engine.HUD.DrawTextureSimple // Final|Native|Public|BlueprintCallable // @ game+0x2d962a0
	void DrawTexture(struct UTexture* Texture, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float TextureU, float TextureV, float TextureUWidth, float TextureVHeight, struct FLinearColor TintColor, char BlendMode, float Scale, bool bScalePosition, float Rotation, struct FVector2D RotPivot); // Function Engine.HUD.DrawTexture // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d95e80
	void DrawText(struct FString Text, struct FLinearColor TextColor, float ScreenX, float ScreenY, struct UFont* Font, float Scale, bool bScalePosition); // Function Engine.HUD.DrawText // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d95c40
	void DrawRect(struct FLinearColor RectColor, float ScreenX, float ScreenY, float ScreenW, float ScreenH); // Function Engine.HUD.DrawRect // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d95a90
	void DrawMaterialTriangle(struct UMaterialInterface* Material, struct FVector2D V0_Pos, struct FVector2D V1_Pos, struct FVector2D V2_Pos, struct FVector2D V0_UV, struct FVector2D V1_UV, struct FVector2D V2_UV, struct FLinearColor V0_Color, struct FLinearColor V1_Color, struct FLinearColor V2_Color); // Function Engine.HUD.DrawMaterialTriangle // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d957d0
	void DrawMaterialSimple(struct UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float Scale, bool bScalePosition); // Function Engine.HUD.DrawMaterialSimple // Final|Native|Public|BlueprintCallable // @ game+0x2d955d0
	void DrawMaterial(struct UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float MaterialU, float MaterialV, float MaterialUWidth, float MaterialVHeight, float Scale, bool bScalePosition, float Rotation, struct FVector2D RotPivot); // Function Engine.HUD.DrawMaterial // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d95240
	void DrawLine(float StartScreenX, float StartScreenY, float EndScreenX, float EndScreenY, struct FLinearColor LineColor); // Function Engine.HUD.DrawLine // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d95090
	void Deproject(float ScreenX, float ScreenY, struct FVector WorldPosition, struct FVector WorldDirection); // Function Engine.HUD.Deproject // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d94eb0
	void AddHitBox(struct FVector2D Position, struct FVector2D Size, struct FName InName, bool bConsumesInput, int32_t Priority); // Function Engine.HUD.AddHitBox // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d93270
	void AddDebugText(struct FString DebugText, struct AActor* SrcActor, float Duration, struct FVector Offset, struct FVector DesiredOffset, struct FColor TextColor, bool bSkipOverwriteCheck, bool bAbsoluteLocation, bool bKeepAttachedToActor, struct UFont* InFont, float FontScale, bool bDrawShadow); // Function Engine.HUD.AddDebugText // Final|Net|NetReliableNative|Event|Public|HasDefaults|NetClient // @ game+0x2d92ac0
};

// Class Engine.FeatureToggledStringAssetReference
// Size: 0x40 (Inherited: 0x28)
struct UFeatureToggledStringAssetReference : UDataAsset {
	struct TArray<struct FFeatureToggledStringAssetReferenceEntry> Entries; // 0x28(0x10)
	struct UClass* ClassType; // 0x38(0x08)
};

// Class Engine.LevelScriptActor
// Size: 0x3d0 (Inherited: 0x3c8)
struct ALevelScriptActor : AActor {
	char bInputEnabled : 1; // 0x3c8(0x01)
	char UnknownData_3C8_1 : 7; // 0x3c8(0x01)
	char UnknownData_3C9[0x7]; // 0x3c9(0x07)

	void WorldOriginLocationChanged(struct FIntVector OldOriginLocation, struct FIntVector NewOriginLocation); // Function Engine.LevelScriptActor.WorldOriginLocationChanged // Event|Public|BlueprintEvent // @ game+0x1848130
	void SetCinematicMode(bool bCinematicMode, bool bHidePlayer, bool bAffectsHUD, bool bAffectsMovement, bool bAffectsTurning); // Function Engine.LevelScriptActor.SetCinematicMode // Native|Public|BlueprintCallable // @ game+0x2da0d80
	bool RemoteEvent(struct FName EventName); // Function Engine.LevelScriptActor.RemoteEvent // Native|Public|BlueprintCallable // @ game+0x2d9e950
	void MatchStarted(); // Function Engine.LevelScriptActor.MatchStarted // Event|Public|BlueprintEvent // @ game+0x1848130
	void LevelReset(); // Function Engine.LevelScriptActor.LevelReset // BlueprintAuthorityOnly|Event|Public|BlueprintEvent // @ game+0x1848130
	void InitialNetRelevantActorsCreated(); // Function Engine.LevelScriptActor.InitialNetRelevantActorsCreated // Event|Public|BlueprintEvent // @ game+0x1848130
};

// Class Engine.ArrowComponent
// Size: 0x5d0 (Inherited: 0x5c0)
struct UArrowComponent : UPrimitiveComponent {
	struct FColor ArrowColor; // 0x5b8(0x04)
	float ArrowSize; // 0x5bc(0x04)
	bool bIsScreenSizeScaled; // 0x5c0(0x01)
	float ScreenSize; // 0x5c4(0x04)
	char bTreatAsASprite : 1; // 0x5c8(0x01)
	char UnknownData_5CD_1 : 7; // 0x5cd(0x01)
	char UnknownData_5CE[0x2]; // 0x5ce(0x02)

	void SetArrowColor_New(struct FLinearColor NewColor); // Function Engine.ArrowComponent.SetArrowColor_New // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2eaba00
	void SetArrowColor_DEPRECATED(struct FColor NewColor); // Function Engine.ArrowComponent.SetArrowColor_DEPRECATED // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2eab980
};

// Class Engine.MeshComponent
// Size: 0x5d0 (Inherited: 0x5c0)
struct UMeshComponent : UPrimitiveComponent {
	struct TArray<struct UMaterialInterface*> OverrideMaterials; // 0x5b8(0x10)

	void ResetDefaultMaterials(); // Function Engine.MeshComponent.ResetDefaultMaterials // Final|Native|Public|BlueprintCallable // @ game+0x2d9eb20
	struct TArray<struct UMaterialInterface*> GetMaterials(); // Function Engine.MeshComponent.GetMaterials // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d985e0
};

// Class Engine.StaticMeshComponent
// Size: 0x620 (Inherited: 0x5d0)
struct UStaticMeshComponent : UMeshComponent {
	int32_t ForcedLodModel; // 0x5c8(0x04)
	bool bOverrideMinLOD; // 0x5cc(0x01)
	bool bOverrideNavigationToDefaultObstacle; // 0x5cd(0x01)
	int32_t MinLOD; // 0x5d0(0x04)
	struct UStaticMesh* StaticMesh; // 0x5d8(0x08)
	bool bOverrideWireframeColor; // 0x5e0(0x01)
	char UnknownData_5E3[0x1]; // 0x5e3(0x01)
	struct FColor WireframeColorOverride; // 0x5e4(0x04)
	char bIgnoreInstanceForTextureStreaming : 1; // 0x5e8(0x01)
	char bOverrideLightMapRes : 1; // 0x5e8(0x01)
	char UnknownData_5E8_2 : 6; // 0x5e8(0x01)
	char UnknownData_5E9[0x3]; // 0x5e9(0x03)
	int32_t OverriddenLightMapRes; // 0x5ec(0x04)
	float StreamingDistanceMultiplier; // 0x5f0(0x04)
	char UnknownData_5F4[0x4]; // 0x5f4(0x04)
	struct TArray<struct FGuid> IrrelevantLights; // 0x5f8(0x10)
	struct TArray<struct FStaticMeshComponentLODInfo> LODData; // 0x608(0x10)
	struct UMaterialInterface* CustomDepthMaterial; // 0x618(0x08)

	bool SetStaticMesh(struct UStaticMesh* NewMesh); // Function Engine.StaticMeshComponent.SetStaticMesh // Native|Public|BlueprintCallable // @ game+0x2eb1340
	void SetForcedLodModel(int32_t NewForcedLodModel); // Function Engine.StaticMeshComponent.SetForcedLodModel // Final|Native|Public|BlueprintCallable // @ game+0x2eae630
	void SetCustomDepthMaterial(struct UMaterialInterface* Material); // Function Engine.StaticMeshComponent.SetCustomDepthMaterial // Final|Native|Public|BlueprintCallable // @ game+0x2ead220
	void OnRep_StaticMesh(struct UStaticMesh* OldStaticMesh); // Function Engine.StaticMeshComponent.OnRep_StaticMesh // Final|Native|Public // @ game+0x2ea8a40
	void GetLocalBounds(struct FVector Min, struct FVector Max); // Function Engine.StaticMeshComponent.GetLocalBounds // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea5500
	struct UMaterialInterface* GetCustomDepthMaterial(); // Function Engine.StaticMeshComponent.GetCustomDepthMaterial // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea4240
};

// Class Engine.FogVolume
// Size: 0x3d8 (Inherited: 0x3c8)
struct AFogVolume : AActor {
	struct USphereComponent* SphereComponent; // 0x3c8(0x08)
	struct UFogVolumeComponent* FogVolumeComponent; // 0x3d0(0x08)

	void SetScaleWithLighting(bool bScaleWithLighting); // Function Engine.FogVolume.SetScaleWithLighting // Final|Native|Public|BlueprintCallable // @ game+0x2da4b60
};

// Class Engine.ThreadedActor
// Size: 0x3c8 (Inherited: 0x3c8)
struct AThreadedActor : AActor {
};

// Class Engine.MaterialInterface
// Size: 0x58 (Inherited: 0x28)
struct UMaterialInterface : UObject {
	char UnknownData_28[0x8]; // 0x28(0x08)
	struct USubsurfaceProfile* SubsurfaceProfile; // 0x30(0x08)
	char UnknownData_38[0x4]; // 0x38(0x04)
	struct FLightmassMaterialInterfaceSettings LightmassSettings; // 0x3c(0x14)
	char UnknownData_50[0x8]; // 0x50(0x08)

	struct UPhysicalMaterial* GetPhysicalMaterial(); // Function Engine.MaterialInterface.GetPhysicalMaterial // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d99480
	struct UMaterial* GetBaseMaterial(); // Function Engine.MaterialInterface.GetBaseMaterial // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x2d96fe0
};

// Class Engine.Material
// Size: 0xa18 (Inherited: 0x58)
struct UMaterial : UMaterialInterface {
	struct UPhysicalMaterial* PhysMaterial; // 0x58(0x08)
	struct FColorMaterialInput DiffuseColor; // 0x60(0x40)
	struct FColorMaterialInput SpecularColor; // 0xa0(0x40)
	struct FColorMaterialInput BaseColor; // 0xe0(0x40)
	struct FScalarMaterialInput Metallic; // 0x120(0x40)
	struct FScalarMaterialInput Specular; // 0x160(0x40)
	struct FScalarMaterialInput Roughness; // 0x1a0(0x40)
	struct FVectorMaterialInput Normal; // 0x1e0(0x48)
	struct FColorMaterialInput EmissiveColor; // 0x228(0x40)
	struct FScalarMaterialInput Opacity; // 0x268(0x40)
	struct FScalarMaterialInput OpacityMask; // 0x2a8(0x40)
	char MaterialDomain; // 0x2e8(0x01)
	char BlendMode; // 0x2e9(0x01)
	char DecalBlendMode; // 0x2ea(0x01)
	bool bDecalNoEmissiveOrRoughness; // 0x2eb(0x01)
	bool bDecalEnableStencil; // 0x2ec(0x01)
	char MaterialDecalResponse; // 0x2ed(0x01)
	char ShadingModel; // 0x2ee(0x01)
	char UnknownData_2EF[0x1]; // 0x2ef(0x01)
	float OpacityMaskClipValue; // 0x2f0(0x04)
	float DepthWeightScale; // 0x2f4(0x04)
	float DepthWeightExponent; // 0x2f8(0x04)
	float DepthWeightBase; // 0x2fc(0x04)
	char bBlendedOITAfterTranslucency : 1; // 0x300(0x01)
	char bForceResolution : 1; // 0x300(0x01)
	char UnknownData_300_2 : 6; // 0x300(0x01)
	char UnknownData_301[0x3]; // 0x301(0x03)
	char ForcedResolution; // 0x304(0x01)
	char UnknownData_305[0x3]; // 0x305(0x03)
	float FirstSplitDistance; // 0x308(0x04)
	float SecondSplitDistance; // 0x30c(0x04)
	float FullResInFrontMaxDistance; // 0x310(0x04)
	char FullResInFront : 1; // 0x314(0x01)
	char PopPerParticle : 1; // 0x314(0x01)
	char UnknownData_314_2 : 6; // 0x314(0x01)
	char UnknownData_315[0x3]; // 0x315(0x03)
	struct FVectorMaterialInput WorldPositionOffset; // 0x318(0x48)
	struct FVectorMaterialInput WorldDisplacement; // 0x360(0x48)
	struct FScalarMaterialInput TessellationMultiplier; // 0x3a8(0x40)
	struct FColorMaterialInput SubsurfaceColor; // 0x3e8(0x40)
	struct FScalarMaterialInput ClearCoat; // 0x428(0x40)
	struct FScalarMaterialInput ClearCoatRoughness; // 0x468(0x40)
	struct FScalarMaterialInput AmbientOcclusion; // 0x4a8(0x40)
	struct FScalarMaterialInput Refraction; // 0x4e8(0x40)
	struct FColorMaterialInput BillboardColor; // 0x528(0x40)
	struct FVectorMaterialInput BillboardParams; // 0x568(0x48)
	struct FVector2MaterialInput CustomizedUVs[0x08]; // 0x5b0(0x240)
	struct FMaterialAttributesInput MaterialAttributes; // 0x7f0(0x38)
	char UnknownData_828[0x10]; // 0x828(0x10)
	struct FScalarMaterialInput PixelDepthOffset; // 0x838(0x40)
	char bTranslucentBeforeTranslucency : 1; // 0x878(0x01)
	char bTranslucentBeforeVolumeFog : 1; // 0x878(0x01)
	char bTranslucentWithDepthWrite : 1; // 0x878(0x01)
	char bEnableSeparateTranslucency : 1; // 0x878(0x01)
	char bEnableResponsiveAA : 1; // 0x878(0x01)
	char bScreenSpaceReflections : 1; // 0x878(0x01)
	char TwoSided : 1; // 0x878(0x01)
	char DitheredLODTransition : 1; // 0x878(0x01)
	char UnknownData_879[0x3]; // 0x879(0x03)
	char ConstantMaterial; // 0x87c(0x01)
	char UnknownData_87D[0x3]; // 0x87d(0x03)
	float SkyLightWhenOccluded; // 0x880(0x04)
	float CloudShadowsInfluence; // 0x884(0x04)
	int32_t NumCustomizedUVs; // 0x888(0x04)
	char TranslucencyLightingMode; // 0x88c(0x01)
	char UnknownData_88D[0x3]; // 0x88d(0x03)
	float TranslucencyDirectionalLightingIntensity; // 0x890(0x04)
	float LightColorInfluence; // 0x894(0x04)
	float AmbientLightColorInfluence; // 0x898(0x04)
	float LightIntensityInfluence; // 0x89c(0x04)
	float AmbientLightIntensityInfluence; // 0x8a0(0x04)
	float AlternativeAmbientLightColorInfluence; // 0x8a4(0x04)
	float AlternativeAmbientLightIntensityInfluence; // 0x8a8(0x04)
	char bEvaluateLightningAtParticleCenter : 1; // 0x8ac(0x01)
	char UnknownData_8AC_1 : 7; // 0x8ac(0x01)
	char UnknownData_8AD[0x3]; // 0x8ad(0x03)
	float TranslucencyScaleForReflection; // 0x8b0(0x04)
	char bObjectFadeEnabled : 1; // 0x8b4(0x01)
	char UnknownData_8B4_1 : 7; // 0x8b4(0x01)
	char UnknownData_8B5[0x3]; // 0x8b5(0x03)
	float ObjectFadeRate; // 0x8b8(0x04)
	float ObjectFadeDistanceThreshold; // 0x8bc(0x04)
	float TranslucentShadowDensityScale; // 0x8c0(0x04)
	float TranslucentSelfShadowDensityScale; // 0x8c4(0x04)
	float TranslucentSelfShadowSecondDensityScale; // 0x8c8(0x04)
	float TranslucentSelfShadowSecondOpacity; // 0x8cc(0x04)
	float TranslucentBackscatteringExponent; // 0x8d0(0x04)
	struct FLinearColor TranslucentMultipleScatteringExtinction; // 0x8d4(0x10)
	float TranslucentShadowStartOffset; // 0x8e4(0x04)
	float VolumeFogScale; // 0x8e8(0x04)
	char DistanceFog : 1; // 0x8ec(0x01)
	char bDisableDepthTest : 1; // 0x8ec(0x01)
	char bGenerateSphericalParticleNormals : 1; // 0x8ec(0x01)
	char bDontRenderWhenPlayerInsideShip : 1; // 0x8ec(0x01)
	char bTangentSpaceNormal : 1; // 0x8ec(0x01)
	char bUseEmissiveForDynamicAreaLighting : 1; // 0x8ec(0x01)
	char bBlockGI : 1; // 0x8ec(0x01)
	char bUsedAsSpecialEngineMaterial : 1; // 0x8ec(0x01)
	char bUsedWithSkeletalMesh : 1; // 0x8ed(0x01)
	char bUsedWithEditorCompositing : 1; // 0x8ed(0x01)
	char bUsedWithLandscape : 1; // 0x8ed(0x01)
	char bUsedWithParticleSprites : 1; // 0x8ed(0x01)
	char bUsedWithCPUParticleSprites : 1; // 0x8ed(0x01)
	char bUsedWithStaticMesh : 1; // 0x8ed(0x01)
	char bUsedWithCoverage : 1; // 0x8ed(0x01)
	char bUsedWithGPUInstanceCulling : 1; // 0x8ed(0x01)
	char bUsedWithBeamTrails : 1; // 0x8ee(0x01)
	char bUsedWithMeshParticles : 1; // 0x8ee(0x01)
	char bUsedWithStaticLighting : 1; // 0x8ee(0x01)
	char bUsedWithFluidSurfaces : 1; // 0x8ee(0x01)
	char bUsedWithMorphTargets : 1; // 0x8ee(0x01)
	char bUsedWithSplineMeshes : 1; // 0x8ee(0x01)
	char bUsedWithInstancedStaticMeshes : 1; // 0x8ee(0x01)
	char bUsesDistortion : 1; // 0x8ee(0x01)
	char bUsedWithClothing : 1; // 0x8ef(0x01)
	char bUsedWithDeformables : 1; // 0x8ef(0x01)
	char bUsedWithFFTWaterMask : 1; // 0x8ef(0x01)
	char bUsedWithVolumeFogMask : 1; // 0x8ef(0x01)
	char bUsedWithDynamicObjectFading : 1; // 0x8ef(0x01)
	char bUsedWithWaterBoundary : 1; // 0x8ef(0x01)
	char bUsedWithClouds : 1; // 0x8ef(0x01)
	char bUsedWithInstancedRopes : 1; // 0x8ef(0x01)
	char bUsedWithPlanarReflection : 1; // 0x8f0(0x01)
	char bUsedWithPointLightShadows : 1; // 0x8f0(0x01)
	char bUsedWithMaskPass : 1; // 0x8f0(0x01)
	char bUsedWithUI : 1; // 0x8f0(0x01)
	char bAutomaticallySetUsageInEditor : 1; // 0x8f0(0x01)
	char bAllowEmissiveOnLandscape : 1; // 0x8f0(0x01)
	char bApplyWaterMask : 1; // 0x8f0(0x01)
	char bUseReZ : 1; // 0x8f0(0x01)
	char bFullyRough : 1; // 0x8f1(0x01)
	char bUseLightmapDirectionality : 1; // 0x8f1(0x01)
	char UnknownData_8F1_2 : 6; // 0x8f1(0x01)
	char UnknownData_8F2[0x2]; // 0x8f2(0x02)
	char GeometryMode; // 0x8f4(0x01)
	char D3D11TessellationMode; // 0x8f5(0x01)
	char UnknownData_8F6[0x2]; // 0x8f6(0x02)
	char bEnableCrackFreeDisplacement : 1; // 0x8f8(0x01)
	char bEnableAdaptiveTessellation : 1; // 0x8f8(0x01)
	char UnknownData_8F8_2 : 6; // 0x8f8(0x01)
	char UnknownData_8F9[0x3]; // 0x8f9(0x03)
	float MaxDisplacement; // 0x8fc(0x04)
	char Wireframe : 1; // 0x900(0x01)
	char bOutputVelocityOnBasePass : 1; // 0x900(0x01)
	char UnknownData_900_2 : 6; // 0x900(0x01)
	char UnknownData_901[0x3]; // 0x901(0x03)
	float NormalOffsetShadowBiasScale; // 0x904(0x04)
	int32_t EditorX; // 0x908(0x04)
	int32_t EditorY; // 0x90c(0x04)
	int32_t EditorPitch; // 0x910(0x04)
	int32_t EditorYaw; // 0x914(0x04)
	struct TArray<struct UMaterialExpression*> Expressions; // 0x918(0x10)
	struct TArray<struct FMaterialFunctionInfo> MaterialFunctionInfos; // 0x928(0x10)
	struct TArray<struct FMaterialParameterCollectionInfo> MaterialParameterCollectionInfos; // 0x938(0x10)
	char bCanMaskedBeAssumedOpaque : 1; // 0x948(0x01)
	char bIsMasked : 1; // 0x948(0x01)
	char bIsPreviewMaterial : 1; // 0x948(0x01)
	char bUseMaterialAttributes : 1; // 0x948(0x01)
	char bUseTranslucencyVertexFog : 1; // 0x948(0x01)
	char bUseDensityMapOnTranslucencyVertexFog : 1; // 0x948(0x01)
	char bAllowDevelopmentShaderCompile : 1; // 0x948(0x01)
	char bIsMaterialEditorStatsMaterial : 1; // 0x948(0x01)
	char UnknownData_949[0x3]; // 0x949(0x03)
	uint32_t UsageFlagWarnings; // 0x94c(0x04)
	char BlendableLocation; // 0x950(0x01)
	char UnknownData_951[0x3]; // 0x951(0x03)
	int32_t BlendablePriority; // 0x954(0x04)
	char bIsAlphaBlended : 1; // 0x958(0x01)
	char UnknownData_958_1 : 7; // 0x958(0x01)
	char UnknownData_959[0x3]; // 0x959(0x03)
	float RefractionDepthBias; // 0x95c(0x04)
	struct FGuid StateId; // 0x960(0x10)
	int32_t UnwrappedUVSet; // 0x970(0x04)
	char UnknownData_974[0x8c]; // 0x974(0x8c)
	struct TArray<struct UTexture*> ExpressionTextureReferences; // 0xa00(0x10)
	char UnknownData_A10[0x8]; // 0xa10(0x08)
};

// Class Engine.CameraModifier
// Size: 0x48 (Inherited: 0x28)
struct UCameraModifier : UObject {
	char bDebug : 1; // 0x28(0x01)
	char bExclusive : 1; // 0x28(0x01)
	char UnknownData_28_2 : 6; // 0x28(0x01)
	char UnknownData_29[0x3]; // 0x29(0x03)
	char Priority; // 0x2c(0x01)
	char UnknownData_2D[0x3]; // 0x2d(0x03)
	struct APlayerCameraManager* CameraOwner; // 0x30(0x08)
	float AlphaInTime; // 0x38(0x04)
	float AlphaOutTime; // 0x3c(0x04)
	float Alpha; // 0x40(0x04)
	char bAutoDestroyOnCompletion : 1; // 0x44(0x01)
	char UnknownData_44_1 : 7; // 0x44(0x01)
	char UnknownData_45[0x3]; // 0x45(0x03)

	bool IsDisabled(); // Function Engine.CameraModifier.IsDisabled // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2fc67c0
	struct AActor* GetViewTarget(); // Function Engine.CameraModifier.GetViewTarget // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2fc4550
	void EnableModifier(); // Function Engine.CameraModifier.EnableModifier // Native|Public|BlueprintCallable // @ game+0x2fbec90
	void DisableModifier(bool bImmediate); // Function Engine.CameraModifier.DisableModifier // Native|Public|BlueprintCallable // @ game+0x2fbbf90
	void BlueprintModifyPostProcess(float DeltaTime, float PostProcessBlendWeight, struct FPostProcessSettings PostProcessSettings); // Function Engine.CameraModifier.BlueprintModifyPostProcess // BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent // @ game+0x1848130
	void BlueprintModifyCamera(float DeltaTime, struct FVector ViewLocation, struct FRotator ViewRotation, float FOV, struct FVector NewViewLocation, struct FRotator NewViewRotation, float NewFOV); // Function Engine.CameraModifier.BlueprintModifyCamera // BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1848130
};

// Class Engine.PhysicsVolume
// Size: 0x410 (Inherited: 0x400)
struct APhysicsVolume : AVolume {
	float TerminalVelocity; // 0x400(0x04)
	int32_t Priority; // 0x404(0x04)
	float FluidFriction; // 0x408(0x04)
	char bWaterVolume : 1; // 0x40c(0x01)
	char bPhysicsOnContact : 1; // 0x40c(0x01)
	char UnknownData_40C_2 : 6; // 0x40c(0x01)
	char UnknownData_40D[0x3]; // 0x40d(0x03)
};

// Class Engine.ParticleSystemComponent
// Size: 0x8b0 (Inherited: 0x5c0)
struct UParticleSystemComponent : UPrimitiveComponent {
	struct UParticleSystem* Template; // 0x5b8(0x08)
	struct TArray<struct UMaterialInterface*> EmitterMaterials; // 0x5c0(0x10)
	struct TArray<struct USkeletalMeshComponent*> SkelMeshComponents; // 0x5d0(0x10)
	char UnknownData_5E8_0 : 6; // 0x5e8(0x01)
	char bResetOnDetach : 1; // 0x5e0(0x01)
	char bUpdateOnDedicatedServer : 1; // 0x5e0(0x01)
	struct TArray<struct FParticleSysParam> InstanceParameters; // 0x5e8(0x10)
	struct FParticleSysParam EmitterPointParameter; // 0x5f8(0x50)
	struct FMulticastDelegate OnParticleSpawn; // 0x648(0x10)
	struct FMulticastDelegate OnParticleBurst; // 0x658(0x10)
	struct FMulticastDelegate OnParticleDeath; // 0x668(0x10)
	struct FMulticastDelegate OnParticleCollide; // 0x678(0x10)
	struct FVector OldPosition; // 0x688(0x0c)
	struct FVector PartSysVelocity; // 0x694(0x0c)
	char UnknownData_6A1[0x17]; // 0x6a1(0x17)
	struct FVector CustomInheritedVelocity; // 0x6b8(0x0c)
	char UnknownData_6C4[0x14]; // 0x6c4(0x14)
	float CustomParameterDrivingCurves; // 0x6d8(0x04)
	struct FLinearColor ColourTint; // 0x6dc(0x10)
	float WarmUpTime; // 0x6ec(0x04)
	float WarmupTickRate; // 0x6f0(0x04)
	char bWarmingUp : 1; // 0x6f4(0x01)
	char UnknownData_6F4_1 : 7; // 0x6f4(0x01)
	char UnknownData_6F5[0x1b]; // 0x6f5(0x1b)
	float SecondsBeforeInactive; // 0x710(0x04)
	char UnknownData_714[0x8]; // 0x714(0x08)
	float MaxTimeBeforeForceUpdateTransform; // 0x71c(0x04)
	char UnknownData_720[0x4]; // 0x720(0x04)
	char bOverrideLODMethod : 1; // 0x724(0x01)
	char UnknownData_724_1 : 7; // 0x724(0x01)
	char UnknownData_725[0x3]; // 0x725(0x03)
	char LODMethod; // 0x728(0x01)
	char UnknownData_729[0x3]; // 0x729(0x03)
	char bSkipUpdateDynamicDataDuringTick : 1; // 0x72c(0x01)
	char UnknownData_72C_1 : 7; // 0x72c(0x01)
	char UnknownData_72D[0x3]; // 0x72d(0x03)
	struct TArray<struct FMaterialRelevance> CachedViewRelevanceFlags; // 0x730(0x10)
	char UnknownData_740[0x8]; // 0x740(0x08)
	struct TArray<struct UParticleSystemReplay*> ReplayClips; // 0x748(0x10)
	char UnknownData_758[0x60]; // 0x758(0x60)
	float CustomTimeDilation; // 0x7b8(0x04)
	char UnknownData_7BC[0x4]; // 0x7bc(0x04)
	struct FMulticastDelegate OnSystemFinished; // 0x7c0(0x10)
	char bUnbound : 1; // 0x7d0(0x01)
	char UnknownData_7D0_1 : 7; // 0x7d0(0x01)
	char UnknownData_7D1[0xdf]; // 0x7d1(0xdf)

	void SetVectorParameter(struct FName ParameterName, struct FVector Param); // Function Engine.ParticleSystemComponent.SetVectorParameter // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da57d0
	void SetTrailSourceData(struct FName InFirstSocketName, struct FName InSecondSocketName, char InWidthMode, float InWidth); // Function Engine.ParticleSystemComponent.SetTrailSourceData // Final|Native|Public|BlueprintCallable // @ game+0x2da5410
	void SetTemplate(struct UParticleSystem* NewTemplate); // Function Engine.ParticleSystemComponent.SetTemplate // Final|Native|Public|BlueprintCallable // @ game+0x2da5390
	void SetMaterialParameter(struct FName ParameterName, struct UMaterialInterface* Param); // Function Engine.ParticleSystemComponent.SetMaterialParameter // Final|Native|Public|BlueprintCallable // @ game+0x2da3a70
	void SetFloatParameter(struct FName ParameterName, float Param); // Function Engine.ParticleSystemComponent.SetFloatParameter // Final|Native|Public|BlueprintCallable // @ game+0x2da23f0
	void SetEnableDistanceFading(bool bEnable); // Function Engine.ParticleSystemComponent.SetEnableDistanceFading // Final|Native|Public|BlueprintCallable // @ game+0x2da20e0
	void SetEmitterEnable(struct FName EmitterName, bool bNewEnableState); // Function Engine.ParticleSystemComponent.SetEmitterEnable // Native|Public|BlueprintCallable // @ game+0x2da2010
	void SetCustomLocalSpaceWorldSpace(); // Function Engine.ParticleSystemComponent.SetCustomLocalSpaceWorldSpace // Final|Native|Public|BlueprintCallable // @ game+0x2da1ba0
	void SetCustomLocalSpaceComponent(struct USceneComponent* InComponent); // Function Engine.ParticleSystemComponent.SetCustomLocalSpaceComponent // Final|Native|Public|BlueprintCallable // @ game+0x2da1b20
	void SetColorParameter(struct FName ParameterName, struct FLinearColor Param); // Function Engine.ParticleSystemComponent.SetColorParameter // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da13f0
	void SetBeamTargetTangent(int32_t EmitterIndex, struct FVector NewTangentPoint, int32_t TargetIndex); // Function Engine.ParticleSystemComponent.SetBeamTargetTangent // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da0770
	void SetBeamTargetStrength(int32_t EmitterIndex, float NewTargetStrength, int32_t TargetIndex); // Function Engine.ParticleSystemComponent.SetBeamTargetStrength // Native|Public|BlueprintCallable // @ game+0x2da0670
	void SetBeamTargetPoint(int32_t EmitterIndex, struct FVector NewTargetPoint, int32_t TargetIndex); // Function Engine.ParticleSystemComponent.SetBeamTargetPoint // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da0560
	void SetBeamSourceTangent(int32_t EmitterIndex, struct FVector NewTangentPoint, int32_t SourceIndex); // Function Engine.ParticleSystemComponent.SetBeamSourceTangent // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da0450
	void SetBeamSourceStrength(int32_t EmitterIndex, float NewSourceStrength, int32_t SourceIndex); // Function Engine.ParticleSystemComponent.SetBeamSourceStrength // Native|Public|BlueprintCallable // @ game+0x2da0350
	void SetBeamSourcePoint(int32_t EmitterIndex, struct FVector NewSourcePoint, int32_t SourceIndex); // Function Engine.ParticleSystemComponent.SetBeamSourcePoint // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da0240
	void SetBeamEndPoint(int32_t EmitterIndex, struct FVector NewEndPoint); // Function Engine.ParticleSystemComponent.SetBeamEndPoint // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da0170
	void SetActorParameter(struct FName ParameterName, struct AActor* Param); // Function Engine.ParticleSystemComponent.SetActorParameter // Final|Native|Public|BlueprintCallable // @ game+0x2d9ee20
	int32_t GetNumActiveParticles(); // Function Engine.ParticleSystemComponent.GetNumActiveParticles // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98980
	struct UMaterialInterface* GetNamedMaterial(struct FName InName); // Function Engine.ParticleSystemComponent.GetNamedMaterial // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98810
	void GenerateParticleEvent(struct FName InEventName, float InEmitterTime, struct FVector InLocation, struct FVector InDirection, struct FVector InVelocity); // Function Engine.ParticleSystemComponent.GenerateParticleEvent // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2d96a20
	void EndTrails(); // Function Engine.ParticleSystemComponent.EndTrails // Final|Native|Public|BlueprintCallable // @ game+0x2d96470
	struct UMaterialInstanceDynamic* CreateNamedDynamicMaterialInstance(struct FName InName, struct UMaterialInterface* SourceMaterial); // Function Engine.ParticleSystemComponent.CreateNamedDynamicMaterialInstance // Native|Public|BlueprintCallable // @ game+0x2d94cf0
	void BeginTrails(struct FName InFirstSocketName, struct FName InSecondSocketName, char InWidthMode, float InWidth); // Function Engine.ParticleSystemComponent.BeginTrails // Final|Native|Public|BlueprintCallable // @ game+0x2d93f90
	void AddKillSphere(struct FVector4 KillSphere); // Function Engine.ParticleSystemComponent.AddKillSphere // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2d93730
	void AddEmitterPoint(struct FVector4 Position, struct FVector4 InheritedVelocity, struct FVector4 Orientation, struct FVector Scale); // Function Engine.ParticleSystemComponent.AddEmitterPoint // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2d92e60
};

// Class Engine.SplineComponent
// Size: 0x640 (Inherited: 0x5c0)
struct USplineComponent : UPrimitiveComponent {
	struct FInterpCurveVector SplineInfo; // 0x5b8(0x18)
	struct FInterpCurveQuat SplineRotInfo; // 0x5d0(0x18)
	struct FInterpCurveVector SplineScaleInfo; // 0x5e8(0x18)
	struct FInterpCurveFloat SplineReparamTable; // 0x600(0x18)
	bool bAllowSplineEditingPerInstance; // 0x618(0x01)
	int32_t ReparamStepsPerSegment; // 0x61c(0x04)
	float Duration; // 0x620(0x04)
	bool bStationaryEndpoints; // 0x624(0x01)
	bool bSplineHasBeenEdited; // 0x625(0x01)
	bool bClosedLoop; // 0x626(0x01)
	struct FVector DefaultUpVector; // 0x628(0x0c)
	char UnknownData_638[0x8]; // 0x638(0x08)

	void SetWorldLocationAtSplinePoint(int32_t PointIndex, struct FVector InLocation); // Function Engine.SplineComponent.SetWorldLocationAtSplinePoint // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2da5940
	void SetUnselectedSplineSegmentColor(struct FLinearColor SegmentColor); // Function Engine.SplineComponent.SetUnselectedSplineSegmentColor // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2da55e0
	void SetTangentAtSplinePoint(int32_t PointIndex, struct FVector InTangent, char CoordinateSpace); // Function Engine.SplineComponent.SetTangentAtSplinePoint // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2da5170
	void SetSplineWorldPoints(struct TArray<struct FVector> Points); // Function Engine.SplineComponent.SetSplineWorldPoints // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x2da50b0
	void SetSplinePointType(int32_t PointIndex, char Type); // Function Engine.SplineComponent.SetSplinePointType // Final|Native|Public|BlueprintCallable // @ game+0x2da4ef0
	void SetSplinePoints(struct TArray<struct FVector> Points, char CoordinateSpace); // Function Engine.SplineComponent.SetSplinePoints // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x2da4fb0
	void SetSplineLocalPoints(struct TArray<struct FVector> Points); // Function Engine.SplineComponent.SetSplineLocalPoints // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x2da4e30
	void SetSelectedSplineSegmentColor(struct FLinearColor SegmentColor); // Function Engine.SplineComponent.SetSelectedSplineSegmentColor // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2da4bf0
	void SetLocationAtSplinePoint(int32_t PointIndex, struct FVector InLocation, char CoordinateSpace); // Function Engine.SplineComponent.SetLocationAtSplinePoint // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2da3470
	void SetDefaultUpVector(struct FVector UpVector, char CoordinateSpace); // Function Engine.SplineComponent.SetDefaultUpVector // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2da1ea0
	void SetClosedLoop(bool bInClosedLoop); // Function Engine.SplineComponent.SetClosedLoop // Final|Native|Public|BlueprintCallable // @ game+0x2da0f40
	bool IsClosedLoop(); // Function Engine.SplineComponent.IsClosedLoop // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c370
	struct FVector GetWorldTangentAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldTangentAtDistanceAlongSpline // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9bed0
	struct FRotator GetWorldRotationAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldRotationAtTime // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9bde0
	struct FRotator GetWorldRotationAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldRotationAtDistanceAlongSpline // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9bd30
	struct FVector GetWorldLocationAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldLocationAtTime // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9bc40
	struct FVector GetWorldLocationAtSplinePoint(int32_t PointIndex); // Function Engine.SplineComponent.GetWorldLocationAtSplinePoint // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9bb90
	struct FVector GetWorldLocationAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldLocationAtDistanceAlongSpline // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9bae0
	struct FVector GetWorldDirectionAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldDirectionAtTime // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9b9f0
	struct FVector GetWorldDirectionAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldDirectionAtDistanceAlongSpline // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9b940
	struct FVector GetUpVectorAtTime(float Time, char CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetUpVectorAtTime // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9b7e0
	struct FVector GetUpVectorAtSplinePoint(int32_t PointIndex, char CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtSplinePoint // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9b710
	struct FVector GetUpVectorAtDistanceAlongSpline(float Distance, char CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtDistanceAlongSpline // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9b630
	struct FTransform GetTransformAtTime(float Time, char CoordinateSpace, bool bUseConstantVelocity, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtTime // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9b4a0
	struct FTransform GetTransformAtSplinePoint(int32_t PointIndex, char CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtSplinePoint // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9b360
	struct FTransform GetTransformAtDistanceAlongSpline(float Distance, char CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtDistanceAlongSpline // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9b210
	struct FVector GetTangentAtTime(float Time, char CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetTangentAtTime // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9aef0
	struct FVector GetTangentAtSplinePoint(int32_t PointIndex, char CoordinateSpace); // Function Engine.SplineComponent.GetTangentAtSplinePoint // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9ae20
	struct FVector GetTangentAtDistanceAlongSpline(float Distance, char CoordinateSpace); // Function Engine.SplineComponent.GetTangentAtDistanceAlongSpline // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9ad40
	char GetSplinePointType(int32_t PointIndex); // Function Engine.SplineComponent.GetSplinePointType // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9acb0
	float GetSplineLength(); // Function Engine.SplineComponent.GetSplineLength // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9ac80
	struct FVector GetScaleAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetScaleAtTime // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9aad0
	struct FVector GetScaleAtSplinePoint(int32_t PointIndex); // Function Engine.SplineComponent.GetScaleAtSplinePoint // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9aa30
	struct FVector GetScaleAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetScaleAtDistanceAlongSpline // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9a990
	struct FRotator GetRotationAtTime(float Time, char CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetRotationAtTime // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9a870
	struct FRotator GetRotationAtSplinePoint(int32_t PointIndex, char CoordinateSpace); // Function Engine.SplineComponent.GetRotationAtSplinePoint // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9a7a0
	struct FRotator GetRotationAtDistanceAlongSpline(float Distance, char CoordinateSpace); // Function Engine.SplineComponent.GetRotationAtDistanceAlongSpline // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9a6c0
	float GetRollAtTime(float Time, char CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetRollAtTime // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9a5b0
	float GetRollAtSplinePoint(int32_t PointIndex, char CoordinateSpace); // Function Engine.SplineComponent.GetRollAtSplinePoint // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9a4f0
	float GetRollAtDistanceAlongSpline(float Distance, char CoordinateSpace); // Function Engine.SplineComponent.GetRollAtDistanceAlongSpline // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9a420
	struct FVector GetRightVectorAtTime(float Time, char CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetRightVectorAtTime // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9a300
	struct FVector GetRightVectorAtSplinePoint(int32_t PointIndex, char CoordinateSpace); // Function Engine.SplineComponent.GetRightVectorAtSplinePoint // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9a230
	struct FVector GetRightVectorAtDistanceAlongSpline(float Distance, char CoordinateSpace); // Function Engine.SplineComponent.GetRightVectorAtDistanceAlongSpline // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9a150
	struct FQuat GetQuaternionAtTime(float Time, char CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetQuaternionAtTime // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d999c0
	struct FQuat GetQuaternionAtSplinePoint(int32_t PointIndex, char CoordinateSpace); // Function Engine.SplineComponent.GetQuaternionAtSplinePoint // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d998f0
	struct FQuat GetQuaternionAtDistanceAlongSpline(float Distance, char CoordinateSpace); // Function Engine.SplineComponent.GetQuaternionAtDistanceAlongSpline // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d99810
	int32_t GetNumberOfSplinePoints(); // Function Engine.SplineComponent.GetNumberOfSplinePoints // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98aa0
	struct FVector GetLocationAtTime(float Time, char CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetLocationAtTime // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98300
	struct FVector GetLocationAtSplinePoint(int32_t PointIndex, char CoordinateSpace); // Function Engine.SplineComponent.GetLocationAtSplinePoint // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98230
	struct FVector GetLocationAtDistanceAlongSpline(float Distance, char CoordinateSpace); // Function Engine.SplineComponent.GetLocationAtDistanceAlongSpline // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98150
	void GetLocationAndTangentAtSplinePoint(int32_t PointIndex, struct FVector Location, struct FVector Tangent, char CoordinateSpace); // Function Engine.SplineComponent.GetLocationAndTangentAtSplinePoint // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97fe0
	void GetLocalLocationAndTangentAtSplinePoint(int32_t PointIndex, struct FVector LocalLocation, struct FVector LocalTangent); // Function Engine.SplineComponent.GetLocalLocationAndTangentAtSplinePoint // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97eb0
	float GetInputKeyAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetInputKeyAtDistanceAlongSpline // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97ce0
	float GetDistanceAlongSplineAtSplinePoint(int32_t PointIndex); // Function Engine.SplineComponent.GetDistanceAlongSplineAtSplinePoint // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97b20
	struct FVector GetDirectionAtTime(float Time, char CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetDirectionAtTime // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97a00
	struct FVector GetDirectionAtSplinePoint(int32_t PointIndex, char CoordinateSpace); // Function Engine.SplineComponent.GetDirectionAtSplinePoint // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97930
	struct FVector GetDirectionAtDistanceAlongSpline(float Distance, char CoordinateSpace); // Function Engine.SplineComponent.GetDirectionAtDistanceAlongSpline // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97850
	struct FVector GetDefaultUpVector(char CoordinateSpace); // Function Engine.SplineComponent.GetDefaultUpVector // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d977b0
	void ClearSplinePoints(); // Function Engine.SplineComponent.ClearSplinePoints // Final|Native|Public|BlueprintCallable // @ game+0x2d94640
	void AddSplineWorldPoint(struct FVector Position); // Function Engine.SplineComponent.AddSplineWorldPoint // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2d93de0
	void AddSplinePoint(struct FVector Position, char CoordinateSpace); // Function Engine.SplineComponent.AddSplinePoint // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2d93d00
	void AddSplineLocalPoint(struct FVector Position); // Function Engine.SplineComponent.AddSplineLocalPoint // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2d93c70
};

// Class Engine.ShapeComponent
// Size: 0x5e0 (Inherited: 0x5c0)
struct UShapeComponent : UPrimitiveComponent {
	struct FColor ShapeColor; // 0x5b8(0x04)
	struct UBodySetup* ShapeBodySetup; // 0x5c0(0x08)
	char bDrawOnlyIfSelected : 1; // 0x5c8(0x01)
	char bShouldCollideWhenPlacing : 1; // 0x5c8(0x01)
	char bDynamicObstacle : 1; // 0x5c8(0x01)
	char UnknownData_5CC_3 : 5; // 0x5cc(0x01)
	char UnknownData_5CD[0x3]; // 0x5cd(0x03)
	struct UClass* AreaClass; // 0x5d0(0x08)
	char UnknownData_5D8[0x8]; // 0x5d8(0x08)
};

// Class Engine.CapsuleComponent
// Size: 0x5e0 (Inherited: 0x5e0)
struct UCapsuleComponent : UShapeComponent {
	float CapsuleHalfHeight; // 0x5d8(0x04)
	float CapsuleRadius; // 0x5dc(0x04)

	void SetCapsuleSize(float InRadius, float InHalfHeight, bool bUpdateOverlaps); // Function Engine.CapsuleComponent.SetCapsuleSize // Final|Native|Public|BlueprintCallable // @ game+0x2eacbb0
	void SetCapsuleRadius(float Radius, bool bUpdateOverlaps); // Function Engine.CapsuleComponent.SetCapsuleRadius // Final|Native|Public|BlueprintCallable // @ game+0x2eacae0
	void SetCapsuleHalfHeight(float HalfHeight, bool bUpdateOverlaps); // Function Engine.CapsuleComponent.SetCapsuleHalfHeight // Final|Native|Public|BlueprintCallable // @ game+0x2eaca10
	void GetUnscaledCapsuleSize(float OutRadius, float OutHalfHeight); // Function Engine.CapsuleComponent.GetUnscaledCapsuleSize // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea6f90
	float GetUnscaledCapsuleRadius(); // Function Engine.CapsuleComponent.GetUnscaledCapsuleRadius // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea6f70
	float GetUnscaledCapsuleHalfHeight(); // Function Engine.CapsuleComponent.GetUnscaledCapsuleHalfHeight // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea6f50
	float GetShapeScale(); // Function Engine.CapsuleComponent.GetShapeScale // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea6770
	void GetScaledCapsuleSize(float OutRadius, float OutHalfHeight); // Function Engine.CapsuleComponent.GetScaledCapsuleSize // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea6610
	float GetScaledCapsuleRadius(); // Function Engine.CapsuleComponent.GetScaledCapsuleRadius // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea65c0
	float GetScaledCapsuleHalfHeight(); // Function Engine.CapsuleComponent.GetScaledCapsuleHalfHeight // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea6570
};

// Class Engine.TextureProxy
// Size: 0x140 (Inherited: 0x138)
struct UTextureProxy : UTexture {
	struct UTexture* Texture; // 0x138(0x08)
};

// Class Engine.Commandlet
// Size: 0x80 (Inherited: 0x28)
struct UCommandlet : UObject {
	struct FString HelpDescription; // 0x28(0x10)
	struct FString HelpUsage; // 0x38(0x10)
	struct FString HelpWebLink; // 0x48(0x10)
	struct TArray<struct FString> HelpParamNames; // 0x58(0x10)
	struct TArray<struct FString> HelpParamDescriptions; // 0x68(0x10)
	char IsServer : 1; // 0x78(0x01)
	char IsClient : 1; // 0x78(0x01)
	char IsEditor : 1; // 0x78(0x01)
	char LogToConsole : 1; // 0x78(0x01)
	char ShowErrorCount : 1; // 0x78(0x01)
	char UnknownData_78_5 : 3; // 0x78(0x01)
	char UnknownData_79[0x7]; // 0x79(0x07)
};

// Class Engine.InstancedStaticMeshComponent
// Size: 0x6d0 (Inherited: 0x620)
struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	struct TArray<struct FInstancedStaticMeshInstanceData> PerInstanceSMData; // 0x620(0x10)
	int32_t InstancingRandomSeed; // 0x630(0x04)
	int32_t InstanceStartCullDistance; // 0x634(0x04)
	int32_t InstanceEndCullDistance; // 0x638(0x04)
	char UnknownData_63C[0x4]; // 0x63c(0x04)
	struct TArray<int32_t> InstanceReorderTable; // 0x640(0x10)
	struct TArray<int32_t> RemovedInstances; // 0x650(0x10)
	char UnknownData_660[0x48]; // 0x660(0x48)
	struct UPhysicsSerializer* PhysicsSerializer; // 0x6a8(0x08)
	int32_t NumPendingLightmaps; // 0x6b0(0x04)
	char UnknownData_6B4[0x4]; // 0x6b4(0x04)
	struct TArray<struct FInstancedStaticMeshMappingInfo> CachedMappings; // 0x6b8(0x10)
	char UnknownData_6C8[0x8]; // 0x6c8(0x08)

	bool UpdateInstanceTransform(int32_t InstanceIndex, struct FTransform NewInstanceTransform, bool bWorldSpace, bool bMarkRenderStateDirty); // Function Engine.InstancedStaticMeshComponent.UpdateInstanceTransform // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2eb41d0
	void SetCullDistances(int32_t StartCullDistance, int32_t EndCullDistance); // Function Engine.InstancedStaticMeshComponent.SetCullDistances // Final|Native|Public|BlueprintCallable // @ game+0x2ead160
	bool RemoveInstance(int32_t InstanceIndex); // Function Engine.InstancedStaticMeshComponent.RemoveInstance // Native|Public|BlueprintCallable // @ game+0x2eaa380
	bool GetInstanceTransform(int32_t InstanceIndex, struct FTransform OutInstanceTransform, bool bWorldSpace); // Function Engine.InstancedStaticMeshComponent.GetInstanceTransform // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea4ce0
	struct TArray<int32_t> GetInstancesOverlappingSphere(struct FVector Center, float Radius, bool bSphereInWorldSpace); // Function Engine.InstancedStaticMeshComponent.GetInstancesOverlappingSphere // Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea5080
	int32_t GetInstanceCount(); // Function Engine.InstancedStaticMeshComponent.GetInstanceCount // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2ea4b60
	void EnableGPUVisibility(bool bEnable); // Function Engine.InstancedStaticMeshComponent.EnableGPUVisibility // Final|Native|Public|BlueprintCallable // @ game+0x2ea2570
	void ClearInstances(); // Function Engine.InstancedStaticMeshComponent.ClearInstances // Native|Public|BlueprintCallable // @ game+0x2ea1440
	int32_t AddInstanceWorldSpace(struct FTransform WorldTransform); // Function Engine.InstancedStaticMeshComponent.AddInstanceWorldSpace // Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2e9e920
	void AddInstances(struct TArray<struct FTransform> InstanceTransforms); // Function Engine.InstancedStaticMeshComponent.AddInstances // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x2e9ea00
	int32_t AddInstance(struct FTransform InstanceTransform); // Function Engine.InstancedStaticMeshComponent.AddInstance // Native|Public|HasOutParms|HasDefaults|BlueprintCallable // @ game+0x2e9e760
};

// Class Engine.HierarchicalInstancedStaticMeshComponent
// Size: 0x7a0 (Inherited: 0x6d0)
struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	char UnknownData_6D0[0x40]; // 0x6d0(0x40)
	struct TArray<int32_t> SortedInstances; // 0x710(0x10)
	int32_t NumBuiltInstances; // 0x720(0x04)
	struct FBox BuiltInstanceBounds; // 0x724(0x1c)
	struct FBox UnbuiltInstanceBounds; // 0x740(0x1c)
	char UnknownData_75C[0x4]; // 0x75c(0x04)
	struct TArray<struct FBox> UnbuiltInstanceBoundsList; // 0x760(0x10)
	int32_t OcclusionLayerNumNodes; // 0x770(0x04)
	char UnknownData_774[0x2]; // 0x774(0x02)
	bool bDisableCollision; // 0x776(0x01)
	char UnknownData_777[0x29]; // 0x777(0x29)

	bool RemoveInstances(struct TArray<int32_t> InstancesToRemove); // Function Engine.HierarchicalInstancedStaticMeshComponent.RemoveInstances // Final|Native|Public|HasOutParms|BlueprintCallable // @ game+0x2eaa420
};

// Class Engine.MaterialInstance
// Size: 0x1b8 (Inherited: 0x58)
struct UMaterialInstance : UMaterialInterface {
	struct UPhysicalMaterial* PhysMaterial; // 0x58(0x08)
	struct UMaterialInterface* Parent; // 0x60(0x08)
	char bHasStaticPermutationResource : 1; // 0x68(0x01)
	char UnknownData_68_1 : 1; // 0x68(0x01)
	char bOverrideSubsurfaceProfile : 1; // 0x68(0x01)
	char UnknownData_68_3 : 5; // 0x68(0x01)
	char UnknownData_69[0x7]; // 0x69(0x07)
	struct FGuid ParentLightingGuid; // 0x70(0x10)
	struct TArray<struct FFontParameterValue> FontParameterValues; // 0x80(0x10)
	struct TArray<struct FScalarParameterValue> ScalarParameterValues; // 0x90(0x10)
	struct TArray<struct FTextureParameterValue> TextureParameterValues; // 0xa0(0x10)
	struct TArray<struct FVectorParameterValue> VectorParameterValues; // 0xb0(0x10)
	struct FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0xc0(0x84)
	char UnknownData_144[0x74]; // 0x144(0x74)
};

// Class Engine.MaterialInstanceConstant
// Size: 0x1b8 (Inherited: 0x1b8)
struct UMaterialInstanceConstant : UMaterialInstance {
};

// Class Engine.MaterialExpression
// Size: 0x70 (Inherited: 0x28)
struct UMaterialExpression : UObject {
	struct UMaterial* Material; // 0x28(0x08)
	struct UMaterialFunction* Function; // 0x30(0x08)
	struct FString Desc; // 0x38(0x10)
	struct FColor BorderColor; // 0x48(0x04)
	char bRealtimePreview : 1; // 0x4c(0x01)
	char bNeedToUpdatePreview : 1; // 0x4c(0x01)
	char bIsParameterExpression : 1; // 0x4c(0x01)
	char bCommentBubbleVisible : 1; // 0x4c(0x01)
	char bShowOutputNameOnPin : 1; // 0x4c(0x01)
	char bHidePreviewWindow : 1; // 0x4c(0x01)
	char bCollapsed : 1; // 0x4c(0x01)
	char bShaderInputData : 1; // 0x4c(0x01)
	char bShowInputs : 1; // 0x4d(0x01)
	char bShowOutputs : 1; // 0x4d(0x01)
	char UnknownData_4D_2 : 6; // 0x4d(0x01)
	char UnknownData_4E[0x2]; // 0x4e(0x02)
	struct TArray<struct FText> MenuCategories; // 0x50(0x10)
	struct TArray<struct FExpressionOutput> Outputs; // 0x60(0x10)
};

// Class Engine.MaterialExpressionCustomOutput
// Size: 0x70 (Inherited: 0x70)
struct UMaterialExpressionCustomOutput : UMaterialExpression {
};

// Class Engine.BlueprintAsyncActionBase
// Size: 0x28 (Inherited: 0x28)
struct UBlueprintAsyncActionBase : UObject {

	void Activate(); // Function Engine.BlueprintAsyncActionBase.Activate // Native|Public|BlueprintCallable // @ game+0x2e9e260
};

// Class Engine.BlueprintGeneratedClass
// Size: 0x228 (Inherited: 0x1c0)
struct UBlueprintGeneratedClass : UClass {
	int32_t NumReplicatedProperties; // 0x1c0(0x04)
	char UnknownData_1C4[0x4]; // 0x1c4(0x04)
	struct TArray<struct UDynamicBlueprintBinding*> DynamicBindingObjects; // 0x1c8(0x10)
	struct TArray<struct UActorComponent*> ComponentTemplates; // 0x1d8(0x10)
	struct TArray<struct UTimelineTemplate*> Timelines; // 0x1e8(0x10)
	struct USimpleConstructionScript* SimpleConstructionScript; // 0x1f8(0x08)
	struct UInheritableComponentHandler* InheritableComponentHandler; // 0x200(0x08)
	struct UStructProperty* UberGraphFramePointerProperty; // 0x208(0x08)
	struct UFunction* UberGraphFunction; // 0x210(0x08)
	struct TArray<struct FEventGraphFastCallPair> FastCallPairs; // 0x218(0x10)
};

// Class Engine.AISystemBase
// Size: 0x40 (Inherited: 0x28)
struct UAISystemBase : UObject {
	struct FStringClassReference AISystemClassName; // 0x28(0x10)
	struct FName AISystemModuleName; // 0x38(0x08)
};

// Class Engine.UserDefinedStruct
// Size: 0xa8 (Inherited: 0x98)
struct UUserDefinedStruct : UScriptStruct {
	struct FGuid Guid; // 0x98(0x10)
};

// Class Engine.Player
// Size: 0x48 (Inherited: 0x28)
struct UPlayer : UObject {
	char UnknownData_28[0x8]; // 0x28(0x08)
	struct APlayerController* PlayerController; // 0x30(0x08)
	int32_t CurrentNetSpeed; // 0x38(0x04)
	int32_t ConfiguredInternetSpeed; // 0x3c(0x04)
	int32_t ConfiguredLanSpeed; // 0x40(0x04)
	char UnknownData_44[0x4]; // 0x44(0x04)
};

// Class Engine.NetConnection
// Size: 0x345a0 (Inherited: 0x48)
struct UNetConnection : UPlayer {
	char UnknownData_48[0x8]; // 0x48(0x08)
	struct TArray<struct UChildConnection*> Children; // 0x50(0x10)
	struct UNetDriver* Driver; // 0x60(0x08)
	struct UPackageMap* PackageMap; // 0x68(0x08)
	struct TArray<struct UChannel*> OpenChannels; // 0x70(0x10)
	struct TArray<struct AActor*> SentTemporaries; // 0x80(0x10)
	struct AActor* ViewTarget; // 0x90(0x08)
	struct AActor* OwningActor; // 0x98(0x08)
	int32_t MaxPacket; // 0xa0(0x04)
	char InternalAck : 1; // 0xa4(0x01)
	char UnknownData_A4_1 : 7; // 0xa4(0x01)
	char UnknownData_A5[0x2fb]; // 0xa5(0x2fb)
	double LastReceiveTime; // 0x3a0(0x08)
	char UnknownData_3A8[0x340b0]; // 0x3a8(0x340b0)
	struct TArray<struct AActor*> ConsideredActorsList; // 0x34458(0x10)
	char UnknownData_34468[0x10]; // 0x34468(0x10)
	int32_t MaxDormantActorsCheckedFromRelevancy; // 0x34478(0x04)
	char UnknownData_3447C[0x5c]; // 0x3447c(0x5c)
	struct TArray<struct UChannel*> DeferredCloseChannels; // 0x344d8(0x10)
	char UnknownData_344E8[0xb8]; // 0x344e8(0xb8)
};

// Class Engine.NetDriver
// Size: 0x478 (Inherited: 0x28)
struct UNetDriver : UObject {
	char UnknownData_28[0x10]; // 0x28(0x10)
	struct FString NetConnectionClassName; // 0x38(0x10)
	int32_t MaxDownloadSize; // 0x48(0x04)
	char bClampListenServerTickRate : 1; // 0x4c(0x01)
	char UnknownData_4C_1 : 7; // 0x4c(0x01)
	char UnknownData_4D[0x3]; // 0x4d(0x03)
	int32_t NetServerMaxTickRate; // 0x50(0x04)
	int32_t MaxInternetClientRate; // 0x54(0x04)
	int32_t MaxClientRate; // 0x58(0x04)
	float ServerTravelPause; // 0x5c(0x04)
	float SpawnPrioritySeconds; // 0x60(0x04)
	float RelevantTimeout; // 0x64(0x04)
	float KeepAliveTime; // 0x68(0x04)
	float InitialConnectTimeout; // 0x6c(0x04)
	float ConnectionTimeout; // 0x70(0x04)
	char UnknownData_74[0x4]; // 0x74(0x04)
	struct UNetConnection* ServerConnection; // 0x78(0x08)
	struct TArray<struct UNetConnection*> ClientConnections; // 0x80(0x10)
	struct UWorld* World; // 0x90(0x08)
	char UnknownData_98[0x30]; // 0x98(0x30)
	struct UClass* NetConnectionClass; // 0xc8(0x08)
	struct UProperty* RoleProperty; // 0xd0(0x08)
	struct UProperty* RemoteRoleProperty; // 0xd8(0x08)
	struct FName NetDriverName; // 0xe0(0x08)
	char UnknownData_E8[0x390]; // 0xe8(0x390)
};

// Class Engine.OnlineSession
// Size: 0x28 (Inherited: 0x28)
struct UOnlineSession : UObject {
};

// Class Engine.Model
// Size: 0x578 (Inherited: 0x28)
struct UModel : UObject {
	char UnknownData_28[0x550]; // 0x28(0x550)
};

// Class Engine.EdGraphNode
// Size: 0x90 (Inherited: 0x28)
struct UEdGraphNode : UObject {
	struct TArray<struct UEdGraphPin*> Pins; // 0x28(0x10)
	int32_t NodePosX; // 0x38(0x04)
	int32_t NodePosY; // 0x3c(0x04)
	int32_t NodeWidth; // 0x40(0x04)
	int32_t NodeHeight; // 0x44(0x04)
	char bHasCompilerMessage : 1; // 0x48(0x01)
	char UnknownData_48_1 : 7; // 0x48(0x01)
	char UnknownData_49[0x7]; // 0x49(0x07)
	struct FString NodeComment; // 0x50(0x10)
	bool bCommentBubblePinned; // 0x60(0x01)
	bool bCommentBubbleVisible; // 0x61(0x01)
	char UnknownData_62[0x2]; // 0x62(0x02)
	int32_t ErrorType; // 0x64(0x04)
	struct FString ErrorMsg; // 0x68(0x10)
	struct FGuid NodeGuid; // 0x78(0x10)
	char AdvancedPinDisplay; // 0x88(0x01)
	bool bIsNodeEnabled; // 0x89(0x01)
	bool bIsDebugFunction; // 0x8a(0x01)
	char UnknownData_8B[0x5]; // 0x8b(0x05)
};

// Class Engine.EdGraphPin
// Size: 0x128 (Inherited: 0x28)
struct UEdGraphPin : UObject {
	struct FString PinName; // 0x28(0x10)
	struct FString PinToolTip; // 0x38(0x10)
	char Direction; // 0x48(0x01)
	char UnknownData_49[0x7]; // 0x49(0x07)
	struct FEdGraphPinType PinType; // 0x50(0x50)
	struct FString DefaultValue; // 0xa0(0x10)
	struct FString AutogeneratedDefaultValue; // 0xb0(0x10)
	struct UObject* DefaultObject; // 0xc0(0x08)
	struct FText DefaultTextValue; // 0xc8(0x38)
	struct TArray<struct UEdGraphPin*> LinkedTo; // 0x100(0x10)
	struct TArray<struct UEdGraphPin*> SubPins; // 0x110(0x10)
	struct UEdGraphPin* ParentPin; // 0x120(0x08)
};

// Class Engine.EngineBaseTypes
// Size: 0x28 (Inherited: 0x28)
struct UEngineBaseTypes : UObject {
};

// Class Engine.DamageType
// Size: 0x40 (Inherited: 0x28)
struct UDamageType : UObject {
	char bCausedByWorld : 1; // 0x28(0x01)
	char bScaleMomentumByMass : 1; // 0x28(0x01)
	char UnknownData_28_2 : 6; // 0x28(0x01)
	char UnknownData_29[0x3]; // 0x29(0x03)
	float DamageImpulse; // 0x2c(0x04)
	char bRadialDamageVelChange : 1; // 0x30(0x01)
	char UnknownData_30_1 : 7; // 0x30(0x01)
	char UnknownData_31[0x3]; // 0x31(0x03)
	float DestructibleImpulse; // 0x34(0x04)
	float DestructibleDamageSpreadScale; // 0x38(0x04)
	float DamageFalloff; // 0x3c(0x04)
};

// Class Engine.EngineTypes
// Size: 0x28 (Inherited: 0x28)
struct UEngineTypes : UObject {
};

// Class Engine.BlueprintCore
// Size: 0x50 (Inherited: 0x28)
struct UBlueprintCore : UObject {
	struct UClass* SkeletonGeneratedClass; // 0x28(0x08)
	struct UClass* GeneratedClass; // 0x30(0x08)
	bool bLegacyNeedToPurgeSkelRefs; // 0x38(0x01)
	bool bLegacyGeneratedClassIsAuthoritative; // 0x39(0x01)
	char UnknownData_3A[0x2]; // 0x3a(0x02)
	struct FGuid BlueprintGuid; // 0x3c(0x10)
	char UnknownData_4C[0x4]; // 0x4c(0x04)
};

// Class Engine.Blueprint
// Size: 0xd8 (Inherited: 0x50)
struct UBlueprint : UBlueprintCore {
	char bRecompileOnLoad : 1; // 0x50(0x01)
	char UnknownData_50_1 : 7; // 0x50(0x01)
	char UnknownData_51[0x7]; // 0x51(0x07)
	struct UClass* ParentClass; // 0x58(0x08)
	struct UObject* PRIVATE_InnermostPreviousCDO; // 0x60(0x08)
	char bHasBeenRegenerated : 1; // 0x68(0x01)
	char bIsRegeneratingOnLoad : 1; // 0x68(0x01)
	char UnknownData_68_2 : 6; // 0x68(0x01)
	char UnknownData_69[0x7]; // 0x69(0x07)
	struct USimpleConstructionScript* SimpleConstructionScript; // 0x70(0x08)
	struct TArray<struct UActorComponent*> ComponentTemplates; // 0x78(0x10)
	struct TArray<struct UTimelineTemplate*> Timelines; // 0x88(0x10)
	struct UInheritableComponentHandler* InheritableComponentHandler; // 0x98(0x08)
	char BlueprintType; // 0xa0(0x01)
	char UnknownData_A1[0x3]; // 0xa1(0x03)
	int32_t BlueprintSystemVersion; // 0xa4(0x04)
	char UnknownData_A8[0x30]; // 0xa8(0x30)
};

// Class Engine.Interface_AssetUserData
// Size: 0x28 (Inherited: 0x28)
struct UInterface_AssetUserData : UInterface {
};

// Class Engine.ChildActorComponent
// Size: 0x300 (Inherited: 0x2e0)
struct UChildActorComponent : USceneComponent {
	struct UClass* ChildActorClass; // 0x2e0(0x08)
	struct AActor* ChildActor; // 0x2e8(0x08)
	char UnknownData_2F0[0x10]; // 0x2f0(0x10)

	void SetChildActorClass(struct UClass* InClass); // Function Engine.ChildActorComponent.SetChildActorClass // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x2c9e740
};

// Class Engine.TestInterface
// Size: 0x28 (Inherited: 0x28)
struct UTestInterface : UInterface {
};

// Class Engine.DerivedTestInterface
// Size: 0x28 (Inherited: 0x28)
struct UDerivedTestInterface : UTestInterface {
};

// Class Engine.ComponentWithDerivedTestInterface
// Size: 0xd0 (Inherited: 0xc8)
struct UComponentWithDerivedTestInterface : UActorComponent {
	char UnknownData_C8[0x8]; // 0xc8(0x08)
};

// Class Engine.ActorWithComponentWithDerivedTestInterface
// Size: 0x3d0 (Inherited: 0x3c8)
struct AActorWithComponentWithDerivedTestInterface : AActor {
	struct UComponentWithDerivedTestInterface* ComponentWithDerivedTestInterface; // 0x3c8(0x08)
};

// Class Engine.ActorWithTestInterface
// Size: 0x3d0 (Inherited: 0x3c8)
struct AActorWithTestInterface : AActor {
	char UnknownData_3C8[0x8]; // 0x3c8(0x08)
};

// Class Engine.AmbientSound
// Size: 0x3d0 (Inherited: 0x3c8)
struct AAmbientSound : AActor {
	struct UAudioComponent* AudioComponent; // 0x3c8(0x08)

	void Stop(); // Function Engine.AmbientSound.Stop // Final|Native|Public|BlueprintCallable // @ game+0x2ca0330
	void Play(float StartTime); // Function Engine.AmbientSound.Play // Final|Native|Public|BlueprintCallable // @ game+0x2c9bf50
	void FadeOut(float FadeOutDuration, float FadeVolumeLevel); // Function Engine.AmbientSound.FadeOut // Final|Native|Public|BlueprintCallable // @ game+0x2c93bd0
	void FadeIn(float FadeInDuration, float FadeVolumeLevel); // Function Engine.AmbientSound.FadeIn // Final|Native|Public|BlueprintCallable // @ game+0x2c93b10
	void AdjustVolume(float AdjustVolumeDuration, float AdjustVolumeLevel); // Function Engine.AmbientSound.AdjustVolume // Final|Native|Public|BlueprintCallable // @ game+0x2c902f0
};

// Class Engine.AutomaticInstancingActor
// Size: 0x420 (Inherited: 0x3c8)
struct AAutomaticInstancingActor : AActor {
	struct USceneComponent* DummyRoot; // 0x3c8(0x08)
	struct TMap<struct FName, struct FAutomaticInstancingMeshComponentArray> CookedInstancedStaticMeshes; // 0x3d0(0x50)
};

// Class Engine.PendingNetGame
// Size: 0x100 (Inherited: 0x28)
struct UPendingNetGame : UObject {
	char UnknownData_28[0x8]; // 0x28(0x08)
	struct UNetDriver* NetDriver; // 0x30(0x08)
	char UnknownData_38[0xb0]; // 0x38(0xb0)
	struct UPackage* PreLoadedMapPackage; // 0xe8(0x08)
	struct UWorld* PreLoadedWorld; // 0xf0(0x08)
	char UnknownData_F8[0x8]; // 0xf8(0x08)
};

// Class Engine.World
// Size: 0x7c8 (Inherited: 0x28)
struct UWorld : UObject {
	char UnknownData_28[0x8]; // 0x28(0x08)
	struct ULevel* PersistentLevel; // 0x30(0x08)
	struct UNetDriver* NetDriver; // 0x38(0x08)
	struct ULineBatchComponent* LineBatcher; // 0x40(0x08)
	struct ULineBatchComponent* PersistentLineBatcher; // 0x48(0x08)
	struct ULineBatchComponent* ForegroundLineBatcher; // 0x50(0x08)
	struct AGameState* GameState; // 0x58(0x08)
	struct AGameNetworkManager* NetworkManager; // 0x60(0x08)
	struct UPhysicsCollisionHandler* PhysicsCollisionHandler; // 0x68(0x08)
	struct TArray<struct UObject*> ExtraReferencedObjects; // 0x70(0x10)
	struct TArray<struct UObject*> PerModuleDataObjects; // 0x80(0x10)
	struct TArray<struct ULevelStreaming*> StreamingLevels; // 0x90(0x10)
	struct FString StreamingLevelsPrefix; // 0xa0(0x10)
	struct ULevel* CurrentLevelPendingVisibility; // 0xb0(0x08)
	struct AParticleEventManager* MyParticleEventManager; // 0xb8(0x08)
	struct APhysicsVolume* DefaultPhysicsVolume; // 0xc0(0x08)
	struct TArray<struct ULevelStreaming*> DirtyStreamingLevels; // 0xc8(0x10)
	char UnknownData_D8[0x1c]; // 0xd8(0x1c)
	struct FName Feature; // 0xf4(0x08)
	char UnknownData_FC[0x4]; // 0xfc(0x04)
	struct TArray<struct FName> FeatureReferences; // 0x100(0x10)
	bool ParticleLOD_bUseGameThread; // 0x110(0x01)
	bool ParticleLOD_bUseMultipleViewportCase; // 0x111(0x01)
	char UnknownData_112[0x2]; // 0x112(0x02)
	struct FVector ParticleLOD_PlayerViewpointLocation; // 0x114(0x0c)
	struct FString TestMetadata; // 0x120(0x10)
	struct UNavigationSystem* NavigationSystem; // 0x130(0x08)
	struct AGameMode* AuthorityGameMode; // 0x138(0x08)
	struct UAISystemBase* AISystem; // 0x140(0x08)
	struct UAvoidanceManager* AvoidanceManager; // 0x148(0x08)
	struct TArray<struct ULevel*> Levels; // 0x150(0x10)
	char UnknownData_160[0x50]; // 0x160(0x50)
	struct ULevel* CurrentLevel; // 0x1b0(0x08)
	char UnknownData_1B8[0x8]; // 0x1b8(0x08)
	struct UGameInstance* OwningGameInstance; // 0x1c0(0x08)
	struct TArray<struct UMaterialParameterCollectionInstance*> ParameterCollectionInstances; // 0x1c8(0x10)
	char UnknownData_1D8[0x520]; // 0x1d8(0x520)
	struct UWorldComposition* WorldComposition; // 0x6f8(0x08)
	char UnknownData_700[0x3d]; // 0x700(0x3d)
	char UnknownData_73D_0 : 7; // 0x73d(0x01)
	char bAreConstraintsDirty : 1; // 0x73d(0x01)
	char UnknownData_73E[0x8a]; // 0x73e(0x8a)
};

// Class Engine.Level
// Size: 0x300 (Inherited: 0x28)
struct ULevel : UObject {
	char UnknownData_28[0xa0]; // 0x28(0xa0)
	struct ULevelActorContainer* ActorCluster; // 0xc8(0x08)
	struct UWorld* OwningWorld; // 0xd0(0x08)
	struct UModel* Model; // 0xd8(0x08)
	struct TArray<struct UModelComponent*> ModelComponents; // 0xe0(0x10)
	struct ALevelScriptActor* LevelScriptActor; // 0xf0(0x08)
	struct ANavigationObjectBase* NavListStart; // 0xf8(0x08)
	struct ANavigationObjectBase* NavListEnd; // 0x100(0x08)
	struct TArray<struct UNavigationDataChunk*> NavDataChunks; // 0x108(0x10)
	float LightmapTotalSize; // 0x118(0x04)
	float ShadowmapTotalSize; // 0x11c(0x04)
	struct TArray<struct FVector> StaticNavigableGeometry; // 0x120(0x10)
	char UnknownData_130[0x130]; // 0x130(0x130)
	bool LevelVisibility; // 0x260(0x01)
	char UnknownData_261[0xf]; // 0x261(0x0f)
	char UnknownData_270_0 : 3; // 0x270(0x01)
	char Blocked : 1; // 0x270(0x01)
	char UnknownData_270_4 : 4; // 0x270(0x01)
	char UnknownData_271[0x67]; // 0x271(0x67)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x2d8(0x10)
	char UnknownData_2E8[0x18]; // 0x2e8(0x18)
};

// Class Engine.BrushShape
// Size: 0x400 (Inherited: 0x400)
struct ABrushShape : ABrush {
};

// Class Engine.AudioVolume
// Size: 0x450 (Inherited: 0x400)
struct AAudioVolume : AVolume {
	float Priority; // 0x400(0x04)
	char bEnabled : 1; // 0x404(0x01)
	char UnknownData_404_1 : 7; // 0x404(0x01)
	char UnknownData_405[0x3]; // 0x405(0x03)
	struct FReverbSettings Settings; // 0x408(0x18)
	struct FInteriorSettings AmbientZoneSettings; // 0x420(0x24)
	char UnknownData_444[0x4]; // 0x444(0x04)
	struct AAudioVolume* NextLowerPriorityVolume; // 0x448(0x08)
};

// Class Engine.CameraBlockingVolume
// Size: 0x400 (Inherited: 0x400)
struct ACameraBlockingVolume : AVolume {
};

// Class Engine.CullDistanceVolume
// Size: 0x418 (Inherited: 0x400)
struct ACullDistanceVolume : AVolume {
	struct TArray<struct FCullDistanceSizePair> CullDistances; // 0x400(0x10)
	char bEnabled : 1; // 0x410(0x01)
	char UnknownData_410_1 : 7; // 0x410(0x01)
	char UnknownData_411[0x7]; // 0x411(0x07)
};

// Class Engine.FFTWater
// Size: 0x410 (Inherited: 0x400)
struct AFFTWater : AVolume {
	struct UFFTWaterComponent* FFTWaterComponent; // 0x400(0x08)
	struct UFFTWaterExtendedPlaneComponent* ExtendedPlaneComponent; // 0x408(0x08)

	bool ValidateVertexBuffer(); // Function Engine.FFTWater.ValidateVertexBuffer // Final|Native|Public|BlueprintCallable // @ game+0x2ca0a10
	bool ValidateParticlesVelocity(); // Function Engine.FFTWater.ValidateParticlesVelocity // Final|Native|Public|BlueprintCallable // @ game+0x2ca09e0
	bool ValidateIndexBuffer(); // Function Engine.FFTWater.ValidateIndexBuffer // Final|Native|Public|BlueprintCallable // @ game+0x2ca09b0
	void SetWireframe(bool bWireframe); // Function Engine.FFTWater.SetWireframe // Final|Native|Public|BlueprintCallable // @ game+0x2c9fdb0
	void SetWaterColour(struct FLinearColor WaterColour); // Function Engine.FFTWater.SetWaterColour // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9fd30
	void SetSpecularBrightness(float SpecularBrightness); // Function Engine.FFTWater.SetSpecularBrightness // Final|Native|Public|BlueprintCallable // @ game+0x2c9f7b0
	void SetShallowWaterColour(struct FLinearColor ShallowWaterColour); // Function Engine.FFTWater.SetShallowWaterColour // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9f730
	void SetReflectionBrightness(float ReflectionBrightness); // Function Engine.FFTWater.SetReflectionBrightness // Final|Native|Public|BlueprintCallable // @ game+0x2c9f500
	void SetLightFunctionMaterial(struct UMaterialInterface* Material); // Function Engine.FFTWater.SetLightFunctionMaterial // Final|Native|Public|BlueprintCallable // @ game+0x2c9f230
	void SetFresnelPower(float FresnelPower); // Function Engine.FFTWater.SetFresnelPower // Final|Native|Public|BlueprintCallable // @ game+0x2c9ec20
	void SetFoamHighlightColour(struct FLinearColor FoamHighlightColour); // Function Engine.FFTWater.SetFoamHighlightColour // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9eba0
	void SetFoamColour(struct FLinearColor FoamColour); // Function Engine.FFTWater.SetFoamColour // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9eb20
	void SetFoamBrightness(float FoamBrightness); // Function Engine.FFTWater.SetFoamBrightness // Final|Native|Public|BlueprintCallable // @ game+0x2c9eaa0
	void SetCausticsDepth(float Depth); // Function Engine.FFTWater.SetCausticsDepth // Final|Native|Public|BlueprintCallable // @ game+0x2c9e6c0
	void SetBackLitColour(struct FLinearColor BackLitColour); // Function Engine.FFTWater.SetBackLitColour // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9e640
	void SetAmbientColour(struct FLinearColor AmbientColour); // Function Engine.FFTWater.SetAmbientColour // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9e420
	bool HasLightFunctionMaterial(); // Function Engine.FFTWater.HasLightFunctionMaterial // Final|Native|Public|BlueprintCallable // @ game+0x2c977e0
	struct UFFTWaterComponent* GetComponent(); // Function Engine.FFTWater.GetComponent // Final|Native|Public|BlueprintCallable|BlueprintPure // @ game+0x2c94580
};

// Class Engine.LevelStreamingVolume
// Size: 0x418 (Inherited: 0x400)
struct ALevelStreamingVolume : AVolume {
	struct TArray<struct FName> StreamingLevelNames; // 0x400(0x10)
	char bEditorPreVisOnly : 1; // 0x410(0x01)
	char bDisabled : 1; // 0x410(0x01)
	char UnknownData_410_2 : 6; // 0x410(0x01)
	char UnknownData_411[0x3]; // 0x411(0x03)
	char StreamingUsage; // 0x414(0x01)
	char UnknownData_415[0x3]; // 0x415(0x03)
};

// Class Engine.LightmassCharacterIndirectDetailVolume
// Size: 0x400 (Inherited: 0x400)
struct ALightmassCharacterIndirectDetailVolume : AVolume {
};

// Class Engine.LightmassImportanceVolume
// Size: 0x400 (Inherited: 0x400)
struct ALightmassImportanceVolume : AVolume {
};

// Class Engine.NavigationTypes
// Size: 0x28 (Inherited: 0x28)
struct UNavigationTypes : UObject {
};

// Class Engine.NavMeshBoundsVolume
// Size: 0x410 (Inherited: 0x400)
struct ANavMeshBoundsVolume : AVolume {
	struct FNavAgentSelector SupportedAgents; // 0x400(0x04)
	struct FName OriginatingLevelName; // 0x404(0x08)
	char UnknownData_40C[0x4]; // 0x40c(0x04)
};

// Class Engine.InstancedNavMeshBoundsVolume
// Size: 0x410 (Inherited: 0x410)
struct AInstancedNavMeshBoundsVolume : ANavMeshBoundsVolume {
};

// Class Engine.NavArea
// Size: 0x40 (Inherited: 0x28)
struct UNavArea : UObject {
	float DefaultCost; // 0x28(0x04)
	float FixedAreaEnteringCost; // 0x2c(0x04)
	struct FColor DrawColor; // 0x30(0x04)
	struct FNavAgentSelector SupportedAgents; // 0x34(0x04)
	char bSupportsAgent0 : 1; // 0x38(0x01)
	char bSupportsAgent1 : 1; // 0x38(0x01)
	char bSupportsAgent2 : 1; // 0x38(0x01)
	char bSupportsAgent3 : 1; // 0x38(0x01)
	char bSupportsAgent4 : 1; // 0x38(0x01)
	char bSupportsAgent5 : 1; // 0x38(0x01)
	char bSupportsAgent6 : 1; // 0x38(0x01)
	char bSupportsAgent7 : 1; // 0x38(0x01)
	char bSupportsAgent8 : 1; // 0x39(0x01)
	char bSupportsAgent9 : 1; // 0x39(0x01)
	char bSupportsAgent10 : 1; // 0x39(0x01)
	char bSupportsAgent11 : 1; // 0x39(0x01)
	char bSupportsAgent12 : 1; // 0x39(0x01)
	char bSupportsAgent13 : 1; // 0x39(0x01)
	char bSupportsAgent14 : 1; // 0x39(0x01)
	char bSupportsAgent15 : 1; // 0x39(0x01)
	char UnknownData_3A[0x6]; // 0x3a(0x06)
};

// Class Engine.NavRelevantInterface
// Size: 0x28 (Inherited: 0x28)
struct UNavRelevantInterface : UInterface {
};

// Class Engine.NavModifierVolume
// Size: 0x410 (Inherited: 0x400)
struct ANavModifierVolume : AVolume {
	char UnknownData_400[0x8]; // 0x400(0x08)
	struct UClass* AreaClass; // 0x408(0x08)

	void SetAreaClass(struct UClass* NewAreaClass); // Function Engine.NavModifierVolume.SetAreaClass // Final|Native|Public|BlueprintCallable // @ game+0x2c9e4a0
};

// Class Engine.DefaultPhysicsVolume
// Size: 0x410 (Inherited: 0x410)
struct ADefaultPhysicsVolume : APhysicsVolume {
};

// Class Engine.KillZVolume
// Size: 0x410 (Inherited: 0x410)
struct AKillZVolume : APhysicsVolume {
};

// Class Engine.PainCausingVolume
// Size: 0x438 (Inherited: 0x410)
struct APainCausingVolume : APhysicsVolume {
	char bPainCausing : 1; // 0x410(0x01)
	char UnknownData_410_1 : 7; // 0x410(0x01)
	char UnknownData_411[0x3]; // 0x411(0x03)
	float DamagePerSec; // 0x414(0x04)
	struct UClass* DamageType; // 0x418(0x08)
	float PainInterval; // 0x420(0x04)
	char bEntryPain : 1; // 0x424(0x01)
	char BACKUP_bPainCausing : 1; // 0x424(0x01)
	char UnknownData_424_2 : 6; // 0x424(0x01)
	char UnknownData_425[0x3]; // 0x425(0x03)
	struct AController* DamageInstigator; // 0x428(0x08)
	char UnknownData_430[0x8]; // 0x430(0x08)
};

// Class Engine.BlendableInterface
// Size: 0x28 (Inherited: 0x28)
struct UBlendableInterface : UInterface {
};

// Class Engine.Scene
// Size: 0x28 (Inherited: 0x28)
struct UScene : UObject {
};

// Class Engine.Interface_PostProcessVolume
// Size: 0x28 (Inherited: 0x28)
struct UInterface_PostProcessVolume : UInterface {
};

// Class Engine.PostProcessVolume
// Size: 0x960 (Inherited: 0x400)
struct APostProcessVolume : AVolume {
	char UnknownData_400[0x10]; // 0x400(0x10)
	struct FPostProcessSettings Settings; // 0x410(0x540)
	float Priority; // 0x950(0x04)
	float BlendRadius; // 0x954(0x04)
	float BlendWeight; // 0x958(0x04)
	char bEnabled : 1; // 0x95c(0x01)
	char bUnbound : 1; // 0x95c(0x01)
	char UnknownData_95C_2 : 6; // 0x95c(0x01)
	char UnknownData_95D[0x3]; // 0x95d(0x03)

	void AddOrUpdateBlendable(TScriptInterface<struct UBlendableInterface> InBlendableObject, float InWeight); // Function Engine.PostProcessVolume.AddOrUpdateBlendable // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x2c8fda0
};

// Class Engine.PrecomputedVisibilityOverrideVolume
// Size: 0x430 (Inherited: 0x400)
struct APrecomputedVisibilityOverrideVolume : AVolume {
	struct TArray<struct AActor*> OverrideVisibleActors; // 0x400(0x10)
	struct TArray<struct AActor*> OverrideInvisibleActors; // 0x410(0x10)
	struct TArray<struct FName> OverrideInvisibleLevels; // 0x420(0x10)
};

// Class Engine.PrecomputedVisibilityVolume
// Size: 0x400 (Inherited: 0x400)
struct APrecomputedVisibilityVolume : AVolume {
};

// Class Engine.TriggerVolume
// Size: 0x400 (Inherited: 0x400)
struct ATriggerVolume : AVolume {
};

// Class Engine.CalmWaterZone
// Size: 0x3d0 (Inherited: 0x3c8)
struct ACalmWaterZone : AActor {
	struct UCalmWaterComponent* CalmWaterComponent; // 0x3c8(0x08)
};

// Class Engine.CameraActor
// Size: 0x930 (Inherited: 0x3c8)
struct ACameraActor : AActor {
	char AutoActivateForPlayer; // 0x3c8(0x01)
	char UnknownData_3C9[0x7]; // 0x3c9(0x07)
	struct UCameraComponent* CameraComponent; // 0x3d0(0x08)
	char UnknownData_3D8[0x8]; // 0x3d8(0x08)
	char bConstrainAspectRatio : 1; // 0x3e0(0x01)
	char UnknownData_3E0_1 : 7; // 0x3e0(0x01)
	char UnknownData_3E1[0x3]; // 0x3e1(0x03)
	float AspectRatio; // 0x3e4(0x04)
	float FOVAngle; // 0x3e8(0x04)
	float PostProcessBlendWeight; // 0x3ec(0x04)
	struct FPostProcessSettings PostProcessSettings; // 0x3f0(0x540)

	int32_t GetAutoActivatePlayerIndex(); // Function Engine.CameraActor.GetAutoActivatePlayerIndex // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94340
};

// Class Engine.ClientOnlyTestActor
// Size: 0x3c8 (Inherited: 0x3c8)
struct AClientOnlyTestActor : AActor {
};

// Class Engine.NavAgentInterface
// Size: 0x28 (Inherited: 0x28)
struct UNavAgentInterface : UInterface {
};

// Class Engine.CameraShake
// Size: 0x140 (Inherited: 0x28)
struct UCameraShake : UObject {
	char bSingleInstance : 1; // 0x28(0x01)
	char UnknownData_28_1 : 7; // 0x28(0x01)
	char UnknownData_29[0x3]; // 0x29(0x03)
	float OscillationDuration; // 0x2c(0x04)
	float OscillationBlendInTime; // 0x30(0x04)
	float OscillationBlendOutTime; // 0x34(0x04)
	struct FROscillator RotOscillation; // 0x38(0x24)
	struct FVOscillator LocOscillation; // 0x5c(0x24)
	struct FFOscillator FOVOscillation; // 0x80(0x0c)
	float AnimPlayRate; // 0x8c(0x04)
	float AnimScale; // 0x90(0x04)
	float AnimBlendInTime; // 0x94(0x04)
	float AnimBlendOutTime; // 0x98(0x04)
	float RandomAnimSegmentDuration; // 0x9c(0x04)
	struct UCameraAnim* Anim; // 0xa0(0x08)
	char bRandomAnimSegment : 1; // 0xa8(0x01)
	char UnknownData_A8_1 : 7; // 0xa8(0x01)
	char UnknownData_A9[0x17]; // 0xa9(0x17)
	struct APlayerCameraManager* CameraOwner; // 0xc0(0x08)
	char UnknownData_C8[0x68]; // 0xc8(0x68)
	float ShakeScale; // 0x130(0x04)
	float OscillatorTimeRemaining; // 0x134(0x04)
	struct UCameraAnimInst* AnimInst; // 0x138(0x08)

	void ReceiveStopShake(); // Function Engine.CameraShake.ReceiveStopShake // Event|Public|BlueprintEvent // @ game+0x1848130
	void ReceivePlayShake(float Scale); // Function Engine.CameraShake.ReceivePlayShake // Event|Public|BlueprintEvent // @ game+0x1848130
	bool ReceiveIsFinished(); // Function Engine.CameraShake.ReceiveIsFinished // Native|Event|Public|BlueprintEvent|Const // @ game+0x2c9cc30
	void BlueprintUpdateCameraShake(float DeltaTime, float Alpha, struct FMinimalViewInfo POV, struct FMinimalViewInfo ModifiedPOV); // Function Engine.CameraShake.BlueprintUpdateCameraShake // Event|Public|HasOutParms|BlueprintEvent // @ game+0x1848130
};

// Class Engine.PlayerCameraManager
// Size: 0x1c50 (Inherited: 0x3c8)
struct APlayerCameraManager : AActor {
	struct APlayerController* PCOwner; // 0x3c8(0x08)
	struct USceneComponent* TransformComponent; // 0x3d0(0x08)
	char UnknownData_3D8[0x8]; // 0x3d8(0x08)
	float DefaultFOV; // 0x3e0(0x04)
	char UnknownData_3E4[0x4]; // 0x3e4(0x04)
	float DefaultOrthoWidth; // 0x3e8(0x04)
	char UnknownData_3EC[0x4]; // 0x3ec(0x04)
	float DefaultAspectRatio; // 0x3f0(0x04)
	char UnknownData_3F4[0x4c]; // 0x3f4(0x4c)
	struct FCameraCacheEntry CameraCache; // 0x440(0x5b0)
	struct FCameraCacheEntry LastFrameCameraCache; // 0x9f0(0x5b0)
	struct FTViewTarget ViewTarget; // 0xfa0(0x5c0)
	struct FTViewTarget PendingViewTarget; // 0x1560(0x5c0)
	char UnknownData_1B20[0x18]; // 0x1b20(0x18)
	struct TArray<struct UCameraModifier*> ModifierList; // 0x1b38(0x10)
	struct TArray<struct UClass*> DefaultModifiers; // 0x1b48(0x10)
	float FreeCamDistance; // 0x1b58(0x04)
	struct FVector FreeCamOffset; // 0x1b5c(0x0c)
	struct FVector ViewTargetOffset; // 0x1b68(0x0c)
	char UnknownData_1B74[0x14]; // 0x1b74(0x14)
	struct TArray<struct AEmitterCameraLensEffectBase*> CameraLensEffects; // 0x1b88(0x10)
	struct UCameraModifier_CameraShake* CachedCameraShakeMod; // 0x1b98(0x08)
	struct UCameraAnimInst* AnimInstPool[0x08]; // 0x1ba0(0x40)
	struct TArray<struct FPostProcessSettings> PostProcessBlendCache; // 0x1be0(0x10)
	char UnknownData_1BF0[0x10]; // 0x1bf0(0x10)
	struct TArray<struct UCameraAnimInst*> ActiveAnims; // 0x1c00(0x10)
	struct TArray<struct UCameraAnimInst*> FreeAnims; // 0x1c10(0x10)
	struct ACameraActor* AnimCameraActor; // 0x1c20(0x08)
	char bIsOrthographic : 1; // 0x1c28(0x01)
	char UnknownData_1C28_1 : 5; // 0x1c28(0x01)
	char bUseClientSideCameraUpdates : 1; // 0x1c28(0x01)
	char UnknownData_1C29_0 : 5; // 0x1c29(0x01)
	char bFollowHmdOrientation : 1; // 0x1c29(0x01)
	char UnknownData_1C29_6 : 2; // 0x1c29(0x01)
	char UnknownData_1C2A[0x2]; // 0x1c2a(0x02)
	float ViewPitchMin; // 0x1c2c(0x04)
	float ViewPitchMax; // 0x1c30(0x04)
	float ViewYawMin; // 0x1c34(0x04)
	float ViewYawMax; // 0x1c38(0x04)
	float ViewRollMin; // 0x1c3c(0x04)
	float ViewRollMax; // 0x1c40(0x04)
	char UnknownData_1C44[0xc]; // 0x1c44(0x0c)

	void StopCameraShake(struct UCameraShake* ShakeInstance); // Function Engine.PlayerCameraManager.StopCameraShake // Native|Public|BlueprintCallable // @ game+0x2ca0650
	void StopCameraFade(); // Function Engine.PlayerCameraManager.StopCameraFade // Native|Public|BlueprintCallable // @ game+0x2ca0630
	void StopCameraAnimInst(struct UCameraAnimInst* AnimInst, bool bImmediate); // Function Engine.PlayerCameraManager.StopCameraAnimInst // Native|Public|BlueprintCallable // @ game+0x2ca0560
	void StopAllInstancesOfCameraShake(struct UClass* Shake); // Function Engine.PlayerCameraManager.StopAllInstancesOfCameraShake // Native|Public|BlueprintCallable // @ game+0x2ca04d0
	void StopAllInstancesOfCameraAnim(struct UCameraAnim* Anim, bool bImmediate); // Function Engine.PlayerCameraManager.StopAllInstancesOfCameraAnim // Native|Public|BlueprintCallable // @ game+0x2ca0400
	void StopAllCameraShakes(); // Function Engine.PlayerCameraManager.StopAllCameraShakes // Native|Public|BlueprintCallable // @ game+0x2ca03e0
	void StopAllCameraAnims(bool bImmediate); // Function Engine.PlayerCameraManager.StopAllCameraAnims // Native|Public|BlueprintCallable // @ game+0x2ca0350
	void StartCameraFade(float FromAlpha, float ToAlpha, float Duration, struct FLinearColor Color, bool bShouldFadeAudio, bool bHoldWhenFinished); // Function Engine.PlayerCameraManager.StartCameraFade // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2ca00e0
	void SetManualCameraFade(float InFadeAmount, struct FLinearColor Color, bool bInFadeAudio); // Function Engine.PlayerCameraManager.SetManualCameraFade // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9f2b0
	bool RemoveCameraModifier(struct UCameraModifier* ModifierToRemove); // Function Engine.PlayerCameraManager.RemoveCameraModifier // Native|Public|BlueprintCallable // @ game+0x2c9ccf0
	void RemoveCameraLensEffect(struct AEmitterCameraLensEffectBase* Emitter); // Function Engine.PlayerCameraManager.RemoveCameraLensEffect // Native|Public|BlueprintCallable // @ game+0x2c9cc60
	struct UCameraShake* PlayCameraShake(struct UClass* ShakeClass, float Scale, char PlaySpace, struct FRotator UserPlaySpaceRot); // Function Engine.PlayerCameraManager.PlayCameraShake // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9c2f0
	struct UCameraAnimInst* PlayCameraAnim(struct UCameraAnim* Anim, float Rate, float Scale, float BlendInTime, float BlendOutTime, bool bLoop, bool bRandomStartTime, float Duration, char PlaySpace, struct FRotator UserPlaySpaceRot, struct UCurveFloat* BlendInCurve); // Function Engine.PlayerCameraManager.PlayCameraAnim // Native|Public|HasDefaults|BlueprintCallable // @ game+0x2c9bfd0
	bool IsScreenFullyOccluded(); // Function Engine.PlayerCameraManager.IsScreenFullyOccluded // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97d40
	bool IsFadeInProgress(); // Function Engine.PlayerCameraManager.IsFadeInProgress // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c97a90
	struct APlayerController* GetOwningPlayerController(); // Function Engine.PlayerCameraManager.GetOwningPlayerController // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c96c50
	float GetFOVAngle(); // Function Engine.PlayerCameraManager.GetFOVAngle // Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c95100
	struct FRotator GetCameraRotation(); // Function Engine.PlayerCameraManager.GetCameraRotation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c943b0
	struct FVector GetCameraLocation(); // Function Engine.PlayerCameraManager.GetCameraLocation // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2c94370
	struct UCameraModifier* FindCameraModifierByClass(struct UClass* ModifierClass); // Function Engine.PlayerCameraManager.FindCameraModifierByClass // Native|Public|BlueprintCallable // @ game+0x2c93c90
	void ClearCameraLensEffects(); // Function Engine.PlayerCameraManager.ClearCameraLensEffects // Native|Public|BlueprintCallable // @ game+0x2c90780
	bool BlueprintUpdateCamera(struct AActor* CameraTarget, struct FVector NewCameraLocation, struct FRotator NewCameraRotation, float NewCameraFOV); // Function Engine.PlayerCameraManager.BlueprintUpdateCamera // BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintEvent // @ game+0x1848130
	void BlendOutAllInstancesOfCameraShake(struct UClass* Shake); // Function Engine.PlayerCameraManager.BlendOutAllInstancesOfCameraShake // Native|Public|BlueprintCallable // @ game+0x2c90610
	struct UCameraModifier* AddNewCameraModifier(struct UClass* ModifierClass); // Function Engine.PlayerCameraManager.AddNewCameraModifier // Native|Public|BlueprintCallable // @ game+0x2c8fd00
	struct AEmitterCameraLensEffectBase* AddCameraLensEffect(struct UClass* LensEffectEmitterClass); // Function Engine.PlayerCameraManager.AddCameraLensEffect // Native|Public|BlueprintCallable // @ game+0x2c8faa0
};

// Class Engine.CurveBase
// Size: 0x30 (Inherited: 0x28)
struct UCurveBase : UObject {
	char UnknownData_28[0x8]; // 0x28(0x08)

	void GetValueRange(float MinValue, float MaxValue); // Function Engine.CurveBase.GetValueRange // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c974e0
	void GetTimeRange(float MinTime, float MaxTime); // Function Engine.CurveBase.GetTimeRange // Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const // @ game+0x2c971e0
};

// Class Engine.CurveFloat
// Size: 0xb0 (Inherited: 0x30)
struct UCurveFloat : UCurveBase {
	struct FRichCurve FloatCurve; // 0x30(0x78)
	bool bIsEventCurve; // 0xa8(0x01)
	char UnknownData_A9[0x7]; // 0xa9(0x07)

	float GetFloatValue(float InTime); // Function Engine.CurveFloat.GetFloatValue // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2c95140
};

// Class Engine.ForceFeedbackEffect
// Size: 0x40 (Inherited: 0x28)
struct UForceFeedbackEffect : UObject {
	struct TArray<struct FForceFeedbackChannelDetails> ChannelDetails; // 0x28(0x10)
	float Duration; // 0x38(0x04)
	char UnknownData_3C[0x4]; // 0x3c(0x04)
};

// Class Engine.LogVisualizerCameraController
// Size: 0x7d8 (Inherited: 0x7c0)
struct ALogVisualizerCameraController : ADebugCameraController {
	struct AActor* PickedActor; // 0x7c0(0x08)
	char UnknownData_7C8[0x10]; // 0x7c8(0x10)
};

// Class Engine.DecalActor
// Size: 0x3d0 (Inherited: 0x3c8)
struct ADecalActor : AActor {
	struct UDecalComponent* Decal; // 0x3c8(0x08)

	void SetDecalMaterial(struct UMaterialInterface* NewDecalMaterial); // Function Engine.DecalActor.SetDecalMaterial // Final|Native|Public|BlueprintCallable // @ game+0x2da1e20
	struct UMaterialInterface* GetDecalMaterial(); // Function Engine.DecalActor.GetDecalMaterial // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d976e0
	struct UMaterialInstanceDynamic* CreateDynamicMaterialInstance(); // Function Engine.DecalActor.CreateDynamicMaterialInstance // Native|Public|BlueprintCallable // @ game+0x2d94bf0
};

// Class Engine.DestructibleActor
// Size: 0x3e8 (Inherited: 0x3c8)
struct ADestructibleActor : AActor {
	struct UDestructibleComponent* DestructibleComponent; // 0x3c8(0x08)
	char bAffectNavigation : 1; // 0x3d0(0x01)
	char UnknownData_3D0_1 : 7; // 0x3d0(0x01)
	char UnknownData_3D1[0x7]; // 0x3d1(0x07)
	struct FMulticastDelegate OnActorFracture; // 0x3d8(0x10)
};

// Class Engine.DocumentationActor
// Size: 0x3d0 (Inherited: 0x3c8)
struct ADocumentationActor : AActor {
	char UnknownData_3C8[0x8]; // 0x3c8(0x08)
};

// Class Engine.Emitter
// Size: 0x418 (Inherited: 0x3c8)
struct AEmitter : AActor {
	struct UParticleSystemComponent* ParticleSystemComponent; // 0x3c8(0x08)
	char bDestroyOnSystemFinish : 1; // 0x3d0(0x01)
	char bPostUpdateTickGroup : 1; // 0x3d0(0x01)
	char bCurrentlyActive : 1; // 0x3d0(0x01)
	char UnknownData_3D0_3 : 5; // 0x3d0(0x01)
	char UnknownData_3D1[0x7]; // 0x3d1(0x07)
	struct FMulticastDelegate OnParticleSpawn; // 0x3d8(0x10)
	struct FMulticastDelegate OnParticleBurst; // 0x3e8(0x10)
	struct FMulticastDelegate OnParticleDeath; // 0x3f8(0x10)
	struct FMulticastDelegate OnParticleCollide; // 0x408(0x10)

	void ToggleActive(); // Function Engine.Emitter.ToggleActive // Final|Native|Public|BlueprintCallable // @ game+0x2da6170
	void SetVectorParameter(struct FName ParameterName, struct FVector Param); // Function Engine.Emitter.SetVectorParameter // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da5700
	void SetTemplate(struct UParticleSystem* NewTemplate); // Function Engine.Emitter.SetTemplate // Native|Public|BlueprintCallable // @ game+0x2da5300
	void SetMaterialParameter(struct FName ParameterName, struct UMaterialInterface* Param); // Function Engine.Emitter.SetMaterialParameter // Final|Native|Public|BlueprintCallable // @ game+0x2da39b0
	void SetFloatParameter(struct FName ParameterName, float Param); // Function Engine.Emitter.SetFloatParameter // Final|Native|Public|BlueprintCallable // @ game+0x2da2320
	void SetColorParameter(struct FName ParameterName, struct FLinearColor Param); // Function Engine.Emitter.SetColorParameter // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da1320
	void SetActorParameter(struct FName ParameterName, struct AActor* Param); // Function Engine.Emitter.SetActorParameter // Final|Native|Public|BlueprintCallable // @ game+0x2d9ed60
	void OnRep_bCurrentlyActive(); // Function Engine.Emitter.OnRep_bCurrentlyActive // Native|Public // @ game+0x2d9db70
	void OnParticleSystemFinished(struct UParticleSystemComponent* FinishedComponent); // Function Engine.Emitter.OnParticleSystemFinished // Native|Public // @ game+0x2d9d8a0
	bool IsActive(); // Function Engine.Emitter.IsActive // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d9c2b0
	struct FName GetEmitterName(); // Function Engine.Emitter.GetEmitterName // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97bb0
	void Deactivate(); // Function Engine.Emitter.Deactivate // Final|Native|Public|BlueprintCallable // @ game+0x2d94e50
	void Activate(); // Function Engine.Emitter.Activate // Final|Native|Public|BlueprintCallable // @ game+0x2d92800
};

// Class Engine.EmitterCameraLensEffectBase
// Size: 0x450 (Inherited: 0x418)
struct AEmitterCameraLensEffectBase : AEmitter {
	struct UParticleSystem* PS_CameraEffect; // 0x418(0x08)
	struct UParticleSystem* PS_CameraEffectNonExtremeContent; // 0x420(0x08)
	float BaseFOV; // 0x428(0x04)
	float DistFromCamera; // 0x42c(0x04)
	char bAllowMultipleInstances : 1; // 0x430(0x01)
	char UnknownData_430_1 : 7; // 0x430(0x01)
	char UnknownData_431[0x7]; // 0x431(0x07)
	struct TArray<struct UClass*> EmittersToTreatAsSame; // 0x438(0x10)
	struct APlayerCameraManager* BaseCamera; // 0x448(0x08)
};

// Class Engine.DebugCameraHUD
// Size: 0x4c0 (Inherited: 0x4c0)
struct ADebugCameraHUD : AHUD {
};

// Class Engine.LogVisualizerHUD
// Size: 0x4e8 (Inherited: 0x4c0)
struct ALogVisualizerHUD : ADebugCameraHUD {
	char UnknownData_4C0[0x28]; // 0x4c0(0x28)
};

// Class Engine.AtmosphericFog
// Size: 0x3d0 (Inherited: 0x3c8)
struct AAtmosphericFog : AInfo {
	struct UAtmosphericFogComponent* AtmosphericFogComponent; // 0x3c8(0x08)
};

// Class Engine.ExponentialHeightFog
// Size: 0x3d8 (Inherited: 0x3c8)
struct AExponentialHeightFog : AInfo {
	struct UExponentialHeightFogComponent* Component; // 0x3c8(0x08)
	char bEnabled : 1; // 0x3d0(0x01)
	char UnknownData_3D0_1 : 7; // 0x3d0(0x01)
	char UnknownData_3D1[0x7]; // 0x3d1(0x07)

	void OnRep_bEnabled(); // Function Engine.ExponentialHeightFog.OnRep_bEnabled // Native|Public // @ game+0x2d9db90
};

// Class Engine.NavigationObjectBase
// Size: 0x3f0 (Inherited: 0x3c8)
struct ANavigationObjectBase : AActor {
	char UnknownData_3C8[0x8]; // 0x3c8(0x08)
	struct UCapsuleComponent* CapsuleComponent; // 0x3d0(0x08)
	struct UBillboardComponent* GoodSprite; // 0x3d8(0x08)
	struct UBillboardComponent* BadSprite; // 0x3e0(0x08)
	char bIsPIEPlayerStart : 1; // 0x3e8(0x01)
	char UnknownData_3E8_1 : 7; // 0x3e8(0x01)
	char UnknownData_3E9[0x7]; // 0x3e9(0x07)
};

// Class Engine.PlayerStart
// Size: 0x3f8 (Inherited: 0x3f0)
struct APlayerStart : ANavigationObjectBase {
	struct FName PlayerStartTag; // 0x3f0(0x08)
};

// Class Engine.GameNetworkManager
// Size: 0x438 (Inherited: 0x3c8)
struct AGameNetworkManager : AInfo {
	int32_t AdjustedNetSpeed; // 0x3c8(0x04)
	float LastNetSpeedUpdateTime; // 0x3cc(0x04)
	int32_t TotalNetBandwidth; // 0x3d0(0x04)
	int32_t MinDynamicBandwidth; // 0x3d4(0x04)
	int32_t MaxDynamicBandwidth; // 0x3d8(0x04)
	char bIsStandbyCheckingEnabled : 1; // 0x3dc(0x01)
	char bHasStandbyCheatTriggered : 1; // 0x3dc(0x01)
	char UnknownData_3DC_2 : 6; // 0x3dc(0x01)
	char UnknownData_3DD[0x3]; // 0x3dd(0x03)
	float StandbyRxCheatTime; // 0x3e0(0x04)
	float StandbyTxCheatTime; // 0x3e4(0x04)
	int32_t BadPingThreshold; // 0x3e8(0x04)
	float PercentMissingForRxStandby; // 0x3ec(0x04)
	float PercentMissingForTxStandby; // 0x3f0(0x04)
	float PercentForBadPing; // 0x3f4(0x04)
	float JoinInProgressStandbyWaitTime; // 0x3f8(0x04)
	float MoveRepSize; // 0x3fc(0x04)
	float MAXPOSITIONERRORSQUARED; // 0x400(0x04)
	float MAXNEARZEROVELOCITYSQUARED; // 0x404(0x04)
	float CLIENTADJUSTUPDATECOST; // 0x408(0x04)
	float MAXCLIENTUPDATEINTERVAL; // 0x40c(0x04)
	float MaxMoveDeltaTime; // 0x410(0x04)
	bool ClientAuthorativePosition; // 0x414(0x01)
	char UnknownData_415[0x3]; // 0x415(0x03)
	float ClientErrorUpdateRateLimit; // 0x418(0x04)
	bool bMovementTimeDiscrepancyDetection; // 0x41c(0x01)
	bool bMovementTimeDiscrepancyResolution; // 0x41d(0x01)
	char UnknownData_41E[0x2]; // 0x41e(0x02)
	float MovementTimeDiscrepancyMaxTimeMargin; // 0x420(0x04)
	float MovementTimeDiscrepancyMinTimeMargin; // 0x424(0x04)
	float MovementTimeDiscrepancyResolutionRate; // 0x428(0x04)
	float MovementTimeDiscrepancyDriftAllowance; // 0x42c(0x04)
	bool bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x430(0x01)
	bool bUseDistanceBasedRelevancy; // 0x431(0x01)
	char UnknownData_432[0x6]; // 0x432(0x06)
};

// Class Engine.GameSession
// Size: 0x3f8 (Inherited: 0x3c8)
struct AGameSession : AInfo {
	int32_t MaxSpectators; // 0x3c8(0x04)
	int32_t MaxPlayers; // 0x3cc(0x04)
	char MaxSplitscreensPerConnection; // 0x3d0(0x01)
	bool bRequiresPushToTalk; // 0x3d1(0x01)
	char UnknownData_3D2[0x2]; // 0x3d2(0x02)
	struct FName SessionName; // 0x3d4(0x08)
	char UnknownData_3DC[0x1c]; // 0x3dc(0x1c)
};

// Class Engine.SkyLight
// Size: 0x3d8 (Inherited: 0x3c8)
struct ASkyLight : AInfo {
	struct USkyLightComponent* LightComponent; // 0x3c8(0x08)
	char bEnabled : 1; // 0x3d0(0x01)
	char UnknownData_3D0_1 : 7; // 0x3d0(0x01)
	char UnknownData_3D1[0x7]; // 0x3d1(0x07)

	void OnRep_bEnabled(); // Function Engine.SkyLight.OnRep_bEnabled // Native|Public // @ game+0x2d9dbb0
};

// Class Engine.WindDirectionalSource
// Size: 0x3d0 (Inherited: 0x3c8)
struct AWindDirectionalSource : AInfo {
	struct UWindDirectionalSourceComponent* Component; // 0x3c8(0x08)

	struct UWindDirectionalSourceComponent* GetComponent(); // Function Engine.WindDirectionalSource.GetComponent // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97470
};

// Class Engine.LevelBounds
// Size: 0x3d0 (Inherited: 0x3c8)
struct ALevelBounds : AActor {
	bool bAutoUpdateBounds; // 0x3c8(0x01)
	char UnknownData_3C9[0x7]; // 0x3c9(0x07)
};

// Class Engine.LightComponentBase
// Size: 0x310 (Inherited: 0x2e0)
struct ULightComponentBase : USceneComponent {
	struct FGuid LightGuid; // 0x2e0(0x10)
	float Brightness; // 0x2f0(0x04)
	float Intensity; // 0x2f4(0x04)
	struct FColor LightColor; // 0x2f8(0x04)
	char bAffectsWorld : 1; // 0x2fc(0x01)
	char CastShadows : 1; // 0x2fc(0x01)
	char CastStaticShadows : 1; // 0x2fc(0x01)
	char CastDynamicShadows : 1; // 0x2fc(0x01)
	char bAffectTranslucentLighting : 1; // 0x2fc(0x01)
	char bPrecomputedLightingIsValid : 1; // 0x2fc(0x01)
	char RainOcclusion : 1; // 0x2fc(0x01)
	char UnknownData_2FD[0x3]; // 0x2fd(0x03)
	float IndirectLightingIntensity; // 0x300(0x04)
	float ScaleForTranslucency; // 0x304(0x04)
	float CapForTranslucency; // 0x308(0x04)
	char UnknownData_30C[0x4]; // 0x30c(0x04)

	void SetCastShadows(bool bNewValue); // Function Engine.LightComponentBase.SetCastShadows // Final|Native|Public|BlueprintCallable // @ game+0x2da0c20
	struct FLinearColor GetLightColor(); // Function Engine.LightComponentBase.GetLightColor // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97e30
};

// Class Engine.LightComponent
// Size: 0x470 (Inherited: 0x310)
struct ULightComponent : ULightComponentBase {
	float Temperature; // 0x310(0x04)
	char bUseTemperature : 1; // 0x314(0x01)
	char UnknownData_314_1 : 7; // 0x314(0x01)
	char UnknownData_315[0x3]; // 0x315(0x03)
	int32_t ShadowMapChannel; // 0x318(0x04)
	char UnknownData_31C[0x4]; // 0x31c(0x04)
	float SourceRadius; // 0x320(0x04)
	float MinRoughness; // 0x324(0x04)
	float ShadowBias; // 0x328(0x04)
	float ShadowSharpen; // 0x32c(0x04)
	float ShadowResMaxDynamicDegradation; // 0x330(0x04)
	char InverseSquaredFalloff : 1; // 0x334(0x01)
	char CastTranslucentShadows : 1; // 0x334(0x01)
	char bCastShadowsFromCinematicObjectsOnly : 1; // 0x334(0x01)
	char bAffectDynamicIndirectLighting : 1; // 0x334(0x01)
	char UnknownData_334_4 : 4; // 0x334(0x01)
	char UnknownData_335[0x3]; // 0x335(0x03)
	struct UMaterialInterface* LightFunctionMaterial; // 0x338(0x08)
	struct FVector LightFunctionScale; // 0x340(0x0c)
	char UnknownData_34C[0x4]; // 0x34c(0x04)
	struct UTextureLightProfile* IESTexture; // 0x350(0x08)
	char bUseIESBrightness : 1; // 0x358(0x01)
	char UnknownData_358_1 : 7; // 0x358(0x01)
	char UnknownData_359[0x3]; // 0x359(0x03)
	float IESBrightnessScale; // 0x35c(0x04)
	float LightFunctionFadeDistance; // 0x360(0x04)
	float DisabledBrightness; // 0x364(0x04)
	char bEnableLightShaftBloom : 1; // 0x368(0x01)
	char UnknownData_368_1 : 7; // 0x368(0x01)
	char UnknownData_369[0x3]; // 0x369(0x03)
	float BloomScale; // 0x36c(0x04)
	float BloomThreshold; // 0x370(0x04)
	struct FColor BloomTint; // 0x374(0x04)
	bool bUseRayTracedDistanceFieldShadows; // 0x378(0x01)
	char UnknownData_379[0x3]; // 0x379(0x03)
	float RayStartOffsetDepthScale; // 0x37c(0x04)
	char UnknownData_380[0xf0]; // 0x380(0xf0)

	void SetTemperature(float NewTemperature); // Function Engine.LightComponent.SetTemperature // Final|Native|Public|BlueprintCallable // @ game+0x2da5280
	void SetLightFunctionScale(struct FVector NewLightFunctionScale); // Function Engine.LightComponent.SetLightFunctionScale // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da2cb0
	void SetLightFunctionMaterial(struct UMaterialInterface* NewLightFunctionMaterial); // Function Engine.LightComponent.SetLightFunctionMaterial // Final|Native|Public|BlueprintCallable // @ game+0x2da2ba0
	void SetLightFunctionFadeDistance(float NewLightFunctionFadeDistance); // Function Engine.LightComponent.SetLightFunctionFadeDistance // Final|Native|Public|BlueprintCallable // @ game+0x2da2aa0
	void SetLightFunctionDisabledBrightness(float NewValue); // Function Engine.LightComponent.SetLightFunctionDisabledBrightness // Final|Native|Public|BlueprintCallable // @ game+0x2da29a0
	void SetLightColor(struct FLinearColor NewLightColor, bool bSRGB); // Function Engine.LightComponent.SetLightColor // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da2850
	void SetIntensity(float NewIntensity); // Function Engine.LightComponent.SetIntensity // Final|Native|Public|BlueprintCallable // @ game+0x2da2750
	void SetIndirectLightingIntensity(float NewIntensity); // Function Engine.LightComponent.SetIndirectLightingIntensity // Final|Native|Public|BlueprintCallable // @ game+0x2da2650
	void SetIESTexture(struct UTextureLightProfile* NewValue); // Function Engine.LightComponent.SetIESTexture // Final|Native|Public|BlueprintCallable // @ game+0x2da25d0
	void SetEnableLightShaftBloom(bool bNewValue); // Function Engine.LightComponent.SetEnableLightShaftBloom // Final|Native|Public|BlueprintCallable // @ game+0x2da2200
	void SetBloomTint(struct FColor NewValue); // Function Engine.LightComponent.SetBloomTint // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da0980
	void SetBloomThreshold(float NewValue); // Function Engine.LightComponent.SetBloomThreshold // Final|Native|Public|BlueprintCallable // @ game+0x2da0900
	void SetBloomScale(float NewValue); // Function Engine.LightComponent.SetBloomScale // Final|Native|Public|BlueprintCallable // @ game+0x2da0880
	void SetAffectTranslucentLighting(bool bNewValue); // Function Engine.LightComponent.SetAffectTranslucentLighting // Final|Native|Public|BlueprintCallable // @ game+0x2d9f000
	void SetAffectDynamicIndirectLighting(bool bNewValue); // Function Engine.LightComponent.SetAffectDynamicIndirectLighting // Final|Native|Public|BlueprintCallable // @ game+0x2d9eee0
	int32_t GetNumberOfShadowCastersInFirstCascade(); // Function Engine.LightComponent.GetNumberOfShadowCastersInFirstCascade // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d98a70
};

// Class Engine.Light
// Size: 0x3d0 (Inherited: 0x3c8)
struct ALight : AActor {
	struct ULightComponent* LightComponent; // 0x3c8(0x08)

	void SetLightFunctionScale(struct FVector NewLightFunctionScale); // Function Engine.Light.SetLightFunctionScale // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da2c20
	void SetLightFunctionMaterial(struct UMaterialInterface* NewLightFunctionMaterial); // Function Engine.Light.SetLightFunctionMaterial // Final|Native|Public|BlueprintCallable // @ game+0x2da2b20
	void SetLightFunctionFadeDistance(float NewLightFunctionFadeDistance); // Function Engine.Light.SetLightFunctionFadeDistance // Final|Native|Public|BlueprintCallable // @ game+0x2da2a20
	void SetLightColor(struct FLinearColor NewLightColor); // Function Engine.Light.SetLightColor // Final|Native|Public|HasDefaults|BlueprintCallable // @ game+0x2da27d0
	void SetCastShadows(bool bNewValue); // Function Engine.Light.SetCastShadows // Final|Native|Public|BlueprintCallable // @ game+0x2da0b90
	void SetBrightness(float NewBrightness); // Function Engine.Light.SetBrightness // Final|Native|Public|BlueprintCallable // @ game+0x2da09f0
	void SetAffectTranslucentLighting(bool bNewValue); // Function Engine.Light.SetAffectTranslucentLighting // Final|Native|Public|BlueprintCallable // @ game+0x2d9ef70
	struct FLinearColor GetLightColor(); // Function Engine.Light.GetLightColor // Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97df0
	float GetBrightness(); // Function Engine.Light.GetBrightness // Final|Native|Public|BlueprintCallable|BlueprintPure|Const // @ game+0x2d97130
};

// Class Engine.AmbientLightSource
// Size: 0x3d8 (Inherited: 0x3d0)
struct AAmbientLightSource : ALight {
	struct UAmbientLightSourceComponent* AmbientLightSourceComponent; // 0x3d0(0x08)
};

// Class Engine.DirectionalLight
// Size: 0x3d0 (Inherited: 0x3d0)
struct ADirectionalLight : ALight {
};

// Class Engine.PointLight
// Size: 0x3d8 (Inherited: 0x3d0)
struct APointLight : ALight {
	struct UPointLightComponent* PointLightComponent; // 0x3d0(0x08)

	void SetRadius(float NewRadius); // Function Engine.PointLight.SetRadius // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x2da4930
	void SetLightFalloffExponent(float NewLightFalloffExponent); // Function Engine.PointLight.SetLightFalloffExponent // Final|RequiredAPI|Native|Public|BlueprintCallable // @ game+0x2da2920
};

// Class Engine.SpotLight
// Size: 0x3d8 (Inherited: 0x3d0)
struct ASpotLight : ALight {
	struct USpotLightComponent* SpotLightComponent; // 0x3d0(0x08)

	void SetOuterConeAngle(float NewOuterConeAngle); // Function Engine.SpotLight.SetOuterConeAngle // Final|Native|Public|BlueprintCallable // @ game+0x2da3de0
	void SetInnerConeAngle(float NewInnerConeAngle); // Function Engine.SpotLight.SetInnerConeAngle // Final|Native|Public|BlueprintCallable // @ game+0x2da26d0
};

// Class Engine.GeneratedMeshAreaLight
// Size: 0x3d8 (Inherited: 0x3d8)
struct AGeneratedMeshAreaLight : ASpotLight {
};

// Class Engine.LODActor
// Size: 0x400 (Inherited: 0x3c8)
struct ALODActor : AActor {
	struct UStaticMeshComponent* StaticMeshComponent; // 0x3c8(0x08)
	struct TArray<struct AActor*> SubActors; // 0x3d0(0x10)
	float LODDrawDistance; // 0x3e0(0x04)
	int32_t LodLevel; // 0x3e4(0x04)
	struct TArray<struct UObject*> SubObjects; // 0x3e8(0x10)
	char UnknownData_3F8[0x8]; // 0x3f8(0x08)
};

// Class Engine.MaterialInstanceActor
// Size: 0x3d8 (Inherited: 0x3c8)
struct AMaterialInstanceActor : AActor {
	struct TArray<struct AActor*> TargetActors; // 0x3c8(0x10)
};

// Class Engine.MatineeActor
// Size: 0x440 (Inherited: 0x3c8)
struct AMatineeActor : AActor {
	struct UInterpData* MatineeData; // 0x3c8(0x08)
	struct FName MatineeControllerName; // 0x3d0(0x08)
	float PlayRate; // 0x3d8(0x04)
	char bPlayOnLevelLoad : 1; // 0x3dc(0x01)
	char bForceStartPos : 1; // 0x3dc(0x01)
	char UnknownData_3DC_2 : 6; // 0x3dc(0x01)
	char UnknownData_3DD[0x3]; // 0x3dd(0x03)
	float ForceStartPosition; // 0x3e0(0x04)
	char bLooping : 1; // 0x3e4(0x01)
	char bRewindOnPlay : 1; // 0x3e4(0x01)
	char bNoResetOnRewind : 1; // 0x3e4(0x01)
	char bRewindIfAlreadyPlaying : 1; // 0x3e4(0x01)
	char bDisableRadioFilter : 1; // 0x3e4(0x01)
	char bClientSideOnly : 1; // 0x3e4(0x01)
	char bSkipUpdateIfNotVisible : 1; // 0x3e4(0x01)
	char bIsSkippable : 1; // 0x3e4(0x01)
	char UnknownData_3E5[0x3]; // 0x3e5(0x03)
	int32_t PreferredSplitScreenNum; // 0x3e8(0x04)
	char bDisableMovementInput : 1; // 0x3ec(0x01)
	char bDisableLookAtInput : 1; // 0x3ec(0x01)
	char bHidePlayer : 1; // 0x3ec(0x01)
	char bHideHud : 1; // 0x3ec(0x01)
	char UnknownData_3EC_4 : 4; // 0x3ec(0x01)
	char UnknownData_3ED[0x3]; // 0x3ed(0x03)
	struct TArray<struct FInterpGroupActorInfo> GroupActorInfos; // 0x3f0(0x10)
	char bShouldShowGore : 1; // 0x400(0x01)
	char UnknownData_400_1 : 7; // 0x400(0x01)
	char UnknownData_401[0x7]; // 0x401(0x07)
	struct TArray<struct UInterpGroupInst*> GroupInst; // 0x408(0x10)
	struct TArray<struct FCameraCutInfo> CameraCuts; // 0x418(0x10)
	char bIsPlaying : 1; // 0x428(0x01)
	char bReversePlayback : 1; // 0x428(0x01)
	char bPaused : 1; // 0x428(0x01)
	char bPendingStop : 1; // 0x428(0x01)
	char UnknownData_428_4 : 4; // 0x428(0x01)
	char UnknownData_429[0x3]; // 0x429(0x03)
	float InterpPosition; // 0x42c(0x04)
	char UnknownData_430[0x4]; // 0x430(0x04)
	char ReplicationForceIsPlaying; // 0x434(0x01)
	char UnknownData_435[0x7]; // 0x435(0x07)
	char bServerInitialLevelStreamingComplete : 1; // 0x43c(0x01)
	char UnknownData_43C_1 : 7; // 0x43c(0x01)
	char UnknownData_43D[0x3]; // 0x43d(0x03)

	void Stop(); // Function Engine.MatineeActor.Stop // Native|Public|BlueprintCallable // @ game+0x2da5f40
	void SetPosition(float NewPosition, bool bJump); // Function Engine.MatineeActor.SetPosition // Native|Public|BlueprintCallable // @ game+0x2da4790
	void SetLoopingState(bool bNewLooping); // Function Engine.MatineeActor.SetLoopingState // Native|Public|BlueprintCallable // @ game+0x2da3600
	void Reverse(); // Function Engine.MatineeActor.Reverse // Native|Public|BlueprintCallable // @ game+0x2d9ec40
	void PlayInstantly(); // Function Engine.MatineeActor.PlayInstantly // Final|Native|Public|BlueprintCallable // @ game+0x2d9e2f0
	void Play(struct UObject* WorldContextObject, struct FLatentActionInfo LatentInfo); // Function Engine.MatineeActor.Play // Final|Native|Public|BlueprintCallable // @ game+0x2d9df90
	void Pause(); // Function Engine.MatineeActor.Pause // Native|Public|BlueprintCallable // @ game+0x2d9dd70
	void ChangePlaybackDirection(); // Function Engine.MatineeActor.ChangePlaybackDirection // Native|Public|BlueprintCallable // @ game+0x2d944e0
};

// Class Engine.MatineeActorCameraAnim
// Size: 0x448 (Inherited: 0x440)
struct AMatineeActorCameraAnim : AMatineeActor {
	struct UCameraAnim* CameraAnim; // 0x440(0x08)
};

// Class Engine.MergedCollisionActor
// Size: 0x3d0 (Inherited: 0x3c8)
struct AMergedCollisionActor : AActor {
