// Class Slate.ButtonWidgetStyle
// Size: 0x2d8 (Inherited: 0x30)
struct UButtonWidgetStyle : USlateWidgetStyleContainerBase {
	struct FButtonStyle ButtonStyle; // 0x30(0x2a8)
};

// Class Slate.CheckBoxWidgetStyle
// Size: 0x620 (Inherited: 0x30)
struct UCheckBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FCheckBoxStyle CheckBoxStyle; // 0x30(0x5f0)
};

// Class Slate.ComboBoxWidgetStyle
// Size: 0x458 (Inherited: 0x30)
struct UComboBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FComboBoxStyle ComboBoxStyle; // 0x30(0x428)
};

// Class Slate.ComboButtonWidgetStyle
// Size: 0x410 (Inherited: 0x30)
struct UComboButtonWidgetStyle : USlateWidgetStyleContainerBase {
	struct FComboButtonStyle ComboButtonStyle; // 0x30(0x3e0)
};

// Class Slate.EditableTextBoxWidgetStyle
// Size: 0x890 (Inherited: 0x30)
struct UEditableTextBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FEditableTextBoxStyle EditableTextBoxStyle; // 0x30(0x860)
};

// Class Slate.EditableTextWidgetStyle
// Size: 0x258 (Inherited: 0x30)
struct UEditableTextWidgetStyle : USlateWidgetStyleContainerBase {
	struct FEditableTextStyle EditableTextStyle; // 0x30(0x228)
};

// Class Slate.ProgressWidgetStyle
// Size: 0x1e8 (Inherited: 0x30)
struct UProgressWidgetStyle : USlateWidgetStyleContainerBase {
	struct FProgressBarStyle ProgressBarStyle; // 0x30(0x1b8)
};

// Class Slate.ScrollBarWidgetStyle
// Size: 0x548 (Inherited: 0x30)
struct UScrollBarWidgetStyle : USlateWidgetStyleContainerBase {
	struct FScrollBarStyle ScrollBarStyle; // 0x30(0x518)
};

// Class Slate.ScrollBoxWidgetStyle
// Size: 0x278 (Inherited: 0x30)
struct UScrollBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FScrollBoxStyle ScrollBoxStyle; // 0x30(0x248)
};

// Class Slate.SpinBoxWidgetStyle
// Size: 0x348 (Inherited: 0x30)
struct USpinBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FSpinBoxStyle SpinBoxStyle; // 0x30(0x318)
};

// Class Slate.TextBlockWidgetStyle
// Size: 0x190 (Inherited: 0x30)
struct UTextBlockWidgetStyle : USlateWidgetStyleContainerBase {
	struct FTextBlockStyle TextBlockStyle; // 0x30(0x160)
};

