// BlueprintGeneratedClass wld_shp_rocks_cluster_01.wld_shp_rocks_cluster_01_C
// Size: 0x450 (Inherited: 0x408)
struct Awld_shp_rocks_cluster_01_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wld_rock_xlarge_04_b; // 0x408(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__e; // 0x410(0x08)
	struct UStaticMeshComponent* wld_rock_small_01__d; // 0x418(0x08)
	struct UStaticMeshComponent* wld_rock_small_01__a; // 0x420(0x08)
	struct UStaticMeshComponent* wld_rock_medium_01__b; // 0x428(0x08)
	struct UStaticMeshComponent* wld_rock_medium_01__a; // 0x430(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__a; // 0x438(0x08)
	struct UStaticMeshComponent* wsp_cavern_roof_rock_02; // 0x440(0x08)
	struct USceneComponent* Scene; // 0x448(0x08)

	void UserConstructionScript(); // Function wld_shp_rocks_cluster_01.wld_shp_rocks_cluster_01_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

