// BlueprintGeneratedClass wld_beach_rocks_08.wld_beach_rocks_08_C
// Size: 0x470 (Inherited: 0x408)
struct Awld_beach_rocks_08_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wld_rock_small_01__d; // 0x408(0x08)
	struct UStaticMeshComponent* wld_rock_small_01__a; // 0x410(0x08)
	struct UStaticMeshComponent* wld_rock_medium_01__a1; // 0x418(0x08)
	struct UStaticMeshComponent* wld_rock_medium_01__e1; // 0x420(0x08)
	struct UStaticMeshComponent* wld_rock_medium_01__d; // 0x428(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__c; // 0x430(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__b; // 0x438(0x08)
	struct UStaticMeshComponent* wld_rock_medium_01__a; // 0x440(0x08)
	struct UStaticMeshComponent* wld_rock_medium_01__e; // 0x448(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__a; // 0x450(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__c1; // 0x458(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__b1; // 0x460(0x08)
	struct USceneComponent* SharedRoot; // 0x468(0x08)

	void UserConstructionScript(); // Function wld_beach_rocks_08.wld_beach_rocks_08_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

