// BlueprintGeneratedClass wld_palm_cluster_03_a.wld_palm_cluster_03_a_C
// Size: 0x470 (Inherited: 0x408)
struct Awld_palm_cluster_03_a_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wld_plant_01_a; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_bush_fern_01_a; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent022; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x438(0x08)
	struct UNonVagueNonUniqueLandmarkComponent* NonVagueNonUniqueLandmark; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x460(0x08)
	struct USceneComponent* Scene; // 0x468(0x08)

	void UserConstructionScript(); // Function wld_palm_cluster_03_a.wld_palm_cluster_03_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

