// BlueprintGeneratedClass wld_sea_rock_cluster_b.wld_sea_rock_cluster_b_C
// Size: 0x428 (Inherited: 0x3c8)
struct Awld_sea_rock_cluster_b_C : AActor {
	struct UStaticMeshComponent* wld_rock_xlarge_04_a; // 0x3c8(0x08)
	struct UStaticMeshComponent* wld_rock_xlarge_02_a; // 0x3d0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x3f8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x400(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x418(0x08)
	struct USceneComponent* SharedRoot; // 0x420(0x08)

	void UserConstructionScript(); // Function wld_sea_rock_cluster_b.wld_sea_rock_cluster_b_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

