// BlueprintGeneratedClass wld_palm_cluster_01_a.wld_palm_cluster_01_a_C
// Size: 0x450 (Inherited: 0x408)
struct Awld_palm_cluster_01_a_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wsp_tree_palm_02_b; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small_e; // 0x410(0x08)
	struct UNonVagueNonUniqueLandmarkComponent* NonVagueNonUniqueLandmark; // 0x418(0x08)
	struct UStaticMeshComponent* wsp_bush_01_a_02; // 0x420(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small_a_01; // 0x428(0x08)
	struct UStaticMeshComponent* wsp_tree_palm_02_a_02; // 0x430(0x08)
	struct UStaticMeshComponent* wsp_tre_palm_02_a_01; // 0x438(0x08)
	struct UStaticMeshComponent* wsp_bush_01_a_01; // 0x440(0x08)
	struct USceneComponent* Scene; // 0x448(0x08)

	void UserConstructionScript(); // Function wld_palm_cluster_01_a.wld_palm_cluster_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

