// BlueprintGeneratedClass wld_shp_rocks_cluster_02.wld_shp_rocks_cluster_02_C
// Size: 0x448 (Inherited: 0x408)
struct Awld_shp_rocks_cluster_02_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wld_rock_xlarge_05_a; // 0x408(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__c; // 0x410(0x08)
	struct UStaticMeshComponent* wld_rock_xlarge_04_a; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x438(0x08)
	struct USceneComponent* Scene; // 0x440(0x08)

	void UserConstructionScript(); // Function wld_shp_rocks_cluster_02.wld_shp_rocks_cluster_02_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

