// BlueprintGeneratedClass wld_beach_rocks_03.wld_beach_rocks_03_C
// Size: 0x468 (Inherited: 0x408)
struct Awld_beach_rocks_03_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wld_rock_medium_01__a; // 0x408(0x08)
	struct UStaticMeshComponent* wld_rock_small_01__d; // 0x410(0x08)
	struct UStaticMeshComponent* wld_rock_small_01__c; // 0x418(0x08)
	struct UStaticMeshComponent* wld_rock_small_01__b; // 0x420(0x08)
	struct UStaticMeshComponent* wld_rock_small_01__a; // 0x428(0x08)
	struct UStaticMeshComponent* wld_rock_medium_01__b; // 0x430(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__a; // 0x438(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__e; // 0x440(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__d; // 0x448(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__c; // 0x450(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__b; // 0x458(0x08)
	struct USceneComponent* Scene; // 0x460(0x08)

	void UserConstructionScript(); // Function wld_beach_rocks_03.wld_beach_rocks_03_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

