// BlueprintGeneratedClass wld_shp_rocks_cluster_03.wld_shp_rocks_cluster_03_C
// Size: 0x448 (Inherited: 0x408)
struct Awld_shp_rocks_cluster_03_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x408(0x08)
	struct UStaticMeshComponent* wld_rock_xlarge_02_c; // 0x410(0x08)
	struct UStaticMeshComponent* wld_rock_xlarge_05_a; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x438(0x08)
	struct USceneComponent* SharedRoot; // 0x440(0x08)

	void UserConstructionScript(); // Function wld_shp_rocks_cluster_03.wld_shp_rocks_cluster_03_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

