// BlueprintGeneratedClass wld_beach_rocks_01_a.wld_beach_rocks_01_a_C
// Size: 0x488 (Inherited: 0x408)
struct Awld_beach_rocks_01_a_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wld_rock_large_01__b; // 0x408(0x08)
	struct UStaticMeshComponent* wld_rock_small_01__d; // 0x410(0x08)
	struct UStaticMeshComponent* wld_rock_small_01__c; // 0x418(0x08)
	struct UStaticMeshComponent* wld_rock_small_01__b; // 0x420(0x08)
	struct UStaticMeshComponent* wld_rock_xlarge_06_a; // 0x428(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__e; // 0x430(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__a; // 0x438(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__c; // 0x440(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_d_01; // 0x448(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_h_01; // 0x450(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_g_01; // 0x458(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_b_01; // 0x460(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_c_01; // 0x468(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_a_01; // 0x470(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_f_01; // 0x478(0x08)
	struct USceneComponent* SharedRoot; // 0x480(0x08)

	void UserConstructionScript(); // Function wld_beach_rocks_01_a.wld_beach_rocks_01_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

