// BlueprintGeneratedClass wld_bush_cluster_02_a.wld_bush_cluster_02_a_C
// Size: 0x450 (Inherited: 0x408)
struct Awld_bush_cluster_02_a_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wsp_rock_pebbles_d_01; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_f_01; // 0x410(0x08)
	struct UStaticMeshComponent* wld_bush_01_a_01; // 0x418(0x08)
	struct UStaticMeshComponent* wsp_cave_tunnel_wall_rock_01_a; // 0x420(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small_b_01; // 0x428(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small_d_01; // 0x430(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles_c_01; // 0x438(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small_a_01; // 0x440(0x08)
	struct USceneComponent* SharedRoot; // 0x448(0x08)

	void UserConstructionScript(); // Function wld_bush_cluster_02_a.wld_bush_cluster_02_a_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

