// BlueprintGeneratedClass wld_beach_rocks_02.wld_beach_rocks_02_C
// Size: 0x460 (Inherited: 0x408)
struct Awld_beach_rocks_02_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wld_rock_large_01__c1; // 0x408(0x08)
	struct UStaticMeshComponent* wld_rock_small_01__b; // 0x410(0x08)
	struct UStaticMeshComponent* wld_rock_small_01__c1; // 0x418(0x08)
	struct UStaticMeshComponent* wld_rock_small_01__c; // 0x420(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__c; // 0x428(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__d; // 0x430(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__b; // 0x438(0x08)
	struct UStaticMeshComponent* wld_rock_large_01__a; // 0x440(0x08)
	struct UStaticMeshComponent* wld_rock_xlarge_04_a; // 0x448(0x08)
	struct UStaticMeshComponent* wld_rock_medium_01__e; // 0x450(0x08)
	struct USceneComponent* Scene; // 0x458(0x08)

	void UserConstructionScript(); // Function wld_beach_rocks_02.wld_beach_rocks_02_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

