// BlueprintGeneratedClass wsp_palm_cluster_03_d.wsp_palm_cluster_03_d_C
// Size: 0x490 (Inherited: 0x408)
struct Awsp_palm_cluster_03_d_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wsp_flower_01_a; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__e; // 0x410(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__f; // 0x418(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__h; // 0x420(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__g; // 0x428(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__b; // 0x430(0x08)
	struct UStaticMeshComponent* wsp_rock_pebbles__a; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent011; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x468(0x08)
	struct UNonVagueNonUniqueLandmarkComponent* NonVagueNonUniqueLandmark; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x480(0x08)
	struct USceneComponent* SharedRoot; // 0x488(0x08)

	void UserConstructionScript(); // Function wsp_palm_cluster_03_d.wsp_palm_cluster_03_d_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

