// BlueprintGeneratedClass wsp_palm_cluster_03_e.wsp_palm_cluster_03_e_C
// Size: 0x480 (Inherited: 0x408)
struct Awsp_palm_cluster_03_e_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wsp_bush_fern_01_a1; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_bush_fern_01_a; // 0x410(0x08)
	struct UStaticMeshComponent* wsp_bush_elephant_01_a; // 0x418(0x08)
	struct UStaticMeshComponent* wsp_bush_03_a4; // 0x420(0x08)
	struct UStaticMeshComponent* wsp_bush_03_a3; // 0x428(0x08)
	struct UStaticMeshComponent* wsp_bush_03_a2; // 0x430(0x08)
	struct UStaticMeshComponent* wsp_bush_03_a1; // 0x438(0x08)
	struct UStaticMeshComponent* wsp_bush_03_a; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x458(0x08)
	struct UNonVagueNonUniqueLandmarkComponent* NonVagueNonUniqueLandmark; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMeshComponent015; // 0x478(0x08)

	void UserConstructionScript(); // Function wsp_palm_cluster_03_e.wsp_palm_cluster_03_e_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

