// BlueprintGeneratedClass wsp_bush_cluster_01_g.wsp_bush_cluster_01_g_C
// Size: 0x448 (Inherited: 0x408)
struct Awsp_bush_cluster_01_g_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wsp_bush_fern_01_a; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_bush_01_a25_1; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x438(0x08)
	struct UStaticMeshComponent* wsp_bush_01_a20_1; // 0x440(0x08)

	void UserConstructionScript(); // Function wsp_bush_cluster_01_g.wsp_bush_cluster_01_g_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

