// BlueprintGeneratedClass wsp_beach_rocks_04_b.wsp_beach_rocks_04_b_C
// Size: 0x4b8 (Inherited: 0x408)
struct Awsp_beach_rocks_04_b_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* StaticMesh22; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMesh20; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMesh19; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMesh18; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMesh17; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMesh16; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMesh15; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x458(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x460(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x468(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x470(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x478(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x480(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x488(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x490(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x498(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x4a0(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x4a8(0x08)
	struct USceneComponent* Scene; // 0x4b0(0x08)

	void UserConstructionScript(); // Function wsp_beach_rocks_04_b.wsp_beach_rocks_04_b_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

