// BlueprintGeneratedClass wsp_mushroom_glow_01_c.wsp_mushroom_glow_01_c_C
// Size: 0x450 (Inherited: 0x408)
struct Awsp_mushroom_glow_01_c_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x440(0x08)
	struct USceneComponent* SharedRoot; // 0x448(0x08)

	void UserConstructionScript(); // Function wsp_mushroom_glow_01_c.wsp_mushroom_glow_01_c_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

