// BlueprintGeneratedClass wsp_beach_rocks_02.wsp_beach_rocks_02_C
// Size: 0x470 (Inherited: 0x408)
struct Awsp_beach_rocks_02_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* wsp_rock_xtra_small__c10_1; // 0x408(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__e4_1; // 0x410(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__e3_1; // 0x418(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__c6_1; // 0x420(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__c5_1; // 0x428(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__c9_1; // 0x430(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__c8_1; // 0x438(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__c7_1; // 0x440(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__c4_1; // 0x448(0x08)
	struct UStaticMeshComponent* wsp_rock_xtra_small__e2_1; // 0x450(0x08)
	struct UStaticMeshComponent* wsp_rock_cliff_o8_1; // 0x458(0x08)
	struct UStaticMeshComponent* wsp_rock_cliff_o9_1; // 0x460(0x08)
	struct USceneComponent* Scene; // 0x468(0x08)

	void UserConstructionScript(); // Function wsp_beach_rocks_02.wsp_beach_rocks_02_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

