// BlueprintGeneratedClass wsp_cave_rocks_09.wsp_cave_rocks_09_C
// Size: 0x458 (Inherited: 0x408)
struct Awsp_cave_rocks_09_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* StaticMesh7; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x448(0x08)
	struct USceneComponent* SharedRoot; // 0x450(0x08)

	void UserConstructionScript(); // Function wsp_cave_rocks_09.wsp_cave_rocks_09_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

