// BlueprintGeneratedClass wsp_cave_rocks_02.wsp_cave_rocks_02_C
// Size: 0x448 (Inherited: 0x408)
struct Awsp_cave_rocks_02_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x438(0x08)
	struct USceneComponent* SharedRoot; // 0x440(0x08)

	void UserConstructionScript(); // Function wsp_cave_rocks_02.wsp_cave_rocks_02_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

