// BlueprintGeneratedClass wsp_Pole_Orb_Light.wsp_Pole_Orb_Light_C
// Size: 0x408 (Inherited: 0x3c8)
struct Awsp_Pole_Orb_Light_C : AActor {
	struct UPointLightComponent* PointLight2; // 0x3c8(0x08)
	struct UPointLightComponent* PointLight1; // 0x3d0(0x08)
	struct UPointLightComponent* PointLight; // 0x3d8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x3e0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x3e8(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x3f0(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x3f8(0x08)
	struct USceneComponent* SharedRoot; // 0x400(0x08)

	void UserConstructionScript(); // Function wsp_Pole_Orb_Light.wsp_Pole_Orb_Light_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

