// BlueprintGeneratedClass wsp_beach_rocks_08.wsp_beach_rocks_08_C
// Size: 0x468 (Inherited: 0x408)
struct Awsp_beach_rocks_08_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* StaticMeshComponent010; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMeshComponent09; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMeshComponent08; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMeshComponent07; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMeshComponent06; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMeshComponent05; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMeshComponent04; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMeshComponent03; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMeshComponent02; // 0x448(0x08)
	struct UStaticMeshComponent* StaticMeshComponent01; // 0x450(0x08)
	struct UStaticMeshComponent* StaticMeshComponent0; // 0x458(0x08)
	struct USceneComponent* SharedRoot; // 0x460(0x08)

	void UserConstructionScript(); // Function wsp_beach_rocks_08.wsp_beach_rocks_08_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

