// BlueprintGeneratedClass wsp_beach_rocks_05_b.wsp_beach_rocks_05_b_C
// Size: 0x458 (Inherited: 0x408)
struct Awsp_beach_rocks_05_b_C : ABP_Placement_HeightDrop_C {
	struct UStaticMeshComponent* StaticMesh1; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMesh16; // 0x410(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x418(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x420(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x428(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x430(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x438(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x440(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x448(0x08)
	struct USceneComponent* Scene; // 0x450(0x08)

	void UserConstructionScript(); // Function wsp_beach_rocks_05_b.wsp_beach_rocks_05_b_C.UserConstructionScript // Event|Public|BlueprintCallable|BlueprintEvent // @ game+0x1848130
};

